Функция ПолучитьСклад(Заведение, ТипСклада) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Заведение КАК Заведение,
		|	Склады.Ссылка КАК Ссылка,
		|	Склады.СкладПринадлежность КАК СкладПринадлежность
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Заведение = &Заведение
		|	И Склады.СкладПринадлежность = &СкладПринадлежность";
	
	Запрос.УстановитьПараметр("Заведение", Заведение);
	Запрос.УстановитьПараметр("СкладПринадлежность", ТипСклада);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
		
	Возврат Выборка.Ссылка;	
	
КонецФункции