
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!

	// регістр ТекушийБалансКассы Приход
	Движения.ТекушийБалансКассы.Записывать = Истина;
	Движение = Движения.ТекушийБалансКассы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Касса = КассаДляПеремещения;
	Движение.Сумма = Сумма;

	// регістр ТекушийБалансКассы Расход
	Движения.ТекушийБалансКассы.Записывать = Истина;
	Движение = Движения.ТекушийБалансКассы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Касса = КассаОсновная;
	Движение.Сумма = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
