#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьДокументПереоценки(ТЗ_ДанныеПереценки, ДатаДокумента) Экспорт  
	
	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(ТЗ_ДанныеПереценки, "ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТЗ_ДанныеПереценки.Количество()=0 Тогда 
		Возврат;  
	КонецЕсли;
	
	Док = Документы.Переоценка.СоздатьДокумент();
	Док.Дата = ДатаДокумента;
	
	Для Каждого Данные Из ТЗ_ДанныеПереценки Цикл
		НоваяСтрока = Док.СписокТоваров.Добавить();
		НоваяСтрока.Номенклатура = Данные.Номенклатура;
		НоваяСтрока.Цена = Данные.Цена;
	КонецЦикла;
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Документ переоценки " + Док.Номер + " был успешено проведен!");
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = "Документ переоценки " + Док.Номер + " был успешено проведен!";
		//Сообщение.УстановитьДанные();
		//Сообщение.Сообщить();
	Исключение
		Сообщить("Не удалост провести документ переоценки по причине " + ОписаниеОшибки());
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = "Не удалост провести документ переоценки по причине " + ОписаниеОшибки();
		//Сообщение.УстановитьДанные();
		//Сообщение.Сообщить();     
	КонецПопытки; 
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти
