
&НаСервере
Функция ПолучитьАтрибут()

	Возврат Перечисления.АтрибутыЗадачи.Запланировано;	

КонецФункции // ПолучитьАтрибут()


&НаСервере
Функция ПолучитьПользователя()
	
	Возврат ПодготовкаДанных.ПолучитьТекущегоПользователя();	

КонецФункции // ПолучитьПользователя()


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Список.Параметры.УстановитьЗначениеПараметра("Атрибут", ПолучитьАтрибут());
	Список.Параметры.УстановитьЗначениеПараметра("ДатаПланирования", ТекущаяДата());
	Список.Параметры.УстановитьЗначениеПараметра("Родитель", Неопределено);
	Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ПолучитьПользователя());
	Список.Параметры.УстановитьЗначениеПараметра("Родитель", Неопределено);

	
КонецПроцедуры

