
#Область ОписаниеПеременных

// ПодключаемоеОборудование
Перем ПараметрыПриложения Экспорт;
// Конец ПодключаемоеОборудование

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы(Отказ)

	// ПодключаемоеОборудование
	ИнтеграцияПодсистемБПОКлиент.ПередНачаломРаботыСистемы();
	// Конец ПодключаемоеОборудование

КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()

	// ПодключаемоеОборудование
	ИнтеграцияПодсистемБПОКлиент.ПриНачалеРаботыСистемы();
	// Конец ПодключаемоеОборудование      
	Если КассовыеСменыВызовСервера.ПользовательИмеетРольКассира() Тогда
		ОткрытьФорму("Обработка.РабочееМестоКассира.Форма");
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)

	// ПодключаемоеОборудование
	ИнтеграцияПодсистемБПОКлиент.ОбработкаВнешнегоСобытия(Источник, Событие, Данные);
	// Конец ПодключаемоеОборудование

КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)

	ИнтеграцияПодсистемБПОКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);

КонецПроцедуры

#КонецОбласти