
&НаСервере
Процедура СоздатьНаСервере()
	
	СсылкаНаЗадачу = Документы.ПланРабот.СозданиеДокументаПланаРабот(ТекущаяДата(),,Объект.ОписаниеЗадачи,Объект.Ответственный,Перечисления.СтатусВыполнения.Создано,
				,,Перечисления.ТипПланаРабот.Главный,Объект.Объект,Перечисления.ФункциональныйТипПлана.ПланЗадача,Объект.КласификацияЗадачи);
	Документы.СменаСтатуса.СменаСтатуса(,,СсылкаНаЗадачу,Перечисления.СтатусВыполнения.Создано,);
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	СоздатьНаСервере();
КонецПроцедуры
