
&НаСервере
Функция  НайтиОплатуНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйКассовыйОрдер.СсылкаНаНакладную КАК СсылкаНаНакладную,
		|	РасходныйКассовыйОрдер.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|ГДЕ
		|	РасходныйКассовыйОрдер.СсылкаНаНакладную = &СсылкаНаНакладную";
	
	Запрос.УстановитьПараметр("СсылкаНаНакладную", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	
КонецФункции

&НаКлиенте
Процедура НайтиОплату(Команда)
	СсылкаНаОрдер = НайтиОплатуНаСервере();
	Если СсылкаНаОрдер = Неопределено Тогда
		Сообщить("Оплата не была найдена!");
	Иначе
		Парам = Новый Структура;
		Парам.Вставить("Ключ",СсылкаНаОрдер);
		ОткрытьФорму("Документ.РасходныйКассовыйОрдер.Форма.ФормаДокумента",Парам);
	КонецЕсли;
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ДокументСоздан = ПодготовкаДанных.ПолучениеПользователя();    
КонецПроцедуры       

&НаСервере
Процедура СписокТоваров_ПриИзминении_НаСервере(ИмяКолонки, ТекущаяСтрока)
		
	Если ИмяКолонки = "СписокТоваровНоменклатура" Тогда
		ДанныеСтроки = Объект.СписокТоваров.Получить(ТекущаяСтрока);		
	    ДанныеСтроки.СтараяЦена = Справочники.Номенклатура.ПолучитьЦенуТовара(ДанныеСтроки.Номенклатура); 
		//Модуль_Учета.ПолучитьЦенуНоменлатуры(ДанныеСтроки.Номенклатура);   
		ДанныеСтроки.ПроцентНаценки = Справочники.Номенклатура.ПолучитьПроцентНаценки(ДанныеСтроки.Номенклатура);
	КонецЕсли;      
	
	Если ИмяКолонки = "СписокТоваровКоличество" Тогда
		ДанныеСтроки = Объект.СписокТоваров.Получить(ТекущаяСтрока);		
	КонецЕсли;

	Если ИмяКолонки = "СписокТоваровЦена" Тогда
		ДанныеСтроки = Объект.СписокТоваров.Получить(ТекущаяСтрока);		
	
	КонецЕсли;
	
	Если ИмяКолонки = "СписокТоваровСумма" Тогда
		ДанныеСтроки = Объект.СписокТоваров.Получить(ТекущаяСтрока);		
 
	КонецЕсли;
	
	Если ИмяКолонки = "СписокТоваровПроцентНаценки" Тогда
		ДанныеСтроки = Объект.СписокТоваров.Получить(ТекущаяСтрока);		

	КонецЕсли;

КонецПроцедуры // СписокТоваров_ПриИзминении_НаСервере()


&НаКлиенте
Процедура СписокТоваровПриИзменении(Элемент)
	
	СписокТоваров_ПриИзминении_НаСервере(Элемент.Имя, Элементы.СписокТоваров.ТекущиеДанные.ИсходныйНомерСтроки);   
	
КонецПроцедуры

