
&НаКлиенте
Функция ПолучитьРевизиюИнтерфейса() Экспорт
	
	Возврат 3006;	
	
КонецФункции

&НаКлиенте
Функция ПолучитьОписание(ОписаниеДрайвера) Экспорт
	
	ОписаниеДрайвераXML = Новый ЗаписьXML;
	ОписаниеДрайвераXML.УстановитьСтроку("UTF-8");
	ОписаниеДрайвераXML.ЗаписатьОбъявлениеXML();
	
	ОписаниеДрайвераXML.ЗаписатьНачалоЭлемента("DriverDescription");
	ОписаниеДрайвераXML.ЗаписатьАтрибут("Name", "Вчасно.Каса");
	ОписаниеДрайвераXML.ЗаписатьАтрибут("Description", "Вчасно.Каса – це програмний реєстратор розрахункових операцій (РРО). Дозволяє швидко та зручно видавати фіскальні чеки. В онлайн чи офлайн режимі.");
	ОписаниеДрайвераXML.ЗаписатьАтрибут("EquipmentType", "ФискальныйРегистратор");
	ОписаниеДрайвераXML.ЗаписатьАтрибут("IntegrationComponent", "false");
	ОписаниеДрайвераXML.ЗаписатьАтрибут("MainDriverInstalled", "false");
	ОписаниеДрайвераXML.ЗаписатьАтрибут("DriverVersion", мВерсия);
	ОписаниеДрайвераXML.ЗаписатьАтрибут("IntegrationComponentVersion", мВерсия);
	ОписаниеДрайвераXML.ЗаписатьКонецЭлемента();
	
	ОписаниеДрайвера = ОписаниеДрайвераXML.Закрыть();
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ПолучитьОшибку(ОписаниеОшибки) Экспорт
	
	ОписаниеОшибки = мОшибка.Описание;
	
	Возврат мОшибка.Код;
	
КонецФункции

&НаКлиенте
Функция ПолучитьПараметры(ТаблицаПараметров) Экспорт
	
	ТаблицаПараметровXML = Новый ЗаписьXML;
	ТаблицаПараметровXML.УстановитьСтроку("UTF-8");
	ТаблицаПараметровXML.ЗаписатьОбъявлениеXML();
	
	ТаблицаПараметровXML.ЗаписатьНачалоЭлемента("Settings");
	
	ТаблицаПараметровXML.ЗаписатьНачалоЭлемента("Parameter");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Name", "SecureConnection");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Caption", "Тип з'єднання");
	ТаблицаПараметровXML.ЗаписатьАтрибут("TypeValue", "Number");
	ТаблицаПараметровXML.ЗаписатьАтрибут("DefaultValue", "0");
	ТаблицаПараметровXML.ЗаписатьКонецЭлемента();
	
	ТаблицаПараметровXML.ЗаписатьНачалоЭлемента("Parameter");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Name", "Host");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Caption", "Сервер");
	ТаблицаПараметровXML.ЗаписатьАтрибут("TypeValue", "String");
	ТаблицаПараметровXML.ЗаписатьАтрибут("DefaultValue", "localhost");
	ТаблицаПараметровXML.ЗаписатьКонецЭлемента();
	
	ТаблицаПараметровXML.ЗаписатьНачалоЭлемента("Parameter");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Name", "Port");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Caption", "Порт");
	ТаблицаПараметровXML.ЗаписатьАтрибут("TypeValue", "Number");
	ТаблицаПараметровXML.ЗаписатьАтрибут("DefaultValue", "3939");
	ТаблицаПараметровXML.ЗаписатьКонецЭлемента();	
	
	ТаблицаПараметровXML.ЗаписатьНачалоЭлемента("Parameter");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Name", "Device");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Caption", "Назва ПРРО");
	ТаблицаПараметровXML.ЗаписатьАтрибут("TypeValue", "String");
	ТаблицаПараметровXML.ЗаписатьКонецЭлемента();	
		
	ТаблицаПараметровXML.ЗаписатьНачалоЭлемента("Parameter");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Name", "CorrespondenceTable");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Caption", "Таблиця відповідностей");
	ТаблицаПараметровXML.ЗаписатьАтрибут("TypeValue", "ValueTable");
	ТаблицаПараметровXML.ЗаписатьКонецЭлемента();
	
	ТаблицаПараметровXML.ЗаписатьНачалоЭлемента("Parameter");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Name", "RoundingAccuracy");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Caption", "Точність округлення");
	ТаблицаПараметровXML.ЗаписатьАтрибут("TypeValue", "Number");
	ТаблицаПараметровXML.ЗаписатьКонецЭлемента();
	
	ТаблицаПараметровXML.ЗаписатьНачалоЭлемента("Parameter");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Name", "UseAuthentication");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Caption", "Використовувати автентифікацію");
	ТаблицаПараметровXML.ЗаписатьАтрибут("TypeValue", "Boolean");
	ТаблицаПараметровXML.ЗаписатьКонецЭлемента();
	
	ТаблицаПараметровXML.ЗаписатьНачалоЭлемента("Parameter");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Name", "XApiKey");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Caption", "");
	ТаблицаПараметровXML.ЗаписатьАтрибут("TypeValue", "String");
	ТаблицаПараметровXML.ЗаписатьКонецЭлемента();
	
	ТаблицаПараметровXML.ЗаписатьНачалоЭлемента("Parameter");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Name", "BatchMode");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Caption", "Пакетний режим");
	ТаблицаПараметровXML.ЗаписатьАтрибут("TypeValue", "Boolean");
	ТаблицаПараметровXML.ЗаписатьКонецЭлемента();
	
	ТаблицаПараметровXML.ЗаписатьНачалоЭлемента("Parameter");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Name", "UseNotifications");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Caption", "Відправляти чеки на пошту / viber / смс");
	ТаблицаПараметровXML.ЗаписатьАтрибут("TypeValue", "Boolean");
	ТаблицаПараметровXML.ЗаписатьКонецЭлемента();
	
	ТаблицаПараметровXML.ЗаписатьНачалоЭлемента("Parameter");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Name", "Output");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Caption", "Виведення чека");
	ТаблицаПараметровXML.ЗаписатьАтрибут("TypeValue", "Number");
	ТаблицаПараметровXML.ЗаписатьКонецЭлемента();
	
	ТаблицаПараметровXML.ЗаписатьНачалоЭлемента("Parameter");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Name", "Printer1");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Caption", "");
	ТаблицаПараметровXML.ЗаписатьАтрибут("TypeValue", "String");
	ТаблицаПараметровXML.ЗаписатьКонецЭлемента();
	
	ТаблицаПараметровXML.ЗаписатьНачалоЭлемента("Parameter");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Name", "Printer2");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Caption", "");
	ТаблицаПараметровXML.ЗаписатьАтрибут("TypeValue", "String");
	ТаблицаПараметровXML.ЗаписатьКонецЭлемента();
	
	ТаблицаПараметровXML.ЗаписатьНачалоЭлемента("Parameter");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Name", "AdvancedOutput");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Caption", "");
	ТаблицаПараметровXML.ЗаписатьАтрибут("TypeValue", "ValueTable");
	ТаблицаПараметровXML.ЗаписатьКонецЭлемента();
	
	ТаблицаПараметровXML.ЗаписатьНачалоЭлемента("Parameter");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Name", "CommentUp");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Caption", "Коментар, що друкується зверху чеку");
	ТаблицаПараметровXML.ЗаписатьАтрибут("TypeValue", "String");
	ТаблицаПараметровXML.ЗаписатьКонецЭлемента();
	
	ТаблицаПараметровXML.ЗаписатьНачалоЭлемента("Parameter");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Name", "CommentDown");
	ТаблицаПараметровXML.ЗаписатьАтрибут("Caption", "Коментар, що друкується знизу чеку");
	ТаблицаПараметровXML.ЗаписатьАтрибут("TypeValue", "String");
	ТаблицаПараметровXML.ЗаписатьКонецЭлемента();
	
	ТаблицаПараметровXML.ЗаписатьКонецЭлемента();
	
	ТаблицаПараметров = ТаблицаПараметровXML.Закрыть();
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция УстановитьПараметр(Имя, Значение) Экспорт
	
	Если Имя = "CorrespondenceTable" Тогда
		ЭтотОбъект[Имя].Очистить();
		Если Значение <> Неопределено Тогда			
			Для Каждого Элемент Из Значение Цикл
				Строка = ЭтотОбъект[Имя].Добавить();
				Строка.НалоговаяГруппаРРО = Элемент[0];
				Строка.СтавкаНДС = Элемент[1];
				Строка.ПодакцизныйТовар = Элемент[2]; 
			КонецЦикла;                        
		КонецЕсли;
	ИначеЕсли Имя = "AdvancedOutput" Тогда
		ЭтотОбъект[Имя].Очистить();
		Если Значение <> Неопределено Тогда			
			Для Каждого Элемент Из Значение Цикл
				Строка = ЭтотОбъект[Имя].Добавить();
				Строка.ФискальноеЗадание = Элемент[0];
				Строка.ВыводЧека = Элемент[1];
				Строка.Принтер = Элемент[2]; 
				Строка.Принтер1 = Элемент[3];
				Строка.Принтер2 = Элемент[4];
			КонецЦикла;
		КонецЕсли;
	Иначе
		ЭтотОбъект[Имя] = Значение;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция Подключить(ИДУстройства) Экспорт
	
	Результат = Ложь;
	
	Ответ = Неопределено;
	Заголовки = Новый Соответствие;
	Если UseAuthentication Тогда
		Заголовки.Вставить("X-Api-Key", XApiKey);	
	КонецЕсли;
	Если HTTP("GET", ?(SecureConnection, "https", "http"), Host, Port, "/dm/vchasno-kasa/api/v1/dashboard", Заголовки, , , Ответ) Тогда
		Для Каждого Устройство Из Ответ["devices"] Цикл
			Если Device = Устройство["device"] Тогда
				Результат = Истина;
				ИДУстройства = Устройство["dev_id"];
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не Результат Тогда
			СформироватьОшибку(999, "Пристрою з вказаною в запиті назвою (" + Device + ") не існує в DEVICE MANAGER. Потрібно перевірити коректність назви.");
		КонецЕсли;
	Иначе
		СформироватьОшибку(999, Ответ);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Отключить(ИДУстройства) Экспорт
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ТестУстройства(Описание, АктивированДемоРежим) Экспорт
	
	мФискальныеДанные = Новый Структура("task", 18);
		
	Ответ = Неопределено;
	Результат = ВыполнитьФискальноеЗадание(Ответ);
	
	Если Результат Тогда
		Описание = "
		|Назва ПРРО:" + Символы.НПП + Device + "
		|Тип ПРРО:" + Символы.НПП + ?(Ответ["info"]["isFis"], "Фіскальний", "Тестовий") + "
		|Номер ПРРО:" + Символы.НПП + Ответ["info"]["fisid"] + "
		|Стан зміни:" + Символы.НПП + ?(Ответ["info"]["shift_status"], Дата(Ответ["info"]["shift_dt"]), "Закрита") + "
		|Режим роботи:" + Символы.НПП + ?(Ответ["info"]["online_status"], "Offline", "Online");
		
		Если Не Ответ["info"]["isFis"] Тогда
			АктивированДемоРежим = "Тестовий ПРРО";
		КонецЕсли;
	Иначе
		Описание = мОшибка.Описание;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьДополнительныеДействия(ТаблицаДействий) Экспорт
	
	ТаблицаДействийXML = Новый ЗаписьXML;
	ТаблицаДействийXML.УстановитьСтроку("UTF-8");
	ТаблицаДействийXML.ЗаписатьОбъявлениеXML();
	
	ТаблицаДействийXML.ЗаписатьНачалоЭлемента("Actions");
	ТаблицаДействийXML.ЗаписатьКонецЭлемента();
	
	ТаблицаДействий = ТаблицаДействийXML.Закрыть();
	
	Возврат Истина;	
	
КонецФункции

&НаКлиенте
Функция ВыполнитьДополнительноеДействие(ИмяДействия) Экспорт
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ОткрытьСмену(ИДУстройства) Экспорт
	
	мФискальныеДанные = Новый Структура("task", 0);
		
	Результат = ВыполнитьФискальноеЗадание();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОткрытьЧек(ИДУстройства, ФискальныйЧек, ЧекВозврата, АннулироватьОткрытыйЧек, НомерЧека, НомерСмены) Экспорт

	мФискальныеДанные = Новый Структура("task, receipt", ?(ЧекВозврата, 2, 1), Новый Структура("rows, pays", Новый Массив, Новый Массив));
		
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция НапечататьФискСтроку(ИДУстройства, Наименование, Количество, Цена, Сумма, Отдел, НДС, ДопРеквизиты) Экспорт
	
	Результат = Ложь;
	
	ЧтениеXML = Новый ЧтениеXML; 
	ЧтениеXML.УстановитьСтроку(ДопРеквизиты);
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.Имя = "Record" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда		
			
			СтавкаНДССтрока = ЧтениеXML.ЗначениеАтрибута("VAT");
			ЕстьАкциз = XMLЗначение(Тип("Булево"), ЧтениеXML.ЗначениеАтрибута("IsExcisable"));
			
			НоменклатураНаименование = ЧтениеXML.ЗначениеАтрибута("Nomenclature");
			УКТЗЕД = ЧтениеXML.ЗначениеАтрибута("UKTZED");
			Артикул = ЧтениеXML.ЗначениеАтрибута("VendorCode");
			ШтрихКод = ЧтениеXML.ЗначениеАтрибута("Barcode");
			ЕдИзмерения = ЧтениеXML.ЗначениеАтрибута("Dimension");
			Скидка = XMLЗначение(Тип("Число"), ЧтениеXML.ЗначениеАтрибута("Discount"));
			СуммаСкидки = XMLЗначение(Тип("Число"), ЧтениеXML.ЗначениеАтрибута("DiscountAmount"));
			ЦенаВключаетНДС = ЧтениеXML.ЗначениеАтрибута("PriceIncludeVAT");
			СуммаНДС = XMLЗначение(Тип("Число"), ЧтениеXML.ЗначениеАтрибута("AmountVAT"));
			ШтихкодАкцизнойМарки = ЧтениеXML.ЗначениеАтрибута("ExciseStampBarcode");
			
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаСоответствий = CorrespondenceTable.НайтиСтроки(Новый Структура("СтавкаНДС, ПодакцизныйТовар", СтавкаНДССтрока, ЕстьАкциз));
	
	Если ТаблицаСоответствий.Количество() = 1 Тогда
		Результат = Истина;
		
		ФискСтрока = Новый Структура;
		ФискСтрока.Вставить("code", Артикул);
		ФискСтрока.Вставить("code1", ШтрихКод);
		ФискСтрока.Вставить("code2", УКТЗЕД);
		ФискСтрока.Вставить("code3", "");
		Если Найти(ШтихкодАкцизнойМарки, ",") Тогда
			ФискСтрока.Вставить("code_aa", РазложитьСтрокуВМассивПодстрок(ШтихкодАкцизнойМарки));
		Иначе
			ФискСтрока.Вставить("code_a", ШтихкодАкцизнойМарки);
		КонецЕсли;
		ФискСтрока.Вставить("name", СтрЗаменить(Наименование, УКТЗЕД + "#", ""));
		ФискСтрока.Вставить("cnt", Количество);
		ФискСтрока.Вставить("price", Цена);
		ФискСтрока.Вставить("disc", Окр(Количество * Цена, 2) - Сумма);
		ФискСтрока.Вставить("disc_type", 0);
		ФискСтрока.Вставить("cost", Окр(Количество * Цена, 2));
		ФискСтрока.Вставить("taxgrp", ТаблицаСоответствий[0].НалоговаяГруппаРРО);
		ФискСтрока.Вставить("comment", "");
		
		мФискальныеДанные.receipt.rows.Добавить(ФискСтрока);		
	Иначе
		СформироватьОшибку(999, "Не знайдені параметри торгового устаткування (параметри оподаткування).
		|" + СтрЗаменить(Наименование, УКТЗЕД + "#", "") + "
		|Ставка ПДВ:" + Символы.НПП + СтавкаНДССтрока + "
		|Підакцизний:" + Символы.НПП + Формат(ЕстьАкциз, "БЛ=Ні; БИ=Так"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НапечататьНефискСтроку(ИДУстройства, СтрокаТекста) Экспорт

	Возврат Истина;	
	
КонецФункции

&НаКлиенте
Функция НапечататьШтрихКод(ИДУстройства, ТипШтрихкода, Штрихкод) Экспорт

	Возврат Истина;	
	
КонецФункции

&НаКлиенте
Функция ЗакрытьЧек(ИДУстройства, НаличнаяОплата, ОплатаКартой, ОплатаКредитом, ОплатаСертификатом, СуммаЧека, НомерЧекаВозврата, НомерСозданногоЧека, ФискальныйНомерСозданногоЧека) Экспорт
	   	
	Если UseNotifications Тогда
		ТипКонтактнойИнформации = "";
		ЗначениеКонтактнойИнформации = "";
		ВвестиКонтактнуюИнформацию(ТипКонтактнойИнформации, ЗначениеКонтактнойИнформации);
		Если ЗначениеЗаполнено(ЗначениеКонтактнойИнформации) Тогда
			мКлиентскиеДанные = Новый Структура(ТипКонтактнойИнформации, ЗначениеКонтактнойИнформации);
		КонецЕсли;
	КонецЕсли; 
			
	мФискальныеДанные.receipt.Вставить("sum", СуммаЧека);
	мФискальныеДанные.receipt.Вставить("comment_up", CommentUp);
	мФискальныеДанные.receipt.Вставить("comment_down", CommentDown);
	мФискальныеДанные.receipt.Вставить("not_check_safe", Истина);

	Если НаличнаяОплата Тогда
		БезналичнаяОплата = ОплатаКартой + ОплатаКредитом + ОплатаСертификатом;
		ТочностьОкругления = ?(RoundingAccuracy = 0, HTA(), RoundingAccuracy);
		
		мФискальныеДанные.receipt.Вставить("round", Округлить(СуммаЧека - БезналичнаяОплата, ТочностьОкругления) - (СуммаЧека - БезналичнаяОплата));
		
		Оплата = Новый Структура;
		Оплата.Вставить("type", 0);
		Оплата.Вставить("sum", Округлить(СуммаЧека - БезналичнаяОплата, ТочностьОкругления));
		Оплата.Вставить("comment", "");
		Оплата.Вставить("change", Округлить(НаличнаяОплата, ТочностьОкругления) - Округлить(СуммаЧека - БезналичнаяОплата, ТочностьОкругления));
		мФискальныеДанные.receipt.pays.Добавить(Оплата);
	КонецЕсли;
	
	Если ОплатаКартой Тогда
		
		Если BatchMode И мФискальныеДанные.task = 2 Тогда
			КодRRN = "";
			ВвестиКодRRN(КодRRN, НомерЧекаВозврата);
			Если ЗначениеЗаполнено(КодRRN) Тогда
				мЭквайринговыеДанные = Новый Структура("task, refundid", 2, КодRRN);
			КонецЕсли;
		КонецЕсли;
		
		Оплата = Новый Структура;
		Оплата.Вставить("type", 2);
		Оплата.Вставить("sum", ОплатаКартой);
		Оплата.Вставить("comment", "");
		мФискальныеДанные.receipt.pays.Добавить(Оплата);
	КонецЕсли;
	
	Если ОплатаКредитом Тогда
		Оплата = Новый Структура;
		Оплата.Вставить("type", 5);
		Оплата.Вставить("sum", ОплатаКредитом);
		Оплата.Вставить("comment", "");
		мФискальныеДанные.receipt.pays.Добавить(Оплата);
	КонецЕсли;
	
	Если ОплатаСертификатом Тогда
		Оплата = Новый Структура;
		Оплата.Вставить("type", 6);
		Оплата.Вставить("sum", ОплатаСертификатом);
		Оплата.Вставить("comment", "");
		мФискальныеДанные.receipt.pays.Добавить(Оплата);
	КонецЕсли;
	
	Ответ = Неопределено;
	Результат = ВыполнитьФискальноеЗадание(Ответ);
	
	Если Результат Тогда
		НомерСозданногоЧека = Ответ["info"]["docno"];
		ФискальныйНомерСозданногоЧека = Ответ["info"]["doccode"];
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОтменитьЧек(ИДУстройства) Экспорт

	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция НапечататьЧекВнесенияВыемки(ИДУстройства, Сумма) Экспорт

	мФискальныеДанные = Новый Структура("task, cash", ?(Сумма > 0, 3, 4), Новый Структура);
	мФискальныеДанные.cash.Вставить("type", 0);
	мФискальныеДанные.cash.Вставить("sum", ?(Сумма > 0, Сумма, -Сумма));
	мФискальныеДанные.cash.Вставить("comment_up", "");
	мФискальныеДанные.cash.Вставить("comment_down", "");
			
	Результат = ВыполнитьФискальноеЗадание();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НапечататьОтчетБезГашения(ИДУстройства) Экспорт
	
	мФискальныеДанные = Новый Структура("task", 10);
		
	Результат = ВыполнитьФискальноеЗадание();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НапечататьОтчетСГашением(ИДУстройства) Экспорт

	мФискальныеДанные = Новый Структура("task", 11);
		
	Результат = ВыполнитьФискальноеЗадание();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОткрытьДенежныйЯщик(ИДУстройства) Экспорт

	СформироватьОшибку(999, "Даний тип обладнання не підтримує дану команду");
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ПолучитьШиринуСтроки(ИДУстройства, ШиринаСтроки) Экспорт

	Ответ = Неопределено;
	Заголовки = Новый Соответствие;
	Если UseAuthentication Тогда
		Заголовки.Вставить("X-Api-Key", XApiKey);
	КонецЕсли;
	Результат = HTTP("GET", ?(SecureConnection, "https", "http"), Host, Port, "/dm/vchasno-kasa/api/v1/prro?dev_id=" + ИДУстройства, Заголовки, , , Ответ);
	
	Если Результат Тогда
		ШиринаСтроки = Ответ["printforms"]["pf_charcount"];
	Иначе
		СформироватьОшибку(999, Ответ);
	КонецЕсли;
	
	Возврат Результат;		
	
КонецФункции

&НаКлиенте
Функция НапечататьПериодическийОтчетПоДатам(ИДУстройства, ПериодНачало, ПериодКонец, Сокращенный) Экспорт

	мФискальныеДанные = Новый Структура("task, dt_from, dt_to, is_short", 13, Формат(НачалоДня(ПериодНачало), "ДФ=yyyyMMddHHmmss"), Формат(КонецДня(ПериодКонец), "ДФ=yyyyMMddHHmmss"), Сокращенный);
		
	Результат = ВыполнитьФискальноеЗадание();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НапечататьПериодическийОтчетПоНомерам(ИДУстройства, НомерНачало, НомерКонец, Сокращенный) Экспорт

	мФискальныеДанные = Новый Структура("task, n_from, n_to, is_short", 12, НомерНачало, НомерКонец, Сокращенный);
		
	Результат = ВыполнитьФискальноеЗадание();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НапечататьНулевойЧек(ИДУстройства) Экспорт  

	мФискальныеДанные = Новый Структура("task, receipt", 1, Новый Структура("sum, rows, pays", 0, Новый Массив, Новый Массив)); 
		
	Результат = ВыполнитьФискальноеЗадание();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НапечататьОтчетОПроданныхТоварах(ИДУстройства) Экспорт

	СформироватьОшибку(999, "Даний тип обладнання не підтримує дану команду");
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция СторнироватьЧек(ИДУстройства) Экспорт

	мФискальныеДанные = Новый Структура("task", 17);
    	
	Результат = ВыполнитьФискальноеЗадание();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОтобразитьЧек(ИДУстройства, ФискальныйЧек) Экспорт

	мФискальныеДанные = Новый Структура("task, fiscal_number", 23, ФискальныйЧек);
		
	Результат = ВыполнитьФискальноеЗадание();
	
	Возврат Результат;		
	
КонецФункции

&НаКлиенте
Функция ВыполнитьФискальноеЗадание(Ответ = Неопределено, ФискальныеДанные = Неопределено)
	
	АдресРесурса = "/dm/execute";
	
	Запрос = Новый Структура;
	Запрос.Вставить("ver", 6);
	Запрос.Вставить("source", мИсточник);
	Запрос.Вставить("device", Device);
	Запрос.Вставить("tag", Строка(Новый УникальныйИдентификатор));
	Запрос.Вставить("need_pf_img", 2);
	Запрос.Вставить("need_pf_pdf", 1);
	Запрос.Вставить("need_pf_txt", 1);
	Запрос.Вставить("need_pf_doccmd", 1);
	Запрос.Вставить("type", 1);
	
	Если ФискальныеДанные = Неопределено Тогда
		
		Если ЗначениеЗаполнено(мКлиентскиеДанные) Тогда
			Запрос.Вставить("userinfo", мКлиентскиеДанные);
		КонецЕсли;
		Запрос.Вставить("fiscal", мФискальныеДанные);
		Если ЗначениеЗаполнено(мЭквайринговыеДанные) Тогда
			Запрос.Вставить("pay", мЭквайринговыеДанные);
		КонецЕсли;
		
		ВыводЧека = Output;
		ИмяПринтера = ?(ВыводЧека = 1 Или ВыводЧека = 2, ЭтотОбъект["Printer" + ВыводЧека], "");
		
		Если ВыводЧека = 4 Тогда
			ВыводЧека = 0;
			ИмяПринтера = "";			
			Строки = AdvancedOutput.НайтиСтроки(Новый Структура("ФискальноеЗадание", мФискальныеДанные.task));
			Для Каждого Строка Из Строки Цикл			
				ВыводЧека = Строка.ВыводЧека;
				ИмяПринтера = ?(ВыводЧека = 1 Или ВыводЧека = 2, Строка["Принтер" + ВыводЧека], "");
			КонецЦикла;
		КонецЕсли;
		
		Если BatchMode Тогда
			АдресРесурса = "/dm/execute-pkg";
		ИначеЕсли ВыводЧека = 2 Тогда
			АдресРесурса = "/dm/execute-prn" + ?(ПустаяСтрока(ИмяПринтера), "", "?dev_id=" + ИмяПринтера);
		КонецЕсли;
		
		Результат = HTTP("POST", ?(SecureConnection, "https", "http"), Host, Port, АдресРесурса, , "JSON", Запрос, Ответ);
		
		Если Результат Тогда
			Если Ответ["res"] Тогда
				Если Ложь Тогда
				ИначеЕсли мФискальныеДанные.task = 0 И Ответ["res"] = 1096 Тогда
				Иначе
					Результат = Ложь;
					СформироватьОшибку(Ответ["res"], "Помилка при роботі DEVICE MANAGER:" + Символы.НПП + Ответ["errortxt"] + Символы.НПП + "(" + Формат(Ответ["res"], "ЧГ=0") + ")");
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Ответ["pf_image"]) Тогда
				П = Новый Структура;
				П.Вставить("Картинка", Новый Картинка(Base64Значение(СтрЗаменить(Ответ["pf_image"], "data:image/png;base64,", ""))));
				П.Вставить("ВыводЧека", ВыводЧека);
				П.Вставить("ИмяПринтера", ИмяПринтера);
				П.Вставить("Заголовок", "Перегляд чека" + ?(Ответ["info"]["doccode"] = Неопределено, "", Символы.НПП + Ответ["info"]["doccode"]));
				
				ОткрытьФорму("ОбщаяФорма.ВчасноКаса_Форма", П, , Истина);
			КонецЕсли;
		Иначе
			СформироватьОшибку(999, Ответ);
		КонецЕсли;
		
		мКлиентскиеДанные = Неопределено;
		мФискальныеДанные = Неопределено;
		мЭквайринговыеДанные = Неопределено;
		
	Иначе
		Запрос.Вставить("fiscal", ФискальныеДанные);
		Результат = HTTP("POST", ?(SecureConnection, "https", "http"), Host, Port, АдресРесурса, , "JSON", Запрос, Ответ);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция HTTP(Метод, Схема, Знач Сервер, Знач Порт = Неопределено, АдресРесурса, ЗаголовкиЗапроса = Неопределено, ТипЗапроса = Неопределено, Запрос = Неопределено, Ответ, Таймаут = 0) Экспорт
	
	Результат = Истина;
	
	Если Не ЗначениеЗаполнено(Порт) Тогда
		Порт = ?(Схема = "http", 80, 443);
	КонецЕсли;
	
	HTTPСоединение = Новый HTTPСоединение(Сервер, Порт, , , , Таймаут, ?(Схема = "http", Неопределено, Новый ЗащищенноеСоединениеOpenSSL));
	URL = Метод + ": " + Схема + "://" + Сервер + ":" + Порт + АдресРесурса;
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, ?(ЗаголовкиЗапроса = Неопределено, Новый Соответствие, ЗаголовкиЗапроса));
	
	Если ТипЗапроса = "form-data" Тогда
		Разделитель = СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "multipart/form-data; boundary=" + Разделитель);
		
		Файл = Новый Файл(Запрос);
		
		Поток = Новый ПотокВПамяти;
		ЗаписьДанных = Новый ЗаписьДанных(Поток, , , Символы.ВК + Символы.ПС, "");
		ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель);
		ЗаписьДанных.ЗаписатьСтроку("Content-Disposition: form-data; name=""file""; filename=""" + Файл.Имя + """");
		ЗаписьДанных.ЗаписатьСтроку("Content-Type: application/pdf");
		ЗаписьДанных.ЗаписатьСтроку("");
		ЗаписьДанных.Записать(Новый ДвоичныеДанные(Запрос)); 
		ЗаписьДанных.ЗаписатьСтроку("");
		ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель + "--");
		ЗаписьДанных.Закрыть();
		
		Данные = Поток.ЗакрытьИПолучитьДвоичныеДанные();	
		HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(Данные);
	ИначеЕсли ТипЗапроса = "Text" Тогда
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "text/plain");
	ИначеЕсли ТипЗапроса = "JavaScript" Тогда
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/javascript");
	ИначеЕсли ТипЗапроса = "JSON" Тогда
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Запрос);
		
		ТелоЗапросаКакСтрока = ЗаписьJSON.Закрыть();
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаКакСтрока, , ИспользованиеByteOrderMark.НеИспользовать);		
	ИначеЕсли ТипЗапроса = "HTML" Тогда
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "text/html");
	ИначеЕсли ТипЗапроса = "XML" Тогда
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/xml");
	КонецЕсли;
	
	Попытка
		Если Метод = "GET" Тогда
			HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
		ИначеЕсли Метод = "POST" Тогда
			HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		ИначеЕсли Метод = "PUT" Тогда
			HTTPОтвет = HTTPСоединение.Записать(HTTPЗапрос);
		ИначеЕсли Метод = "PATCH" Тогда
			HTTPОтвет = HTTPСоединение.Изменить(HTTPЗапрос);
		ИначеЕсли Метод = "DELETE" Тогда
			HTTPОтвет = HTTPСоединение.Удалить(HTTPЗапрос);
		ИначеЕсли Метод = "HEAD" Тогда
			HTTPОтвет = HTTPСоединение.ПолучитьЗаголовки(HTTPЗапрос);
		Иначе
			HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод(Метод, HTTPЗапрос);
		КонецЕсли;
	Исключение
		Результат = Ложь;
		Ответ = ОписаниеОшибки();		
	КонецПопытки;
	
	Если Результат Тогда
		
		ЗаголовкиОтвета = Новый Соответствие;
		Для Каждого ЗаголовокОтвета Из HTTPОтвет.Заголовки Цикл
			ЗаголовкиОтвета.Вставить(НРег(ЗаголовокОтвета.Ключ), ЗаголовокОтвета.Значение);
		КонецЦикла;
		
		Если HTTPОтвет.КодСостояния >= 200 И HTTPОтвет.КодСостояния <= 299 Тогда
			Если ЗаголовкиОтвета["content-disposition"] <> Неопределено И Найти(ЗаголовкиОтвета["content-disposition"], "Attachment") Тогда
				Ответ = Ответ + "-";
				
				ИмяФайла = ЗаголовкиОтвета["content-disposition"];
				ИмяФайла = СтрЗаменить(ИмяФайла, "Attachment; filename=", "");
				ИмяФайла = СтрЗаменить(ИмяФайла, """", "");
				ИмяФайла = Прав(ИмяФайла, 255 - СтрДлина(Ответ));
				
				Ответ = Ответ + ИмяФайла;
				
				HTTPОтвет.ПолучитьТелоКакДвоичныеДанные().Записать(Ответ);
			ИначеЕсли Найти(ЗаголовкиОтвета["content-type"], "application/json") Тогда
				ТелоОтветаКакСтрока = HTTPОтвет.ПолучитьТелоКакСтроку();
				Если ПустаяСтрока(ТелоОтветаКакСтрока) Тогда
					ТелоОтветаКакСтрока = "{}";
				КонецЕсли;
				
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(ТелоОтветаКакСтрока);
				
				Ответ = ПрочитатьJSON(ЧтениеJSON, Истина);
			ИначеЕсли Найти(ЗаголовкиОтвета["content-type"], "text/html") Тогда
				Результат = Ложь;
				Ответ = HTTPОтвет.ПолучитьТелоКакСтроку();
			КонецЕсли; 	
		ИначеЕсли HTTPОтвет.КодСостояния >= 300 И HTTPОтвет.КодСостояния <= 399 Тогда
			Перенаправление = ЗаголовкиОтвета["location"];
			Разделитель = Найти(Перенаправление, "://");
			Схема = Лев(Перенаправление, Разделитель - 1);
			
			Перенаправление = Сред(Перенаправление, Разделитель + 3);
			Разделитель = Найти(Перенаправление, "/");
			АдресРесурса = Сред(Перенаправление, Разделитель);
			
			Перенаправление = Лев(Перенаправление, Разделитель - 1);
			Разделитель = Найти(Перенаправление, ":");
			Если Разделитель Тогда
				Сервер = Лев(Перенаправление, Разделитель - 1);
				Порт = +Сред(Перенаправление, Разделитель + 1);
			Иначе
				Сервер = Перенаправление;
				Порт = Неопределено;
			КонецЕсли;
			
			Возврат HTTP(Метод, Схема, Сервер, Порт, АдресРесурса, ЗаголовкиЗапроса, ТипЗапроса, Запрос, Ответ, Таймаут);		
		Иначе
			Результат = Ложь;
			
			Если Найти(ЗаголовкиОтвета["content-type"], "application/json") Тогда
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку());
				
				ЗаписьJSON = Новый ЗаписьJSON;
				ЗаписьJSON.УстановитьСтроку();
				
				ЗаписатьJSON(ЗаписьJSON, ПрочитатьJSON(ЧтениеJSON, Истина));
				Ответ = ЗаписьJSON.Закрыть();
			Иначе
				Ответ = HTTPОтвет.ПолучитьТелоКакСтроку();
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",")
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1 = 1 Цикл
			Поз = Найти(Стр, Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр, Поз - 1));
			Стр = СокрЛ(Сред(Стр, Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1 = 1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр, Поз - 1));
			Стр = Сред(Стр, Поз + ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СформироватьОшибку(Код, Описание)
	
	мОшибка = Новый Структура("Код, Описание", Код, Описание);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиКонтактнуюИнформацию(Тип, Значение)

	ИмяФайлаVBS = ПолучитьИмяВременногоФайла("vbs");
	ИмяФайлаTXT = ПолучитьИмяВременногоФайла("txt");
	
	Скрипт = Новый ТекстовыйДокумент;
	Скрипт.УстановитьТекст(VBS(ИмяФайлаTXT, "Введіть пошту або телефон для відправки чека", ""));
	Скрипт.Записать(ИмяФайлаVBS, КодировкаТекста.UTF16);
	
	ЗапуститьПриложение("wscript """ + ИмяФайлаVBS + """", , Истина);
	
	Текст = Новый ЧтениеТекста(ИмяФайлаTXT);
	КонтактнаяИнформация = Текст.ПрочитатьСтроку();
	Текст.Закрыть();
	
	Почта = НРег(КонтактнаяИнформация);
	
	Телефон = "";
	Для Сч = 1 По СтрДлина(КонтактнаяИнформация) Цикл
		Символ = Сред(КонтактнаяИнформация, Сч, 1);
		Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда
			Телефон = Телефон + Символ;
		КонецЕсли;
	КонецЦикла;
	Телефон = "+380" + Прав(Телефон, 9);
		
	Если АдресЭлектроннойПочтыСоответствуетТребованиям(Почта) Тогда
		Тип = "email";
		Значение = Почта;
	ИначеЕсли СтрДлина(Телефон) = 13 Тогда
		Тип = "phone";
		Значение = Телефон;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВвестиКодRRN(КодRRN, НомерЧекаВозврата)
	
	Если ЗначениеЗаполнено(НомерЧекаВозврата) Тогда
		Ответ = Неопределено;
		
		Если Не ЗначениеЗаполнено(КодRRN) Тогда
			Если ВыполнитьФискальноеЗадание(Ответ, Новый Структура("task, fiscal_number", 23, НомерЧекаВозврата)) Тогда
				Для Каждого Оплата Из Ответ["info"]["printinfo"]["pays"] Цикл
					Если Оплата["type"] = 2 Тогда
						КодRRN = Оплата["rrn"];
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(КодRRN) Тогда
			Если HTTP("GET", "https", "kasa.vchasno.ua", , "/c/" + НомерЧекаВозврата + ".json", , , , Ответ) Тогда
				Для Каждого Оплата Из Ответ["data"]["pays"] Цикл
					Если Оплата["name"] = "Картка" Тогда
						КодRRN = Оплата["rrn"];
					КонецЕсли;
				КонецЦикла; 	
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	
	ИмяФайлаVBS = ПолучитьИмяВременногоФайла("vbs");
	ИмяФайлаTXT = ПолучитьИмяВременногоФайла("txt");
	
	Скрипт = Новый ТекстовыйДокумент;
	Скрипт.УстановитьТекст(VBS(ИмяФайлаTXT, "Введіть унікальний код транзакції RRN", КодRRN));
	Скрипт.Записать(ИмяФайлаVBS, КодировкаТекста.UTF16);
	
	ЗапуститьПриложение("wscript """ + ИмяФайлаVBS + """", , Истина);
	
	Текст = Новый ЧтениеТекста(ИмяФайлаTXT);
	КодRRN = Текст.ПрочитатьСтроку();
	Текст.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Функция VBS(filename, prompt, default)

	Скрипт = "
	|Set fs = CreateObject(""Scripting.FileSystemObject"")
    |Set a = fs.CreateTextFile(""%filename%"", True)
    |a.WriteLine(InputBox(""%prompt%"", ""Вчасно.Каса"", ""%default%""))
    |a.Close";
	
	Скрипт = СтрЗаменить(Скрипт, "%filename%", filename);
	Скрипт = СтрЗаменить(Скрипт, "%prompt%", prompt);
	Скрипт = СтрЗаменить(Скрипт, "%default%", default);
	
	Возврат Скрипт;
	
КонецФункции

&НаКлиенте
Функция HTA()	
	
	ИмяФайлаHTA = ПолучитьИмяВременногоФайла("hta");
	ИмяФайлаTXT = ПолучитьИмяВременногоФайла("txt");

	Скрипт = Новый ТекстовыйДокумент;
	Скрипт.УстановитьТекст(СтрЗаменить(ПолучитьТекстHTA(), "%filename%", ИмяФайлаTXT));
	Скрипт.Записать(ИмяФайлаHTA, КодировкаТекста.UTF8);
	
	ЗапуститьПриложение(ИмяФайлаHTA, , Истина);
	
	Текст = Новый ЧтениеТекста(ИмяФайлаTXT);
	Точность = Текст.ПрочитатьСтроку();
	Текст.Закрыть();
	
	Возврат Точность;
	
КонецФункции

&НаКлиенте
Функция АдресЭлектроннойПочтыСоответствуетТребованиям(Знач Адрес, РазрешитьЛокальныеАдреса = Ложь)
	
	Буквы = "abcdefghijklmnopqrstuvwxyz";
	Цифры = "0123456789";
	СпецСимволы = ".@_-:+";
	
	Если СтрЧислоВхождений(Адрес, "@") <> 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрЧислоВхождений(Адрес, ":") > 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Найти(Адрес, "..") > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Адрес = НРег(Адрес);
	
	Если Не СтрокаСодержитТолькоДопустимыеСимволы(Адрес, Буквы + Цифры + СпецСимволы) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Позиция = Найти(Адрес, "@");
	ЛокальноеИмя = Лев(Адрес, Позиция - 1);
	Домен = Сред(Адрес, Позиция + 1);
	
	Если ПустаяСтрока(ЛокальноеИмя) Или ПустаяСтрока(Домен) Или СтрДлина(ЛокальноеИмя) > 64 Или СтрДлина(Домен) > 255 Тогда		
		Возврат Ложь;
	КонецЕсли;
	
	Если ЕстьСимволыВНачалеВКонце(Домен, СпецСимволы) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Если Не РазрешитьЛокальныеАдреса И Найти(Домен, ".") = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Найти(Домен, "_") > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Найти(Домен, ":") > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Найти(Домен, "+") > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Зона = Домен;
	Позиция = Найти(Зона, ".");
	Пока Позиция > 0 Цикл
		Зона = Сред(Зона, Позиция + 1);
		Позиция = Найти(Зона, ".");
	КонецЦикла;
	
	Возврат РазрешитьЛокальныеАдреса Или СтрДлина(Зона) >= 2 И СтрокаСодержитТолькоДопустимыеСимволы(Зона, Буквы);
	
КонецФункции

&НаКлиенте
Функция СтрокаСодержитТолькоДопустимыеСимволы(Строка, ДопустимыеСимволы)
	
	МассивСимволов = Новый Массив;
	Для Позиция = 1 По СтрДлина(ДопустимыеСимволы) Цикл
		МассивСимволов.Добавить(Сред(ДопустимыеСимволы, Позиция, 1));
	КонецЦикла;
	
	Для Позиция = 1 По СтрДлина(Строка) Цикл
		Если МассивСимволов.Найти(Сред(Строка, Позиция, 1)) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ЕстьСимволыВНачалеВКонце(Строка, ПроверяемыеСимволы)
	
	Для Позиция = 1 По СтрДлина(ПроверяемыеСимволы) Цикл
		Символ = Сред(ПроверяемыеСимволы, Позиция, 1);
		СимволНайден = (Лев(Строка, 1) = Символ) Или (Прав(Строка, 1) = Символ);
		Если СимволНайден Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция Округлить(Число, Точность)

	Возврат Точность * Окр(Число / Точность);  		
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Расширение Из РасширенияКонфигурации.Получить(Новый Структура("Имя", "ВчасноКаса")) Цикл
		мВерсия = Расширение.Версия;
	КонецЦикла;
	мИсточник = Метаданные.Имя + Символы.НПП + "(" + Метаданные.Версия + ")" + Символы.НПП + "CELme" + Символы.НПП + "(" + мВерсия + ")";
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстHTA()

	Возврат ПолучитьОбщийМакет("ВчасноКаса_Макет").ПолучитьТекст();	
	
КонецФункции
