
&НаСервере
Процедура ПолучитьСообщениеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСообщение(Команда)
	ПолучитьСообщениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура НовыеСообщенияНаСервере()
	Telegram.ЗагрузитьСообщениеИзТелеграм();
КонецПроцедуры

&НаКлиенте
Процедура НовыеСообщения(Команда)
	НовыеСообщенияНаСервере();
КонецПроцедуры



&НаКлиенте
Процедура ОткрытьОбработкуИПередатьЗначение(Команда)
    // Формируем параметры для передачи
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Заведение", Заведение); // Значение для передачи
    ПараметрыФормы.Вставить("Дата", ТекущаяДата());
    // Открываем форму встроенной обработки
    ОткрытьФорму("Обработка.TEST.Форма",ПараметрыФормы);
КонецПроцедуры