
&Вместо("ПриНачалеРаботыСистемы")
Функция ВчасноКаса_ПриНачалеРаботыСистемы() Экспорт
	
	ПодключаемоеОборудованиеВчасноКасаВызовСервера.ОбновитьПоставляемыеДрайвера();
	
	ПродолжитьВызов();
	
КонецФункции

&Вместо("ПолучитьОбъектДрайвера")
Функция ВчасноКаса_ПолучитьОбъектДрайвера(ДанныеДрайвера, ТекстОшибки = Неопределено)
	
	Если ДанныеДрайвера.ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВчасноКасаФискальныйРегистратор") Тогда
		ОбъектДрайвера = Неопределено;
		
		Для Каждого ДрайверПО Из глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования Цикл
			Если ДрайверПО.Ключ = ДанныеДрайвера.ДрайверОборудования Тогда
				ОбъектДрайвера = ДрайверПО.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ОбъектДрайвера = Неопределено Тогда
			Попытка
				
				ОбъектДрайвера = ПолучитьФорму("ОбщаяФорма.ДрайверВчасноКасаФискальныйРегистратор");
				
			Исключение
				Инфо = ИнформацияОбОшибке();
				ТекстОшибки = Инфо.Описание;
				
				Сообщить(Инфо.Описание + Символы.ПС + Инфо.Причина.Описание);
			КонецПопытки;
			
			Если ОбъектДрайвера <> Неопределено Тогда
				глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования.Вставить(ДанныеДрайвера.ДрайверОборудования, ОбъектДрайвера);
				ОбъектДрайвера = глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования[ДанныеДрайвера.ДрайверОборудования];
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат ОбъектДрайвера;
	КонецЕсли;
	
	Возврат ПродолжитьВызов(ДанныеДрайвера, ТекстОшибки);
	
КонецФункции

