Функция СоздатьСвязьОбъектов(Родитель, Подчиненный) Экспорт 
	
	Док = Документы.ДобавитьСвязьОбъектов.СоздатьДокумент();
	Док.Дата        = ТекущаяДата();
	Док.Родитель    = Родитель; 
	Док.Задача = Подчиненный;
	Док.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Док.Ссылка;
	
КонецФункции         

Функция ЗаписатьРодителя(Задача, Родитель) Экспорт 
	
	Док = Документы.ДобавитьСвязьОбъектов.СоздатьДокумент();
	Док.Дата        = ТекущаяДата();
	Док.Родитель    = Родитель; 
	Док.Задача = Задача;
	Док.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Док.Ссылка;
	
КонецФункции

