#Если Не МобильноеПриложениеСервер Тогда

// Описание драйвера из фалйа info.xml
// Возвращаемое значение:
//   Структура
//     * ИмяМакета - Строка - Имя макета драйвера
//     * Идентификатор - Строка - Идентификатор ProgID без "Addin"
//     * Тип - Строка - Тип оборудования из файла info.xml
//     * Наименование - Строка - Наименование драйвера
//     * Версия - Строка - Версия драйвера
//     * ДатаВерсии - Дата - Дата создания файла драйвера
//     * Манифест - Массив из структур - Массив строк манифеста драйвера см. ПараметрыЭлементМанифеста() 
//     * Файлы - Соответствие - Список файлов драйвера
Функция ПараметрыДрайвера()

	Результат = Новый Структура();
	Результат.Вставить("ИмяМакета", "");        // Имя макета драйвера
	Результат.Вставить("Идентификатор", ""); 	// Идентификатор ProgID без "Addin"
	Результат.Вставить("Тип", "");				// Тип оборудования из файла info.xml
	Результат.Вставить("Наименование", "");     // Наименование драйвера
	Результат.Вставить("Версия", "");           // Версия драйвера
	Результат.Вставить("ДатаВерсии");           // Дата создания файла драйвера
	Результат.Вставить("Манифест", Новый Массив());     // Массив строк манифеста драйвера
	Результат.Вставить("Файлы", Новый Соответствие());  // Список файлов драйвера
	
	Возврат Результат;

КонецФункции

// Описание элемента драйвера из файла manifest.xml
// Возвращаемое значение:
//   Структура
//    * ОперационнаяСистема - Строка - Операционная система: "windows, linux, macos, android, ios"
//    * Технология - Строка - Тип драйвера: "plugin, native, com"
//    * Архитектура - Строка - Архитектура платформы: "i386, x86_64, arm, arm64, universal"
//    * Клиент - Строка - Брайзер для которого разрабатывалась компонента
//    * ВерсияКлиента - Строка - Версия браузера
//    * Объект - Строка - Имя объекта для создания в браузере
//    * ИмяФайла - Строка - Имя файла в архиве 
//    * Сборка - Строка - Тип целевого приложения: "developer, release"
//    * Язык - Строка - Язык разработки: "c++, java"
//    * ФайлСуществует - Булево - Файл драйвера существует
Функция ПараметрыЭлементМанифеста()

	Результат = Новый Структура();
	Результат.Вставить("ОперационнаяСистема", "");   // Операционная система: "windows, linux, macos, android, ios"
	Результат.Вставить("Технология", "");            // Тип драйвера: "plugin, native, com"
	Результат.Вставить("Архитектура", "");           // Архитектура платформы: "i386, x86_64, arm, arm64, universal"
	Результат.Вставить("Клиент", "");                // Брайзер для которого разрабатывалась компонента
	Результат.Вставить("ВерсияКлиента", "");         // Версия браузера
	Результат.Вставить("Объект", "");                // Имя объекта для создания в браузере
	Результат.Вставить("ИмяФайла", "");              // Имя файла в архиве 
	Результат.Вставить("Сборка", "");                // Тип целевого приложения: "developer, release"
	Результат.Вставить("Язык", "");                  // Язык разработки: "c++, java"
	Результат.Вставить("ФайлСуществует", Ложь);      // Файл драйвера существует
	
	Возврат Результат;

КонецФункции

// Описание элемента файла из архива драйверов
// Возвращаемое значение:
//   Структура
//    * Имя - Строка - Имя Файла драйвера
//    * Размер - Число - Размер файла драйвера
//    * Дата - Дата - Дата файла драйвера
//    * Версия - Строка - Версия файла драйвера, определяется из имени файла
Функция ПараметрыФайла()

	Результат = Новый Структура();
	Результат.Вставить("Имя");             // Имя Файла драйвера
	Результат.Вставить("Размер");          // Размер файла драйвера
	Результат.Вставить("Дата");            // Дата файла драйвера
	Результат.Вставить("Версия", "");      // Версия файла драйвера, определяется из имени файла

	Возврат Результат;

КонецФункции

// Возвращает информацию о драйвере из макета, читая файлы info.xml и manifes.xml
// Параметры:
//   Имя макета - Строка - Имя макета где содержится драйвер
// Возвращаемое значение:
//   Структура - см. ПараметрыДрайвера()
Функция ИнформацияДрайвераИзМакета(ИмяМакета) Экспорт

	ДвоичныеДанные   = ПолучитьОбщийМакет(ИмяМакета);
	НайденМанифест   = Ложь;
	ВременныйКаталог = ПолучитьИмяВременногоФайла("ExtComp");
	
	Результат           = ПараметрыДрайвера();
	Результат.ИмяМакета = ИмяМакета;
	
	Попытка
		Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
		ЧтениеАрхива = Новый ЧтениеZipФайла(Поток);
	Исключение
		ВызватьИсключение НСтр("ru = 'В файле отсутствует информация о компоненте.'");
	КонецПопытки;

	СоздатьКаталог(ВременныйКаталог);
	
	Для Каждого ЭлементАрхива Из ЧтениеАрхива.Элементы Цикл

		Если ЭлементАрхива.Зашифрован Тогда
			// Очищаем временные файлы и освобождаем память.
			УдалитьФайлы(ВременныйКаталог);
			ЧтениеАрхива.Закрыть();
			Поток.Закрыть();

			ВызватьИсключение НСтр("ru = 'ZIP-архив не должен быть зашифрован.'");
		КонецЕсли;

		Попытка
			
			// Поиск и разбор манифеста.
			Если НРег(ЭлементАрхива.ИсходноеПолноеИмя) = "manifest.xml" Тогда

				Результат.ДатаВерсии = ЭлементАрхива.ВремяИзменения;

				ЧтениеАрхива.Извлечь(ЭлементАрхива, ВременныйКаталог);
				ФайлManifestXML = ВременныйКаталог + ПолучитьРазделительПути() + ЭлементАрхива.ПолноеИмя;
				ПрочитатьManifestXML(ФайлManifestXML, Результат.Манифест);

				НайденМанифест = Истина;

			ИначеЕсли НРег(ЭлементАрхива.ИсходноеПолноеИмя) = "info.xml" Тогда

				ЧтениеАрхива.Извлечь(ЭлементАрхива, ВременныйКаталог);
				ФайлInfoXML = ВременныйКаталог + ПолучитьРазделительПути() + ЭлементАрхива.ПолноеИмя;
				ПрочитатьInfoXML(ФайлInfoXML, Результат);

			ИначеЕсли НРег(ЭлементАрхива.ИсходноеПолноеИмя) = "IOS_MANIFEST_EXTENSIONS.XML" Тогда
			ИначеЕсли НРег(ЭлементАрхива.ИсходноеПолноеИмя) = "ANDROID_MANIFEST_EXTENSIONS.XML" Тогда
			ИначеЕсли НРег(ЭлементАрхива.ИсходноеПолноеИмя) = "WINDOWS_RT_MANIFEST_EXTENSIONS.XML" Тогда
			Иначе
				ФайлДрайвера = ПараметрыФайла();
				ФайлДрайвера.Дата   = ЭлементАрхива.ВремяИзменения;
				ФайлДрайвера.Имя    = ЭлементАрхива.ИсходноеПолноеИмя;
				ФайлДрайвера.Размер = ЭлементАрхива.РазмерНесжатого;
				Результат.Файлы.Вставить(ВРег(ЭлементАрхива.ИсходноеПолноеИмя), ФайлДрайвера);
			КонецЕсли;

		Исключение
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Ошибка при разборе файла %1
				|%2'"), ЭлементАрхива.ИсходноеПолноеИмя, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;

	// Очищаем временные файлы и освобождаем память.
	УдалитьФайлы(ВременныйКаталог);
	ЧтениеАрхива.Закрыть();
	Поток.Закрыть();

	// Контроль соответствия компоненты.
	Если Не НайденМанифест Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Макет %1. В архиве компоненты отсутствует обязательный файл MANIFEST.XML.'"), ИмяМакета);
	КонецЕсли;

	// проверить соответствие файлов и манифеста
	Для Каждого Элемент Из Результат.Манифест Цикл
		ИмяФайла = Элемент.ИмяФайла;
		Если Результат.Файлы.Получить(ВРег(ИмяФайла)) <> Неопределено Тогда
			Элемент.ФайлСуществует = Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Прочитать файл manifest.xml и заполнить из него информацию о драйвере
// Параметры:
//  ИмяФайлаManifestXML - Строка - полный путь к имени файла манифеста
//  Манифест - массив из структур - см. ПараметрыЭлементМанифеста
Процедура ПрочитатьManifestXML(ИмяФайлаManifestXML, Манифест)

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяФайлаManifestXML);

	ЧтениеXML.ПерейтиКСодержимому();
	Если ЧтениеXML.Имя = "bundle" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
		Пока ЧтениеXML.Прочитать() Цикл
			Если ЧтениеXML.Имя = "component" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда

				Элемент = ПараметрыЭлементМанифеста();
				
				Элемент.ОперационнаяСистема  = НРег(ЧтениеXML.ЗначениеАтрибута("os"));
				Элемент.Технология           = НРег(ЧтениеXML.ЗначениеАтрибута("type"));
				Элемент.Архитектура          = НРег(ЧтениеXML.ЗначениеАтрибута("arch"));
				Элемент.Клиент               = НРег(ЧтениеXML.ЗначениеАтрибута("client"));
				Элемент.ВерсияКлиента        = НРег(ЧтениеXML.ЗначениеАтрибута("clientVersion"));
				Элемент.Объект               = НРег(ЧтениеXML.ЗначениеАтрибута("object"));
				Элемент.ИмяФайла             = НРег(ЧтениеXML.ЗначениеАтрибута("path"));
				Элемент.Сборка               = НРег(ЧтениеXML.ЗначениеАтрибута("buildType"));
				Элемент.Язык                 = НРег(ЧтениеXML.ЗначениеАтрибута("codeType"));
				
				Манифест.Добавить(Элемент);
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ЧтениеXML.Закрыть();

КонецПроцедуры

// Прочитать файл info.xml и заполнить из него информацию о драйвере
// Параметры:
//  ИмяФайлаInfoXML - Строка - полный путь к имени файла info.xml
//  Драйвер - структур - см. ПараметрыДрайвера()
Процедура ПрочитатьInfoXML(ИмяФайлаInfoXML,  Драйвер)

	// Пытаемся разобрать по формату БПО.
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяФайлаInfoXML);

	ЧтениеXML.ПерейтиКСодержимому();
	Если ЧтениеXML.Имя = "drivers" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
		Пока ЧтениеXML.Прочитать() Цикл
			Если ЧтениеXML.Имя = "component" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда

				Идентификатор = ЧтениеXML.ЗначениеАтрибута("progid");
				
				Драйвер.Идентификатор = Сред(Идентификатор, СтрНайти(Идентификатор, ".") + 1);
				Драйвер.Тип           = ЧтениеXML.ЗначениеАтрибута("type");
				Драйвер.Наименование  = ЧтениеXML.ЗначениеАтрибута("name");
				Драйвер.Версия        = ЧтениеXML.ЗначениеАтрибута("version");

			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ЧтениеXML.Закрыть();

КонецПроцедуры

// Возвращает таблицу значений для формирования описаний драйверов
// Возвращаемое значение:
//   Таблица значений:
//    * ИмяМакета - Строка - Имя макета драйвера
//    * Идентификатор - Строка - Идентификатор ProgID без "Addin"
//    * Тип - Строка - Тип оборудования из файла info.xml
//    * Наименование - Строка - Наименование драйвера
//    * Версия - Строка - Версия драйвера
//    * ДатаВерсии - Дата - Дата создания файла драйвера
//    * ОперационнаяСистема - Строка - Операционная система: "windows, linux, macos, android, ios"
//    * Технология - Строка - Тип драйвера: "plugin, native, com"
//    * Архитектура - Строка - Архитектура платформы: "i386, x86_64, arm, arm64, universal"
//    * Клиент - Строка - Браузер для которого разрабатывалась компонента
//    * ВерсияКлиента - Строка - Версия браузера
//    * Объект - Строка - Имя объекта для создания в браузере
//    * ИмяФайла - Строка - Имя файла в архиве 
//    * ТипПриложения - Строка - Тип целевого приложения: "developer, release"
//    * Язык - Строка - Язык разработки: "c++, java"
//    * ФайлСуществует - Булево - Файл драйвера существует
Функция НоваяТаблицаОписанийДрайверов()
	Результат = Новый ТаблицаЗначений();
	КвалификаторСтроки = Новый КвалификаторыСтроки(50);
	Результат.Колонки.Добавить("ИмяДрайвера", Новый ОписаниеТипов("Строка",,КвалификаторСтроки));           // Имя макета драйвера
	Результат.Колонки.Добавить("ИмяМакета", Новый ОписаниеТипов("Строка",,КвалификаторСтроки));           // Имя макета драйвера
	Результат.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));       // Идентификатор ProgID без "Addin"
	Результат.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка"));                 // Тип оборудования из файла info.xml
	Результат.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));        // Наименование драйвера
	Результат.Колонки.Добавить("Версия", Новый ОписаниеТипов("Строка"));              // Версия драйвера
	Результат.Колонки.Добавить("ДатаВерсии", Новый ОписаниеТипов("Дата"));            // Дата создания файла драйвера
	Результат.Колонки.Добавить("ОперационнаяСистема", Новый ОписаниеТипов("Строка")); // Операционная система: "windows, linux, macos, android, ios"
	Результат.Колонки.Добавить("Технология", Новый ОписаниеТипов("Строка"));          // Тип драйвера: "plugin, native, com"
	Результат.Колонки.Добавить("Архитектура", Новый ОписаниеТипов("Строка"));         // Архитектура платформы: "i386, x86_64, arm, arm64, universal"
	Результат.Колонки.Добавить("Клиент", Новый ОписаниеТипов("Строка"));              // Браузер для которого разрабатывалась компонента
	Результат.Колонки.Добавить("ВерсияКлиента", Новый ОписаниеТипов("Строка"));       // Версия браузера
	Результат.Колонки.Добавить("Объект", Новый ОписаниеТипов("Строка"));              // Имя объекта для создания в браузере
	Результат.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка"));            // Имя файла в архиве 
	Результат.Колонки.Добавить("ТипПриложения", Новый ОписаниеТипов("Строка"));       // Тип целевого приложения: "developer, release"
	Результат.Колонки.Добавить("Язык", Новый ОписаниеТипов("Строка"));                // Язык разработки: "c++, java"
	Результат.Колонки.Добавить("ФайлСуществует", Новый ОписаниеТипов("Булево"));      // Файл драйвера существует
	Результат.Колонки.Добавить("МакетСуществуетДрайверСнятСПоддержки", Новый ОписаниеТипов("Булево"));         // Файл макета существует, а драйвер снят с подержки
	Результат.Колонки.Добавить("МакетСуществетДрайвераНет", Новый ОписаниеТипов("Булево"));  // Файл макет существует
	
	Возврат Результат;
КонецФункции 

// Возвращает таблицу значений с описаниями драйверов содеражищихся в макетах конфигурации
// Возвращаемое значение:
//   Таблица значений - см. НоваяТаблицаОписанийДрайверов()
Функция ТаблицаОписанийДрайверовПоМакетам()

	СписокВсехМакетов           = Неопределено;
	СписокНеиспользуемыхМакетов = Неопределено;
	
	ПодготовитьСпискиМакетов(СписокВсехМакетов, СписокНеиспользуемыхМакетов);
	
	// результатирующая таблица
	ТаблицаОписанийДрайверов  = НоваяТаблицаОписанийДрайверов();
	
	// выбрать все драйвера из справочника
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДрайверыОборудования.Ссылка КАК Ссылка,
		|	ДрайверыОборудования.Наименование КАК Наименование,
		|	ДрайверыОборудования.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
		|	ДрайверыОборудования.Предопределенный КАК Предопределенный,
		|	ДрайверыОборудования.Представление КАК Представление,
		|	ДрайверыОборудования.ИмяМакетаДрайвера КАК ИмяМакетаДрайвера,
		|	ДрайверыОборудования.СнятСПоддержки КАК СнятСПоддержки
		|ИЗ
		|	Справочник.ДрайверыОборудования КАК ДрайверыОборудования
		|ГДЕ
		|	ДрайверыОборудования.Предопределенный
		|	И ДрайверыОборудования.СпособПодключения = ЗНАЧЕНИЕ(Перечисление.СпособПодключенияДрайвера.ИзМакета)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// имя макета может быть в поле "ИмяМакетаДрайвера", если оно пустое то имя макета 
		// соответствует значению "ИмяПредопределенныхДанных"
		ИмяДрайвера = Выборка.ИмяПредопределенныхДанных;
		ИмяМакета = Выборка.ИмяМакетаДрайвера;
		Если ПустаяСтрока(ИмяМакета) Тогда
			ИмяМакета = ИмяДрайвера;
		КонецЕсли;
		
		// если драйвер снят с поддержки, а макет существует, то пометить его особым флагом
		Если Выборка.СнятСПоддержки Тогда
			
			МассивМакетов = СписокВсехМакетов.Получить(ВРег(ИмяМакета));
			Если МассивМакетов = Неопределено Тогда
				СтрокаТаблицы = ТаблицаОписанийДрайверов.Добавить();
				СтрокаТаблицы.ИмяДрайвера  = ИмяДрайвера;
				СтрокаТаблицы.ИмяМакета    = ИмяМакета;
				СтрокаТаблицы.Наименование = НСтр("ru = 'Драйвер снят с поддержки, макет удален.'");
				Продолжить;
			КонецЕсли;
				
			Для Каждого Макет Из МассивМакетов Цикл
				СтрокаТаблицы = ТаблицаОписанийДрайверов.Добавить();
				СтрокаТаблицы.ИмяДрайвера  = ИмяДрайвера;
				СтрокаТаблицы.ИмяМакета    = Макет.Имя;
				СтрокаТаблицы.Наименование = НСтр("ru = 'Драйвер снят с поддержки.'");
				СтрокаТаблицы.МакетСуществуетДрайверСнятСПоддержки = Истина;
				// удалить макет из списка неиспользуемых
				СписокНеиспользуемыхМакетов.Удалить(Макет.Имя);
			КонецЦикла;
			Продолжить;
		КонецЕсли;
		
		МассивМакетов = СписокВсехМакетов.Получить(ВРег(ИмяМакета));
		Для Каждого Макет Из МассивМакетов Цикл
			Если Макет = Неопределено Тогда
				СтрокаТаблицы = ТаблицаОписанийДрайверов.Добавить();
				СтрокаТаблицы.ИмяДрайвера = ИмяДрайвера;
				СтрокаТаблицы.ИмяМакета = ИмяМакета;
				СтрокаТаблицы.Наименование = НСтр("ru = 'Макет не найден.'");
				Продолжить;
			КонецЕсли;

			Попытка
				// получить информацию о макете
				ИнформацияДрайвера = ИнформацияДрайвераИзМакета(Макет.Имя);
			Исключение
				ТекстОшибки   = СтрШаблон(НСтр("ru = 'Ошибка. %1'"), ОписаниеОшибки());
				СтрокаТаблицы = ТаблицаОписанийДрайверов.Добавить();
				СтрокаТаблицы.ИмяДрайвера  = ИмяДрайвера;
				СтрокаТаблицы.ИмяМакета    = Макет.Имя;
				СтрокаТаблицы.Наименование = ТекстОшибки;
				СписокНеиспользуемыхМакетов.Удалить(Макет.Имя);
				Продолжить;
			КонецПопытки;
		
			Для Каждого ЭлементМанифеста Из ИнформацияДрайвера.Манифест Цикл
				// перебрать манифест из макета
				СтрокаТаблицы = ТаблицаОписанийДрайверов.Добавить();
				СтрокаТаблицы.ИмяДрайвера = ИмяДрайвера;
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ИнформацияДрайвера);
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ЭлементМанифеста);
			КонецЦикла;
			ИнформацияДрайвера = Неопределено;
			// макет распарсен, удалить его из списка
			СписокНеиспользуемыхМакетов.Удалить(Макет.Имя);
		КонецЦикла;
		
	КонецЦикла;
	
	// добавить в результатирующую таблицу макеты существующие в конфигурации, но не используемые в драйверах
	Для Каждого Макет Из СписокНеиспользуемыхМакетов Цикл
		СтрокаТаблицы = ТаблицаОписанийДрайверов.Добавить();
		СтрокаТаблицы.ИмяМакета = Макет.Значение.Имя;
		СтрокаТаблицы.Наименование = НСтр("ru = 'Не используемый макет'");
		СтрокаТаблицы.МакетСуществетДрайвераНет = Истина;
	КонецЦикла;
	
	// в списке макетов остались макеты которых нет в справочнике ДрайверыОборудования

	Возврат ТаблицаОписанийДрайверов
	
КонецФункции

Процедура ПодготовитьСпискиМакетов(Макеты, НеиспользуемыеМакеты)
	
	СписокИсключений = СписокИсключений();
	
	// запомнить макеты в конфигурации
	ДлинаСуфикса         = СтрДлина("_ru");
	НеиспользуемыеМакеты = Новый Соответствие();
	Макеты               = Новый Соответствие();
	
	Для каждого ОбщийМакет Из Метаданные.ОбщиеМакеты Цикл
		Если ОбщийМакет.ТипМакета = Метаданные.СвойстваОбъектов.ТипМакета.ВнешняяКомпонента 
			или ОбщийМакет.ТипМакета = Метаданные.СвойстваОбъектов.ТипМакета.ДвоичныеДанные Тогда
			
			// обрезать суфикс в имени макета
			ИмяМакета    = ВРег(ОбщийМакет.Имя);
			Суффикс      = Сред(ИмяМакета, СтрНайти(ИмяМакета, "_", НаправлениеПоиска.СКонца));
			Если СтрДлина(Суффикс) = ДлинаСуфикса Тогда
				ИмяМакета = Лев(ИмяМакета, СтрДлина(ИмяМакета) - ДлинаСуфикса);
			КонецЕсли;
			
			// исключить ряд макетов
			Если СписокИсключений.Получить(ИмяМакета) = Неопределено Тогда
				
				МассивМакетов = Макеты.Получить(ИмяМакета);
				Если МассивМакетов = Неопределено Тогда
					МассивМакетов = Новый Массив();
				КонецЕсли;
				МассивМакетов.Добавить(ОбщийМакет);
				Макеты.Вставить(ИмяМакета, МассивМакетов);
				
				НеиспользуемыеМакеты.Вставить(ОбщийМакет.Имя, ОбщийМакет);
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция СписокИсключений()
	
	// список исключений из просмотра
	СписокИсключений = Новый Соответствие();
	СписокИсключений.Вставить(ВРег("КомпонентаСклонение"),"");
	СписокИсключений.Вставить(ВРег("КомпонентаСжатияДанных"),"");
	СписокИсключений.Вставить(ВРег("КомпонентаПечатиШтрихкодов"),"");
	СписокИсключений.Вставить(ВРег("КомпонентаПечатиНаСервере"),"");
	СписокИсключений.Вставить(ВРег("КомпонентаTWAIN"),"");
	СписокИсключений.Вставить(ВРег("КомпонентаHTTPЗапросов"),"");
	СписокИсключений.Вставить(ВРег("КомпонентаПечатиQRКода"),"");
	СписокИсключений.Вставить(ВРег("КомпонентаПоискаСтрок"),"");
	СписокИсключений.Вставить(ВРег("КомпонентаИнтеграцииНСПК"),"");
	Возврат СписокИсключений;

КонецФункции

Функция СформироватьДрайвераНаСервере() Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент();
	Макет             = ПолучитьМакет("Макет");
	ОбластьШапка      = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗапись     = Макет.ПолучитьОбласть("Запись");
	
	ТаблицаДрайверов  = ТаблицаОписанийДрайверовПоМакетам();
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.ФиксацияСверху = 1;
	ТабличныйДокумент.ФиксацияСлева  = 2;
	Для Каждого Строка Из ТаблицаДрайверов Цикл
		ОбластьЗапись.Параметры.Заполнить(Строка);
		ТабличныйДокумент.Вывести(ОбластьЗапись);
	КонецЦикла;

	Возврат ТабличныйДокумент;
КонецФункции


#КонецЕсли

