Функция СтруктураИзТЧДокумента(РеквизитыТабличнойЧасти, ТекущиеДанные) Экспорт

	СтруктураСтроки = Новый Структура;
   
    // Перебираем все реквизиты табличной части
    Для Каждого Реквизит Из РеквизитыТабличнойЧасти Цикл
        ИмяРеквизита = Реквизит.Имя;
        Если ТекущиеДанные.Свойство(ИмяРеквизита) Тогда
            СтруктураСтроки.Вставить(ИмяРеквизита, ТекущиеДанные[ИмяРеквизита]);
        КонецЕсли;
    КонецЦикла;
    
    Возврат СтруктураСтроки;
	

КонецФункции // СтруктураИзТЧДокумента()

Функция  ПолучениеПользователя() Экспорт 
	Если Строка(ПользователиИнформационнойБазы.ТекущийПользователь()) = "Заболотного" Тогда
		ТекущийПользователь=Перечисления.Заведение.Заболотного;	
	ИначеЕсли Строка(ПользователиИнформационнойБазы.ТекущийПользователь()) = "Паустовского" Тогда
		ТекущийПользователь=Перечисления.Заведение.Паустовского;
	ИначеЕсли Строка(ПользователиИнформационнойБазы.ТекущийПользователь()) = "Торговая" Тогда
		ТекущийПользователь=Перечисления.Заведение.Торговая;
	ИначеЕсли Строка(ПользователиИнформационнойБазы.ТекущийПользователь()) = "Дерибасовская" Тогда
		ТекущийПользователь=Перечисления.Заведение.Дерибасовская;
	ИначеЕсли Строка(ПользователиИнформационнойБазы.ТекущийПользователь()) = "Филатово" Тогда
		ТекущийПользователь=Перечисления.Заведение.Филатово;
	ИначеЕсли Строка(ПользователиИнформационнойБазы.ТекущийПользователь()) = "Люстдорф" Тогда
		ТекущийПользователь=Перечисления.Заведение.Люстдорф;
	ИначеЕсли Строка(ПользователиИнформационнойБазы.ТекущийПользователь()) = "Таирово" Тогда
		ТекущийПользователь=Перечисления.Заведение.Таирово;
	ИначеЕсли Строка(ПользователиИнформационнойБазы.ТекущийПользователь()) = "Черноморск" Тогда
		ТекущийПользователь=Перечисления.Заведение.Черноморск;

	ИначеЕсли Строка(ПользователиИнформационнойБазы.ТекущийПользователь()) = "Администратор" Тогда
		ТекущийПользователь=Перечисления.Заведение.Администратор;
	Иначе
		ТекущийПользователь=Перечисления.Заведение.ПицерияЗаболотного;
	
	КонецЕсли;	
	
	Возврат ТекущийПользователь;
КонецФункции

Функция  ПолучениеИДПользователя() Экспорт 
	Если Строка(ПользователиИнформационнойБазы.ТекущийПользователь()) = "Заболотного" Тогда
		ИД_Пользователя = "-620546437";	
	ИначеЕсли Строка(ПользователиИнформационнойБазы.ТекущийПользователь()) = "Паустовского" Тогда
		ИД_Пользователя = "-818379912";
	ИначеЕсли Строка(ПользователиИнформационнойБазы.ТекущийПользователь()) = "Торговая" Тогда
		ИД_Пользователя = "-4268725225";
	ИначеЕсли Строка(ПользователиИнформационнойБазы.ТекущийПользователь()) = "Дерибасовская" Тогда
		ИД_Пользователя = "-829075017";
	ИначеЕсли Строка(ПользователиИнформационнойБазы.ТекущийПользователь()) = "Филатово" Тогда
		ИД_Пользователя = "-880789986";
	ИначеЕсли Строка(ПользователиИнформационнойБазы.ТекущийПользователь()) = "Люстдорф" Тогда
		ИД_Пользователя = "-4596224998";
	ИначеЕсли Строка(ПользователиИнформационнойБазы.ТекущийПользователь()) = "Таирово" Тогда
		ИД_Пользователя = "-781875574";
	ИначеЕсли Строка(ПользователиИнформационнойБазы.ТекущийПользователь()) = "Черноморск" Тогда
		ИД_Пользователя = "-4792855874";

	ИначеЕсли Строка(ПользователиИнформационнойБазы.ТекущийПользователь()) = "Администратор" Тогда
		ИД_Пользователя = "-4792855874";
	Иначе
		ИД_Пользователя = "-620546437";	
	КонецЕсли;	
	
	Возврат ИД_Пользователя;
КонецФункции

Функция ФормированияПутьКФайлу(Путь,Дата, ВладелецДокумента) Экспорт 
	ПолныйПутьКФайлу = Путь + Строка(ВладелецДокумента) + " Отчет за "+Формат(Дата,"ДФ=dd.MM.yy")+".pdf";
	Возврат ПолныйПутьКФайлу; 
КонецФункции

Функция ДниДляОтчетов(ДатаОтчета) Экспорт
	Если ДеньНедели(ДатаОтчета)=5 ИЛИ ДеньНедели(ДатаОтчета)=7  Тогда		
		Ответ = Истина;
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

Функция ПользовательПоСеансу() Экспорт 

	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Сеанс = НомерСоединенияИнформационнойБазы();	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СеансыПользователей.Сеанс КАК Сеанс,
		|	СеансыПользователей.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.СеансыПользователей КАК СеансыПользователей
		|ГДЕ
		|	СеансыПользователей.Сеанс = &Сеанс";
	
	Запрос.УстановитьПараметр("Сеанс", Сеанс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Пользователь;
	

КонецФункции // ПользовательПоСеансу()

Функция ПолучитьТекстМакета() Экспорт 
    Макет = ПолучитьОбщийМакет("Chat");
    Возврат Макет.ПолучитьТекст();
КонецФункции


Функция ПолучениеПользователяПоСеансу() Экспорт 
	
	НомерСеанса = НомерСоединенияИнформационнойБазы();		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктивныеСеансы.Сеанс КАК Сеанс,
		|	АктивныеСеансы.Пользователь КАК Пользователь
		|ИЗ
		|	Справочник.АктивныеСеансы КАК АктивныеСеансы
		|ГДЕ
		|	АктивныеСеансы.Сеанс = &Сеанс
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сеанс УБЫВ";
	
	Запрос.УстановитьПараметр("Сеанс", НомерСеанса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();		
	
	Возврат Выборка.Пользователь;
	
КонецФункции

Функция ПолучитьТекущегоПользователя() Экспорт  
	
	Возврат Константы.ТестовыйПользователь.Получить();	
	
КонецФункции

Функция ОсновнойСклад(ТипСклада) Экспорт 
	
	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(ТипСклада, "ПеречислениеСсылка.ТипСклада") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
    Возврат ?(ТипСклада = Перечисления.ТипСклада.ОПТ, Справочники.Склады.Основной_ОПТ, Справочники.Склады.Основной_Роз);   
	
КонецФункции

