Функция ПолучитьЦенуНоменлатуры(Номенклатура) Экспорт
	Цена = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(, Номенклатура = &Номенклатура) КАК ЦеныСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий(); 	
	
	Если Выборка.Цена <> Неопределено Тогда
		Цена = Выборка.Цена;
	КонецЕсли;
	
	Возврат Цена;

КонецФункции // ПолучитьЦенуНоменлатуры()        

Процедура ТестированиеГита()
	Сообщить("Заугрузка в гит прошла успешно!");	
КонецПроцедуры



