Функция АктуальныйБаланс(Заведение) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БалансОстатки.Заведение КАК Заведение,
		|	БалансОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.Баланс.Остатки КАК БалансОстатки
		|ГДЕ
		|	БалансОстатки.Заведение = &Заведение";
	
	Запрос.УстановитьПараметр("Заведение", Заведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.СуммаОстаток;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецФункции

