
Функция newTaskcreateTask(Запрос)
	Ответ = Новый HTTPСервисОтвет(200); 
	
	ТекстПараметровЗапроса ="";
	task = Запрос.ПараметрыЗапроса.Получить("task");
	id_employee = Запрос.ПараметрыЗапроса.Получить("id_employee");
	
	//ТекстОтвета = item_id;
	Если ЗначениеЗаполнено(task)=1 Тогда
		//создание задачи	
		Задача = Документы.ПланРабот.СозданиеДокументаПланаРабот(ТекущаяДата(),,СокрЛП(task),Справочники.Отделы.СотрудникПоИд(Число(id_employee)),Перечисления.СтатусВыполнения.Создано,
		,,,,,);
	КонецЕсли;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "text/plain; charset=utf-8");
	ТекЗадача = Задача.ПолучитьОбъект();
	Документы.СменаСтатуса.СменаСтатуса(,,ТекЗадача.Ссылка,Перечисления.СтатусВыполнения.Создано,);
	
	
	Ответ.Заголовки = Заголовки;
	Ответ.УстановитьТелоИзСтроки("Задача " + Строка(task) + " успешно добавлена! Номер документа " + Строка(ТекЗадача.Номер) );
	Возврат Ответ;


КонецФункции

Функция getTasksgetTasks(Запрос)
	Ответ = Новый HTTPСервисОтвет(200); 
	
	ТекстОтвета="";
	
	ТекстПараметровЗапроса ="";
	id_employee = Запрос.ПараметрыЗапроса.Получить("id_employee");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатаПланированияЗдачиСрезПоследних.ДатаПланирования КАК ДатаПланирования,
		|	ДатаПланированияЗдачиСрезПоследних.СсылкаНаЗадачу.ОписаниеЗадачи КАК Задача,
		|	ДатаПланированияЗдачиСрезПоследних.СсылкаНаЗадачу.Номер КАК Номер,
		|	ДатаПланированияЗдачиСрезПоследних.СсылкаНаЗадачу.Ответственный КАК СсылкаНаЗадачуОтветственный
		|ИЗ
		|	РегистрСведений.ДатаПланированияЗдачи.СрезПоследних КАК ДатаПланированияЗдачиСрезПоследних
		|ГДЕ
		|	ДатаПланированияЗдачиСрезПоследних.ДатаПланирования = &ДатаПланирования
		|	И ДатаПланированияЗдачиСрезПоследних.СсылкаНаЗадачу.Ответственный = &Ответственный";
	
	Запрос.УстановитьПараметр("ДатаПланирования", ТекущаяДата());
	Запрос.УстановитьПараметр("Ответственный", Справочники.Отделы.СотрудникПоИд(Число(id_employee)));

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекстОтвета = ТекстОтвета + Строка(Выборка.Номер) + ") " + Выборка.Задача + " - " + Строка(Выборка.ДатаПланирования) + Символы.ПС;
		
	КонецЦикла;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "text/plain; charset=utf-8");
	Ответ.Заголовки = Заголовки;
	Ответ.УстановитьТелоИзСтроки(ТекстОтвета);

	
	Возврат Ответ;
КонецФункции
	