
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
    Если Параметры.Свойство("АвтоТест") Тогда
        Возврат;
    КонецЕсли;
	
	СхемаКомпоновкиДанных = Справочники._ДемоЭтикеткиИЦенники.ПолучитьМакет("ПоляШаблонаЭтикетки");
	АдресХранилищаСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьМакет(Команда)
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("РедактироватьМакетЗавершение", ЭтотОбъект);
	ОборудованиеПринтерыЭтикетокКлиент.НачатьРедактированиеМакета(ОповещениеПриЗавершении, Объект.XMLОписаниеМакета, АдресХранилищаСКД);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПримера(Команда)
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		ТекстСообщения = НСтр("ru='Не выбрана номенклатура для печати этикетки.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	МассивЭтикеток = Новый Массив;
	НоваяЭтикетка = Новый Структура;
	НоваяЭтикетка.Вставить("Количество", 1);
	
	ДанныеДляПечати = ПолучитьДанныеДляПечати();
	НоваяЭтикетка.Вставить("Поля", ДанныеДляПечати);
	МассивЭтикеток.Добавить(НоваяЭтикетка);
	
	ПараметрыОперации = ОборудованиеПринтерыЭтикетокКлиент.ПараметрыОперацииПечатиЭтикеток(Объект.XMLОписаниеМакета, МассивЭтикеток);
	
	ОписаниеОповещенияПриЗавершенииПечати = Новый ОписаниеОповещения("ПечатьПримераЗавершение", ЭтотОбъект);
	ОборудованиеПринтерыЭтикетокКлиент.НачатьПечатьЭтикеток(ОписаниеОповещенияПриЗавершенииПечати, УникальныйИдентификатор, Неопределено, ПараметрыОперации);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьРезультатВыполненияЗапроса(СКД)
	
	МассивНоменклатуры = Новый Массив;
	МассивНоменклатуры.Добавить(Номенклатура);
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
    Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
	Компоновщик.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	
	Настройки = Компоновщик.Настройки;
	Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МассивНоменклатуры"));
	Параметр.Значение = МассивНоменклатуры;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ПКД = Новый ПроцессорКомпоновкиДанных;
    ПКД.Инициализировать(КомпоновщикМакета.Выполнить(СКД, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")));
	
	ТЗ = Новый ТаблицаЗначений;
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ПроцессорВывода.УстановитьОбъект(ТЗ);
    ПроцессорВывода.Вывести(ПКД);

    Возврат ТЗ;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеДляПечати()
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресХранилищаСКД);
	РезультатВыполненияЗапроса = ПолучитьРезультатВыполненияЗапроса(СхемаКомпоновкиДанных);
	Поля = Новый Массив;
	
	Если РезультатВыполненияЗапроса.Количество()>0 Тогда
		
		Источник = РезультатВыполненияЗапроса[0];
		
		Для Каждого ТекПоле Из Объект.Поля Цикл
			
			Если ТекПоле.ТипЗаполнения = "Parameter" Тогда
				
				НовоеПоле = Новый Структура;
				НовоеПоле.Вставить("ИмяПоля", ТекПоле.Наименование);
				
				Попытка
					Значение = Вычислить("Источник." + ТекПоле.Значение);
				Исключение
					Значение = "";
				КонецПопытки;
				
				Если ТипЗнч(Значение) = Тип("ХранилищеЗначения") Тогда
					
					Значение = Значение.Получить();
					
					Если ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
						Значение = Base64Строка(Значение);
					Иначе
						Значение = Строка(Значение);
					КонецЕсли;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Значение) Тогда
					НовоеПоле.Вставить("Значение", ?(ЗначениеЗаполнено(ТекПоле.Формат), Формат(Значение, ТекПоле.Формат), Значение));
				Иначе
					
					Если ЗначениеЗаполнено(ТекПоле.ЗначениеПоУмолчанию) Тогда
						НовоеПоле.Вставить("Значение", ?(ЗначениеЗаполнено(ТекПоле.Формат), Формат(ТекПоле.ЗначениеПоУмолчанию, ТекПоле.Формат), ТекПоле.ЗначениеПоУмолчанию));
					Иначе
						НовоеПоле.Вставить("Значение", ?(ЗначениеЗаполнено(ТекПоле.Формат), Формат("", ТекПоле.Формат), ""));
					КонецЕсли;
					
				КонецЕсли;
				
				Поля.Добавить(НовоеПоле);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Поля;
	
КонецФункции

&НаКлиенте
Процедура РедактироватьМакетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		
		Модифицированность = Истина;
		Объект.XMLОписаниеМакета = ДополнительныеПараметры.XMLОписаниеМакета;
		Объект.Поля.Очистить();
		
		Для Каждого ТекПоле Из ДополнительныеПараметры.Поля Цикл
			
			НовоеПоле = Объект.Поля.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеПоле, ТекПоле);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПримераЗавершение(РезультатПечати, ДополнительныеПараметры) Экспорт
	
	Если РезультатПечати.Результат Тогда
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(НСтр("ru='Печать завершена.'"));
	Иначе
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(РезультатПечати.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти