&НаСервере
Функция СформироватьДрайвераНаСервере()
	
	Драйвера = РеквизитФормыВЗначение("Объект");
	Возврат Драйвера.СформироватьДрайвераНаСервере();
	
КонецФункции

&НаКлиенте
Процедура ВывестиДрайвера() Экспорт
	
	Таблица = СформироватьДрайвераНаСервере();

	Элементы.Таблица.Видимость = Истина;
	Элементы.Состояние.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Таблица.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ВывестиДрайвера",0.1,Истина);
	
КонецПроцедуры
