
&НаСервере
Процедура ОткрытьОтчетНаСервере()
	// Вставити вміст обробника.
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчет(Команда)
	СсылкаНаДокумент = ПоискОтчета(); 	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ",СсылкаНаДокумент);
	Если СсылкаНаДокумент.Пустая() Тогда
		ОткрытьФорму("Документ.ДневнойОтчет.ФормаОбъекта",ПараметрыФормы);		
	Иначе
		ОткрытьФорму("Документ.ДневнойОтчет.ФормаОбъекта",ПараметрыФормы);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоискОтчета()
	Если Объект.Заведение.Пустая() Тогда
		Заведение = ПодготовкаДанных.ПолучениеПользователя();
	Иначе
		Заведение = Объект.Заведение;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДневнойОтчет.Ссылка КАК Ссылка,
		|	ДневнойОтчет.ДатаСмены КАК ДатаСмены,
		|	ДневнойОтчет.Заведение КАК Заведение
		|ИЗ
		|	Документ.ДневнойОтчет КАК ДневнойОтчет
		|ГДЕ
		|	ДневнойОтчет.Заведение = &Заведение
		|	И ДневнойОтчет.ДатаСмены = &ДатаСмены";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаОтчета);
	Запрос.УстановитьПараметр("Заведение", Заведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка; 
	КонецЦикла;
	
	Возврат Документы.ДневнойОтчет.ПустаяСсылка();
	
	
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ДатаОтчета = ТекущаяДата();
	Пользователь = ПодготовкаДанных.ПолучениеПользователя(); 
	Если Пользователь = Перечисления.Заведение.Администратор ИЛИ Пользователь = Перечисления.Заведение.Паустовского Тогда
		Элементы.Заведение.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПрограму(Команда)
	ПрекратитьРаботуСистемы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Перебор(Команда)
	
КонецПроцедуры
