Процедура  СоздатьДокументПланирования(Владелец, СсылкаНаЗадачу, ДатаПланирования) Экспорт 
	Попытка
		Планирование = Документы.ПланированиеЗадачи.СоздатьДокумент();
		Планирование.Дата = ТекущаяДата();
		Планирование.Создал = Владелец;
		Планирование.СсылкаНаЗадачу = СсылкаНаЗадачу;
		Планирование.ДатаЛланирования = ДатаПланирования;
		Планирование.Записать(РежимЗаписиДокумента.Проведение);       
		
		Сообщить("Задача успешно запланирована на " + Формат(Строка(ДатаПланирования),"ДФ=dd.MM.yy; ДЛФ=DD"));
	Исключение
		Сообщить("Не удалось создать документ плавнирования задачи!");
	КонецПопытки;
	
КонецПроцедуры
