
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДатаПланированияЗдачи
	Движения.ДатаПланированияЗдачи.Записывать = Истина;
	Движение = Движения.ДатаПланированияЗдачи.Добавить();
	Движение.Период = Дата;
	Движение.Создал = Создал;
	Движение.ДатаПланирования = ДатаЛланирования;
	Движение.СсылкаНаЗадачу = СсылкаНаЗадачу;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
