Функция ПроверкаПароля(Пароль) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Отделы.Ссылка КАК Ссылка,
		|	Отделы.Пароль КАК Пароль
		|ИЗ
		|	Справочник.Отделы КАК Отделы
		|ГДЕ
		|	Отделы.Пароль = &Пароль";
	
	Запрос.УстановитьПараметр("Пароль", Пароль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
		
КонецФункции

Функция ВалидацияВходныхДанных(Значение, ТипЗначения) Экспорт 
	
	ПроверкаПройдена = Истина;
	Если НЕ ЗначениеЗаполнено(Значение) Тогда 
		ПроверкаПройдена = Ложь;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Передаваемое значение на проверку не заполненно! Ожидается значение с типоп "+Значение;
		Сообщение.Сообщить();
		Сообщить("Передаваемое значение было не заполненно!");
	КонецЕсли;
	
	//Если НЕ ТипЗнч(ТипЗначения) = Тип("Строка") Тогда  
	//	ПроверкаПройдена = Ложь;
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Передаваемое значение на проверку не заполненно! Ожидается значение с типоп "+Значение;
	//	Сообщение.Сообщить();
	//	Сообщить("Передаваемое значение было не заполненно!");

	//	Сообщить("Проверочный тип значения не соответствет строке!");
	//КонецЕсли;

	
	Если НЕ ЗначениеЗаполнено(ТипЗначения) Тогда  
		ПроверкаПройдена = Ложь;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не передан тип значения для проверки!";
		Сообщение.Сообщить();
	КонецЕсли;
	
  	Если НЕ ТипЗнч(Значение) = Тип(ТипЗначения) Тогда
		ПроверкаПройдена = Ложь;
		Сообщить("Значение " + Значение + " является типом " + ТипЗнч(Значение) + ", ожидается значение типа " + ТипЗначения);
	КонецЕсли;   
	
	Возврат ПроверкаПройдена;
	
КонецФункции

Функция ПроверитьПараметры(ВходныеПараметры, ОбязательныеПараметры) Экспорт 
	
	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(ВходныеПараметры, "Структура") ИЛИ 
										НЕ ПроверкиДанных.ВалидацияВходныхДанных(ВходныеПараметры, "Структура")	Тогда
		Возврат Неопределено;
	КонецЕсли;

	Для Каждого Элемент Из ОбязательныеПараметры Цикл
        Если НЕ ВходныеПараметры.Свойство(Элемент.Ключ) Тогда
            ВызватьИсключение СтрШаблон("Отсутствует обязательный параметр: %1", Элемент.Ключ);
        КонецЕсли;
    КонецЦикла;
    Возврат Истина; 
	
КонецФункции

