#Область ОбработчикиКомандФормы

&НаКлиенте
Функция ПодготовитьСпискиФайлов(МассивИмен)
	
	СпискиФайлов = Новый Соответствие();
	РазделенныйАрхив = Ложь;
	
	Для Каждого ИмяФайла Из МассивИмен Цикл
		Расширение        = Сред(ИмяФайла, СтрДлина(ИмяФайла)-3);
		БазовоеИмяФайла   = Сред(ИмяФайла, 1, СтрДлина(ИмяФайла)-4);
		БазовоеРасширение = Прав(БазовоеИмяФайла, 3);
		Если БазовоеРасширение = "b64" И Не РазделенныйАрхив Тогда
			СпискиФайлов.Вставить(БазовоеИмяФайла, ИмяФайла);
		ИначеЕсли Лев(БазовоеРасширение,1)="b"
			И СтрНайти("0123456789", Сред(БазовоеРасширение, 2, 1)) > 0 
			И СтрНайти("0123456789", Сред(БазовоеРасширение, 3, 1)) > 0 Тогда
			РазделенныйАрхив = Истина;
			// Есть имя номер файла в имени
			БазовоеИмяФайлаБезРасширения = Сред(БазовоеИмяФайла, 1, СтрДлина(БазовоеИмяФайла)-4);
			СписокФайлов = СпискиФайлов.Получить(БазовоеИмяФайлаБезРасширения);
			Если СписокФайлов = Неопределено Тогда
				СписокФайлов = Новый СписокЗначений();
				СпискиФайлов.Вставить(БазовоеИмяФайлаБезРасширения, СписокФайлов);
			КонецЕсли;
			СписокФайлов.Добавить(ИмяФайла);
		Иначе
			СпискиФайлов.Вставить(БазовоеИмяФайла, ИмяФайла);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СпискиФайлов;
	
КонецФункции

&НаКлиенте
Асинх Процедура Конвертировать(Команда)

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = НСтр("ru = 'Выберите файлы для конвертации'");
	Диалог.МножественныйВыбор = Истина;
	Диалог.Фильтр = "Base64.txt|*.b??.txt|Все файлы (*.*)|*.*";
	
	МассивИмен = Ждать Диалог.ВыбратьАсинх();
	Если МассивИмен = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СпискиФайлов = ПодготовитьСпискиФайлов(МассивИмен);
	
	Для Каждого КлючЗначение Из СпискиФайлов Цикл
		
		Если ТипЗнч(КлючЗначение.Значение) = Тип("СписокЗначений") Тогда
			// список файлов
			СписокФайлов = КлючЗначение.Значение;
			СписокФайлов.СортироватьПоЗначению();
			ИмяФайла                     = СписокФайлов.Получить(0);
			БазовоеИмяФайлаБезРасширения = Сред(ИмяФайла, 1, СтрДлина(ИмяФайла) - 8);
			ФинальноеИмяФайла            = СтрШаблон("%1.zip", БазовоеИмяФайлаБезРасширения);
			
			ЗаписьДвоичныхДанных = Новый ЗаписьДанных(ФинальноеИмяФайла); 
			Для Каждого ИмяФайла Из СписокФайлов Цикл
				
				ДвоичныеДанныеBase64       = Новый ДвоичныеДанные(ИмяФайла);
				СтрокаДвоичныеДанныеBase64 = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеBase64);
				ДвоичныеДанные             = ПолучитьДвоичныеДанныеИзBase64Строки(СтрокаДвоичныеДанныеBase64);
				Ждать ЗаписьДвоичныхДанных.ЗаписатьАсинх(ДвоичныеДанные);
				
			КонецЦикла;
			
			Ждать ЗаписьДвоичныхДанных.ЗакрытьАсинх();
			Сообщить(СтрШаблон(НСтр("ru = 'Сохранен файл :%1'"),ФинальноеИмяФайла));
			
		Иначе
			// один файл
			ИмяФайла                     = КлючЗначение.Значение;
			БазовоеИмяФайлаБезРасширения = Сред(ИмяФайла, 1, СтрДлина(ИмяФайла) - 8);
			ФинальноеИмяФайла            = СтрШаблон("%1.zip", БазовоеИмяФайлаБезРасширения);
			
			ДвоичныеДанныеBase64 = Новый ДвоичныеДанные(ИмяФайла);
			СтрокаДвоичныеДанныеBase64 = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеBase64);
			ДвоичныеДанные = ПолучитьДвоичныеДанныеИзBase64Строки(СтрокаДвоичныеДанныеBase64);
			
			Ждать ДвоичныеДанные.ЗаписатьАсинх(ФинальноеИмяФайла);
			Сообщить(СтрШаблон(НСтр("ru = 'Сохранен файл :%1'"), ФинальноеИмяФайла));
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
