

&НаСервере
Процедура ДатаСменыПриИзмененииНаСервере()
	Объект.ТЧ.Очистить();
	//загрузка информации
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДневнойОтчетСчетаНаУдаление.НомерСчета КАК НомерСчета,
		|	ДневнойОтчетСчетаНаУдаление.Сумма КАК Сумма,
		|	ДневнойОтчетСчетаНаУдаление.ПричинаОтказа КАК ПричинаОтказа,
		|	ДневнойОтчетСчетаНаУдаление.Коментарий КАК Коментарий,
		|	ДневнойОтчетСчетаНаУдаление.Ссылка.Заведение КАК Заведение,
		|	ДневнойОтчетСчетаНаУдаление.Ссылка.ДатаСмены КАК ДатаСмены
		|ИЗ
		|	Документ.ДневнойОтчет.СчетаНаУдаление КАК ДневнойОтчетСчетаНаУдаление
		|ГДЕ
		|	ДневнойОтчетСчетаНаУдаление.Ссылка.ДатаСмены = &ДатаСмены
		|
		|УПОРЯДОЧИТЬ ПО
		|	Заведение";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Счет = Объект.ТЧ.Добавить();
		Счет.Заведение 		 = Справочники.Заведения.ПолучитьЗаведение(Выборка.Заведение);
		Счет.НомерСчета      = Выборка.НомерСчета;
		Счет.Сумма           = Выборка.Сумма;
		Счет.ПричинаУдаления = Выборка.ПричинаОтказа;
		Счет.Коментарий      = Выборка.Коментарий;

	КонецЦикла;
	
	//проверка на удаление
	
	Для Каждого Счет Из Объект.ТЧ Цикл
		Счет.Статус = Документы.ЗапросНаУдалениеСчета.ПроверкаНаУдалениеСчета(Счет.Заведение, Счет.НомерСчета);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСменыПриИзменении(Элемент)
	ДатаСменыПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТЧСтатусПриИзмененииНаСервере()
	ТекСтрока = Элементы.ТЧ.ТекущаяСтрока;
	ЗначенияСтроки = Объект.ТЧ.НайтиПоИдентификатору(ТекСтрока);
	//Проверк на удаление
	СчетУдален = Документы.ЗапросНаУдалениеСчета.ПроверкаНаУдалениеСчета(ЗначенияСтроки.Заведение, ЗначенияСтроки.НомерСчета);

	//создание документа удаление счета
	Если СчетУдален = Ложь Тогда
		СсылкаНаДокУдаления = Документы.ЗапросНаУдалениеСчета.СоздатьЗаявкуУдаленияСчета(ЗначенияСтроки.Заведение, ЗначенияСтроки.НомерСчета, ЗначенияСтроки.Сумма,
			ЗначенияСтроки.ПричинаУдаления, ЗначенияСтроки.Коментарий, Перечисления.СтатусВыполнения.Завершено); 
	КонецЕсли;
	
	//проверка на доступность удаление на заведение. В данном случае заполнение поля хост определяет доступность.
	Если ЗначениеЗаполнено(ЗначенияСтроки.Заведение.АдрессХоста) = Истина Тогда
		//удаление счета на заведение
		ВВП.УдалитьСчет(ЗначенияСтроки.Заведение, ЗначенияСтроки.НомерСчета); 
	КонецЕсли;

	Если ЗначениеЗаполнено(СсылкаНаДокУдаления) = Истина Тогда
		ЗначенияСтроки.Статус = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧСтатусПриИзменении(Элемент)
	ТЧСтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаСмены = ТекущаяДата();
	ДатаСменыПриИзмененииНаСервере();

КонецПроцедуры
