&НаСервере
Процедура ПолучениеСпискаАктивныхПользователей()
    
    Объект.ИтогСписокСоединений.Очистить();          
    СоединенияИнформационнойБазы = ПолучитьСоединенияИнформационнойБазы();
    ИтогСписокСоединений = Объект.ИтогСписокСоединений;
    Для Каждого Соединение Из СоединенияИнформационнойБазы Цикл                   
		Если Соединение.Пользователь.Имя <> "" ТОгда
			ТЗ=ИтогСписокСоединений.Добавить();                                       
			ТЗ.Пользователь=Соединение.Пользователь.Имя;                              
			ТЗ.Приложение=ПредставлениеПриложения(Соединение.ИмяПриложения);          
			ТЗ.НачалоРаботы=Соединение.НачалоСеанса;                                  
			ТЗ.Компьютер=Соединение.ИмяКомпьютера;                                    
			ТЗ.Соединение=Соединение.НомерСоединения; 
		КонецЕсли;
    КонецЦикла;
    
    нНомерТекущегоСоединения=НомерСоединенияИнформационнойБазы();
    //В итоге получаем ТЗ со списком пользователей и Номер Текущего Соединения 
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ПолучениеСпискаАктивныхПользователей();
КонецПроцедуры
