
&НаКлиенте
Процедура ОткрытьДемоТестированиеОборудования(Команда)
	
	#Если МобильноеПриложениеКлиент Тогда
	ОткрытьФорму("Обработка._ДемоТестированиеОборудованияМобильный.Форма.Форма",, ЭтаФорма);
	#Иначе
	ОткрытьФорму("Обработка._ДемоТестированиеПодключаемогоОборудования.Форма.Форма",, ЭтаФорма);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДрайверыОборудования(Команда)
	
	ОткрытьФорму("Справочник.ДрайверыОборудования.ФормаСписка",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодключаемоеОборудование(Команда)
	
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.ФормаСписка",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРабочиеМеста(Команда)
	
	ОткрытьФорму("Справочник.РабочиеМеста.ФормаСписка",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЭлектронныеСертификатыНСПК(Команда)

	ОткрытьФорму("Обработка._ДемоЭлектронныеСертификатыНСПК.Форма.Форма",, ЭтаФорма);

КонецПроцедуры

