
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДатыЗадачи
	Движения.ДатыЗадачи.Записывать = Истина;
	Движение = Движения.ДатыЗадачи.Добавить();
	Движение.Период = Дата;
	Движение.ХарактеристикаДаты = ХарактеристикаДаты;
	Движение.Задача = Задача;
	Движение.Дата = НоваяДата;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
