#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ОбщегоНазначенияБПО.ИспользуетсяРаспределеннаяФискализация() Тогда
		Элементы.ОчередьЧеков.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаОповещения" формы.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Имясобытия = "ОбновитьСписок" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьКассовуюСмену(Команда)
	
	ВыполнитьОперацию("ОткрытьСмену");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьКассовуюСмену(Команда)
	
	ВыполнитьОперацию("ЗакрытьСмену");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОТекущемСостоянииРасчетов(Команда)
	
	ВыполнитьОперацию("ОтчетОТекущемСостоянииРасчетов");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетБезГашения(Команда)
	
	ВыполнитьОперацию("ОтчетБезГашения");
	
КонецПроцедуры

&НаКлиенте
Процедура ВнесениеДенег(Команда)
	
	ВнесениеВыемкаДенежныхСредств("Внесение");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыемкаДенег(Команда)
	
	ВнесениеВыемкаДенежныхСредств("Выемка");
	
КонецПроцедуры

&НаКлиенте
Процедура ВнесениеВыемкаДенежныхСредств(Команда)
	
	Результат = Ложь;
	
	Если Команда = "Внесение" Тогда
		ТекстЗаголовка = НСтр("ru = 'Введите сумму внесения'");
	Иначе
		ТекстЗаголовка = НСтр("ru = 'Введите сумму выемки'");
	КонецЕсли;
	   
	Оповещение = Новый ОписаниеОповещения("ВнесениеВыемкаДенежныхСредств_ВводЧислаЗавершение", ЭтотОбъект, Команда); 
	ПоказатьВводЧисла(Оповещение, 0, ТекстЗаголовка, 10, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнесениеВыемкаДенежныхСредств_ВводЧислаЗавершение(ВыбЗнач, Команда) Экспорт
	
	Если Не ПустаяСтрока(ВыбЗнач) Тогда 
		ПараметрыКоманды = Новый Структура("Сумма", ВыбЗнач);
		ВыполнитьОперацию(Команда, ПараметрыКоманды);
	КонецЕсли;     
		
КонецПроцедуры
		
&НаКлиенте
Процедура ВыполнитьОперацию(Команда, ПараметрыКоманды = Неопределено)
		
	ОчиститьСообщения();
		
	ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
	ПоддерживаемыеТипы.ПринтерЧеков = Истина;
	ПоддерживаемыеТипы.ККТ = Истина;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	Если ПараметрыКоманды <> Неопределено И ПараметрыКоманды.Свойство("Сумма") Тогда
		ДополнительныеПараметры.Вставить("Сумма", ПараметрыКоманды.Сумма);
	КонецЕсли;     
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюВыбораУстройства", ЭтотОбъект, ДополнительныеПараметры);
	МенеджерОборудованияКлиент.ВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипы,
		НСтр("ru='Выберите фискальное устройство'"), 
		НСтр("ru='Фискальное устройство не подключено.'"), 
		НСтр("ru='Фискальное устройство не выбрано.'"));

КонецПроцедуры
	
&НаКлиенте
Процедура ВыполнитьОперациюВыбораУстройства(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВыбора.Результат Тогда
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(РезультатВыбора.ОписаниеОшибки);      
		Возврат;
	КонецЕсли;

	ОчиститьСообщения();
	ЭтаФорма.Доступность = Ложь;

	Если ДополнительныеПараметры.Команда = "Внесение" Или ДополнительныеПараметры.Команда = "Выемка" Тогда
		ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыИнкассации();
		ПараметрыОперации.Сумма = ДополнительныеПараметры.Сумма;
		ПараметрыОперации.ТипИнкассации = ?(ДополнительныеПараметры.Команда = "Внесение", 1, 0);
	Иначе
		ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
	КонецЕсли;
	
	ТекущийКассир = МенеджерОборудованияКлиентСервер.ТекущийКассирДляФискальныхОпераций(); 
	ПараметрыОперации.Кассир = ТекущийКассир.Кассир;  
	ПараметрыОперации.КассирИНН = ТекущийКассир.КассирИНН;

	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОперацияЗавершение", ЭтотОбъект, ДополнительныеПараметры);

	Если ДополнительныеПараметры.Команда = "ОткрытьСмену" Тогда
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьОткрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, 
			УникальныйИдентификатор, РезультатВыбора.ИдентификаторУстройства, ПараметрыОперации);
	ИначеЕсли ДополнительныеПараметры.Команда = "ЗакрытьСмену" Тогда
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьЗакрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, 
			УникальныйИдентификатор, РезультатВыбора.ИдентификаторУстройства, ПараметрыОперации);
	ИначеЕсли ДополнительныеПараметры.Команда = "ОтчетОТекущемСостоянииРасчетов" Тогда
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФормированиеОтчетаОТекущемСостоянииРасчетов(ОповещениеПриЗавершении, 
			УникальныйИдентификатор, РезультатВыбора.ИдентификаторУстройства, ПараметрыОперации);
	ИначеЕсли ДополнительныеПараметры.Команда = "ОтчетБезГашения" Тогда
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФормированиеОтчетаБезГашения(ОповещениеПриЗавершении, 
			УникальныйИдентификатор, РезультатВыбора.ИдентификаторУстройства, ПараметрыОперации);
	ИначеЕсли ДополнительныеПараметры.Команда = "Внесение" Или ДополнительныеПараметры.Команда = "Выемка" Тогда
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьИнкассациюНаФискальномУстройстве(ОповещениеПриЗавершении, 
			УникальныйИдентификатор, РезультатВыбора.ИдентификаторУстройства, ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОперацияЗавершение(РезультатВыполнения, Параметры) Экспорт

	ЭтаФорма.Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда
	
		ТекстСообщения = НСтр("ru='Операция успешно завершена.'");
		
		Если Параметры.Команда = "ЗакрытьСмену" Тогда
			Если НЕ ЗаархивироватьДокументыНаСервере() Тогда
				ТекстПредупреждения = НСтр("ru = 'Ошибка записи документов'");
				ПоказатьПредупреждение(, ТекстПредупреждения, 10);
			КонецЕсли
		КонецЕсли;
	
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОчередьФискальныхЧеков()
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки <> Неопределено Тогда
		Для Каждого ВыбраннаяСтрока Из ВыделенныеСтроки Цикл
			ДанныеЧека = Документы._ДемоЧек.ПолучитьДанныеЧека(ВыбраннаяСтрока);
			МодульРаспределеннаяФискализация = ОбщегоНазначенияБПО.ОбщийМодуль("РаспределеннаяФискализация");
			МодульРаспределеннаяФискализация.ДобавитьЧекВОчередьЧековККТ(ДанныеЧека);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаархивироватьДокументыНаСервере()
	
	Возврат _ДемоПодключаемоеОборудованиеВызовСервера.ЗаархивироватьДокументыПередЗакрытиемСмены();
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура СформироватьОчередьФискальныхЧеков100()
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки <> Неопределено Тогда
		Для Каждого ВыбраннаяСтрока Из ВыделенныеСтроки Цикл
			ДанныеЧека = Документы._ДемоЧек.ПолучитьДанныеЧека(ВыбраннаяСтрока);
			Для Итератор = 1 По 100 Цикл 
				Идентификатор = Новый УникальныйИдентификатор;
				ДанныеЧека.ИдентификаторФискальнойЗаписи = XMLСтрока(Идентификатор);
				МодульРаспределеннаяФискализация = ОбщегоНазначенияБПО.ОбщийМодуль("РаспределеннаяФискализация");
				МодульРаспределеннаяФискализация.ДобавитьЧекВОчередьЧековККТ(ДанныеЧека)
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьУдалениеЧековИзОчереди()
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки <> Неопределено Тогда
		Для Каждого ВыбраннаяСтрока Из ВыделенныеСтроки Цикл
			МодульРаспределеннаяФискализация = ОбщегоНазначенияБПО.ОбщийМодуль("РаспределеннаяФискализация");
			МодульРаспределеннаяФискализация.УдалитьЧекИзОчереди(ВыбраннаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОчисткуОчередиЧеков()
	
	МодульРаспределеннаяФискализация = ОбщегоНазначенияБПО.ОбщийМодуль("РаспределеннаяФискализация");
	МодульРаспределеннаяФискализация.ОчиститьОчередьЧеков();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЧекиВОчередь(Команда)
	
	СформироватьОчередьФискальныхЧеков();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЧекиВОчередь100(Команда)
	
	СформироватьОчередьФискальныхЧеков100();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЧекИзОчереди(Команда)
	
	ВыполнитьУдалениеЧековИзОчереди();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОчередьЧеков(Команда)
	
	ВыполнитьОчисткуОчередиЧеков();
	
КонецПроцедуры

#КонецОбласти