
&НаСервере
Процедура ОбработатьЗаявкуНаСервере()
	Если Документы.ЗаявкаКлиента.ПроверкаОбработкиЗаявки(Объект.Ссылка) = Неопределено Тогда
		// Создаем набор записей регистра сведений
		НаборЗаписей = РегистрыСведений.ЗаявкаЗадачи.СоздатьНаборЗаписей();

		// Создаем новую запись
		НоваяЗапись = НаборЗаписей.Добавить();

		// Заполняем поля записи
		НоваяЗапись.Заявка = Объект.Ссылка;
		НоваяЗапись.Задача = Документы.ПланРабот.СозданиеДокументаПланаРабот(ТекущаяДата(),,Объект.ОписаниеЗаявки,Объект.Обработал,
			Перечисления.СтатусВыполнения.Создано,,,Перечисления.ТипЗадач.Задача, Объект.Клиент, Перечисления.ФункциональныйТипПлана.ПланЗадача,Объект.Вид);

		// Записываем набор записей
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			Сообщить("Ошибка при записи в регистр сведений: " + ОписаниеОшибки());
			Отказ = Истина;
		КонецПопытки;
	Иначе 
		Сообщить("Заявка уже обработана ранее!");
	КонецЕсли;
	
КонецПроцедуры

Функция СсылкаНаЗадачу()
	Возврат Документы.ЗаявкаКлиента.СсылкаНаЗадачуИзЗаявки(Объект.Ссылка);	
КонецФункции

&НаКлиенте
Процедура ОбработатьЗаявку(Команда)
	// Проверяем, записан ли документ
	Если Не Объект.Ссылка.Пустая() Тогда
		ОбработатьЗаявкуНаСервере();
	
		Парам = Новый Структура;
		СсылкаНаДокумент = СсылкаНаЗадачу();
		Если СсылкаНаДокумент.Пустая()=Ложь Тогда  
			Парам.Вставить("Ключ",СсылкаНаДокумент);
			
			ОткрытьФорму("Документ.ПланРабот.Форма.ФормаДокумента",Парам);
		КонецЕсли;

	Иначе
		Сообщить("Сначала запишите документ!");
	КонецЕсли;

	
КонецПроцедуры

