Функция СоздатьЗаявкуУдаленияСчета(Заведение, НомерСчета, Сумма, ПричинаОтмены, Коментарий, СтатусВыполнения) Экспорт 
	
	Док = Документы.ЗапросНаУдалениеСчета.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	Док.Заведение = Заведение;
	Док.НомерСчета = НомерСчета;
	Док.Сумма = Сумма;
	Док.ПричинаОтмены = ПричинаОтмены;
	Док.Коментарий = Коментарий;
	Док.СтатусВыполнения = СтатусВыполнения;
	Док.Записать();
	
	Возврат Док.Ссылка;
	
КонецФункции

Функция ПроверкаНаУдалениеСчета(Заведение, НомерСчета) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросНаУдалениеСчета.Заведение КАК Заведение,
		|	ЗапросНаУдалениеСчета.НомерСчета КАК НомерСчета
		|ИЗ
		|	Документ.ЗапросНаУдалениеСчета КАК ЗапросНаУдалениеСчета
		|ГДЕ
		|	ЗапросНаУдалениеСчета.Заведение = &Заведение
		|	И ЗапросНаУдалениеСчета.НомерСчета = &НомерСчета";
	
	Запрос.УстановитьПараметр("Заведение", Заведение);
	Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Истина;
		Прервать;	
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции
