//Создание Документа плана работ
Функция СозданиеДокументаПланаРабот(ДатаДок,СсылкаНаЗаказКлиент,Заказ,Ответственный,СтатусВыполнения,СрокВыполнения,СсылкаНаПланРабот,ТипПланаРабот,ОбъектКлиента,ФункциональныйТип, Задача) Экспорт 
	ПланРабот = Документы.ПланРабот.СоздатьДокумент();
	ПланРабот.Дата = ДатаДок;
	ПланРабот.СсылкаНаЗаказ = СсылкаНаЗаказКлиент;
	ПланРабот.ОписаниеЗадачи = Заказ;
	ПланРабот.Ответственный = Ответственный;
	ПланРабот.СтатусВыполнения = СтатусВыполнения;
	ПланРабот.СрокВыполнении = СрокВыполнения;
	ПланРабот.ПланРаботРодитель = СсылкаНаПланРабот;
	ПланРабот.ТипПланаРабот = ТипПланаРабот;
	ПланРабот.Объект = ОбъектКлиента;
	ПланРабот.ФункциональныйТип = ФункциональныйТип;
	ПланРабот.Задача = Задача;
	
	//заполнение этапов
	Если ФункциональныйТип = Перечисления.ФункциональныйТипПлана.ПланПроект Тогда
		Владелец = Задача; 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СписокЭтаповВыполнения.Владелец КАК Владелец,
			|	СписокЭтаповВыполнения.Ответственный КАК Ответственный,
			|	СписокЭтаповВыполнения.Задача КАК Задача,
			|	СписокЭтаповВыполнения.Исполнитель КАК Исполнитель,
			|	СписокЭтаповВыполнения.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СписокЭтаповВыполнения КАК СписокЭтаповВыполнения
			|ГДЕ
			|	СписокЭтаповВыполнения.Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец", Владелец);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТекЭтап = ПланРабот.Этапы.Добавить();
			ТекЭтап.ЗадачаСсылка = Выборка.Задача;             //ссылка на задачу в спр задачи
			ТекЭтап.Задача = Выборка.Задача.Наименование;                   //текстовое представление задачи
			ТекЭтап.Ответственный = Выборка.Ответственный;
			ТекЭтап.Исполнитель = Выборка.Исполнитель;
			ТекЭтап.СтатусВыполнения = Перечисления.СтатусВыполнения.Создано;
			ТекЭтап.ПроцентВыполнения = "0 %";
		КонецЦикла;
	
		
	КонецЕсли;
	ПланРабот.Записать();
	Сообщить("План выполнения работ успешно создан");
	
	Возврат ПланРабот.Ссылка;  
	
КонецФункции

Функция ПолучитьСледЗадачу(СсылкаНаПлан) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланРаботЭтапы.СсылкаНаПланРабот КАК СсылкаНаПланРабот,
		|	ПланРаботЭтапы.Ссылка КАК Ссылка,
		|	ПланРаботЭтапы.СтатусВыполнения КАК СтатусВыполнения
		|ИЗ
		|	Документ.ПланРабот.Этапы КАК ПланРаботЭтапы
		|ГДЕ
		|	ПланРаботЭтапы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаПлан);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Ссылка = Выборка.СсылкаНаПланРабот;
		АктуальныйСтатус = Документы.ПланРабот.ПолучениеАктуальногоСтатусаЗадачи(Ссылка);
		Если АктуальныйСтатус <> Перечисления.СтатусВыполнения.Завершено Тогда
			Возврат Выборка.СсылкаНаПланРабот;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;   //означает что завершать надо сам план
			
КонецФункции

Процедура АктивироватьСледующуюЗадачу(СсылкаНаПланРодитель) Экспорт      //в плане родитель инфа о следующих шагах
	ЗадачаДляАктивации = ПолучитьСледЗадачу(СсылкаНаПланРодитель);	
	Если ЗадачаДляАктивации = Неопределено Тогда //либо задачи все выполнены. Завершаем текущий план
		ЗадачаДляАктивации = СсылкаНаПланРодитель; 	
		ЗавершитьЗадачу = Истина;
	КонецЕсли;
	ПланРабот = ЗадачаДляАктивации.ПолучитьОбъект();
	
	Заказ = ПланРабот.СсылкаНаЗаказ;
	
	ПланРодитель = ПланРабот.ПланРаботРодитель;
	ТекПлан = ПланРабот.Ссылка;
	НовыйСтатус = Перечисления.СтатусВыполнения.ОтправленаИсполнителю;
	ТипЗадачи = ПланРабот.ФункциональныйТип; 
	Если ЗавершитьЗадачу = Истина Тогда //либо задачи все выполнены. Завершаем текущий план
		НовыйСтатус = Перечисления.СтатусВыполнения.Завершено;
	КонецЕсли;
	
	Документы.СменаСтатуса.СменаСтатуса(Заказ, ПланРодитель, ТекПлан, НовыйСтатус,ТипЗадачи);
	//ПланРодитель = СсылкаНаПланРодитель.ПолучитьОбъект();
КонецПроцедуры

Функция ПолучениеАктуальногоСтатусаЗадачи(ПланСсылка) Экспорт
	АктуальныйСтатус = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыЗадачСрезПоследних.Регистратор КАК Регистратор,
		|	СтатусыЗадачСрезПоследних.ТекущийПлан КАК ТекущийПлан,
		|	СтатусыЗадачСрезПоследних.АктуальныйСтатус КАК АктуальныйСтатус
		|ИЗ
		|	РегистрСведений.СтатусыЗадач.СрезПоследних КАК СтатусыЗадачСрезПоследних
		|ГДЕ
		|	СтатусыЗадачСрезПоследних.ТекущийПлан = &ТекущийПлан";
	
	Запрос.УстановитьПараметр("ТекущийПлан", ПланСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		АктуальныйСтатус=Выборка.АктуальныйСтатус;		
	КонецЦикла;
	//Если Выборка.АктуальныйСтатус.ПустаяСсылка() Тогда
	//	Возврат Неопределено;	
	//Иначе
	//	Возврат Выборка.АктуальныйСтатус;
	//КонецЕсли;	
	Возврат Выборка.АктуальныйСтатус;

КонецФункции  

Функция ПроцентВыполненияЗадачи(Задача) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланРабот.Ссылка КАК Ссылка,
		|	ПланРабот.ФункциональныйТип КАК ФункциональныйТип
		|ИЗ
		|	Документ.ПланРабот КАК ПланРабот
		|ГДЕ
		|	ПланРабот.Ссылка = &ТекущийПлан";
	
	Запрос.УстановитьПараметр("ТекущийПлан", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий(); 
	
	Если Выборка.ФункциональныйТип = Перечисления.ФункциональныйТипПлана.ПланЗадача Тогда
		Если Документы.ПланРабот.ПолучениеАктуальногоСтатусаЗадачи(Задача) = Перечисления.СтатусВыполнения.Завершено Тогда
			Возврат 100;
		Иначе
			Возврат 0;
		КонецЕсли;
	КонецЕсли;
	
	//выбирать из документа
	//запрашивать статус
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланРабот.Ссылка КАК Ссылка,
		|	ПланРабот.ПланРаботРодитель КАК ПланРаботРодитель,
		|	ПланРабот.ФункциональныйТип КАК ФункциональныйТип
		|ИЗ
		|	Документ.ПланРабот КАК ПланРабот
		|ГДЕ
		|	ПланРабот.ПланРаботРодитель = &ПланРаботРодитель";
	
	Запрос.УстановитьПараметр("ПланРаботРодитель", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ОбщееКолЗадач = 0;
	ПрогресВыполнения = 0;

	Пока Выборка.Следующий() Цикл
		ОбщееКолЗадач = ОбщееКолЗадач + 1;
		ПрогресВыполнения = ПрогресВыполнения + Документы.ПланРабот.ПроцентВыполненияЗадачи(Выборка.Ссылка);
	КонецЦикла;
	
	Если ОбщееКолЗадач = 0 Тогда
		ОбщееКолЗадач = 1;
	КонецЕсли;

	
	Возврат ПрогресВыполнения/ОбщееКолЗадач; 
	

КонецФункции // ПроцентВыполненияЗадачи()

Функция ЗавершитьЗадачу(Задача) Экспорт   //проверяем закрыты ли все задачи 
	
	//получаем все вложеные задачи
	//если нету возвращаем истину
	//если есть проверяем на вложеность
	//проверяем на статус
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РодительЗадачиСрезПоследних.Задача КАК Задача,
		|	РодительЗадачиСрезПоследних.Родитель КАК Родитель
		|ИЗ
		|	РегистрСведений.РодительЗадачи.СрезПоследних КАК РодительЗадачиСрезПоследних
		|ГДЕ
		|	РодительЗадачиСрезПоследних.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗавершитьЗадачу(Выборка.Задача);	
	КонецЦикла;
	
	НовыеЗаписиВ_Регистры.ЗаписьАтрибута_В_Регистр(Задача, Перечисления.АтрибутыЗадачи.СтатусВыполнения, Перечисления.СтатусВыполнения.Завершено,
			ПодготовкаДанных.ПолучитьТекущегоПользователя());
		КонецФункции
		
Функция АктуальныйСтатусЗадачи(Задача) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыЗадач_1СрезПоследних.Задача КАК Задача,
		|	СтатусыЗадач_1СрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыЗадач_1.СрезПоследних(, Задача = &Задача) КАК СтатусыЗадач_1СрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий(); 
	
	Возврат Выборка.Статус;
	
КонецФункции
