
#Область ОбработчикиСобытий

// health
Функция HealthGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Ложь, "health");
КонецФункции

// stocks
Функция StocksGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "stocks");
КонецФункции

// sales
Функция SalesGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "sales");
КонецФункции

// cash-balances
Функция CashBalancesGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "cash-balances");
КонецФункции

// settlements
Функция SettlementsGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "settlements");
КонецФункции

// barcodes
Функция BarcodesGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "barcodes");
КонецФункции

// prices
Функция PricesGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "prices");
КонецФункции

// products
Функция ProductsGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "products");
КонецФункции

// product-by-id
Функция ProductByIdGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "product-by-id");
КонецФункции

// warehouses
Функция WarehousesGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "warehouses");
КонецФункции

// warehouse-by-id
Функция WarehouseByIdGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "warehouse-by-id");
КонецФункции

// cash-registers
Функция CashRegistersGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "cash-registers");
КонецФункции

// cash-register-by-id
Функция CashRegisterByIdGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "cash-register-by-id");
КонецФункции

// counterparties
Функция CounterpartiesGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "counterparties");
КонецФункции

// counterparty-by-id
Функция CounterpartyByIdGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "counterparty-by-id");
КонецФункции

// price-types
Функция PriceTypesGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "price-types");
КонецФункции

// price-type-by-id
Функция PriceTypeByIdGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "price-type-by-id");
КонецФункции

// goods-receipts
Функция GoodsReceiptsGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "goods-receipts");
КонецФункции

// goods-receipt-by-id
Функция GoodsReceiptByIdGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "goods-receipt-by-id");
КонецФункции

// write-offs
Функция WriteOffsGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "write-offs");
КонецФункции

// write-off-by-id
Функция WriteOffByIdGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "write-off-by-id");
КонецФункции

// inventories
Функция InventoriesGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "inventories");
КонецФункции

// inventory-by-id
Функция InventoryByIdGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "inventory-by-id");
КонецФункции

// repricings
Функция RepricingsGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "repricings");
КонецФункции

// repricing-by-id
Функция RepricingByIdGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "repricing-by-id");
КонецФункции

// cash-in
Функция CashInGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "cash-in");
КонецФункции

// cash-in-by-id
Функция CashInByIdGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "cash-in-by-id");
КонецФункции

// cash-out
Функция CashOutGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "cash-out");
КонецФункции

// cash-out-by-id
Функция CashOutByIdGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "cash-out-by-id");
КонецФункции

// receipts
Функция ReceiptsGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "receipts");
КонецФункции

// receipt-by-id
Функция ReceiptByIdGET(Запрос)
	Возврат Апи_Транспорт.ОбработатьЗапрос(Запрос, Истина, "receipt-by-id");
КонецФункции

#КонецОбласти
