
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьПодключаемоеОборудование = _ДемоПодключаемоеОборудованиеВызовСервера.ИспользоватьПодключаемоеОборудование();
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СчитывательМагнитныхКарт, _ДемоЭмуляторККТ");
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

// Процедура - обработчик события "ПриЗакрытии" формы.
//
&НаКлиенте
Процедура ПриЗакрытии()
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаОповещения" формы.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование"
		И ВводДоступен () Тогда
		Если ИмяСобытия = "TracksData" Тогда
			ПолученКодИзСМК(Параметр);
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выбирает из массива параметров магнитный код карты, считанный СМК.
//
&НаКлиенте
Процедура ПолученКодИзСМК(Параметр)
	
	Если Параметр.СписокШаблонов <> Неопределено И Параметр.СписокШаблонов.Количество() > 0 Тогда
		МКод = Параметр.СписокШаблонов[0].ДанныеДорожек[0].ЗначениеПоля;
	Иначе
		МКод = Параметр.КодКарты;
	КонецЕсли;
	
	ПолучитьКлиентаНаСервере(МКод);
	
КонецПроцедуры

// Процедура получает клиента из справочника "Клиенты" по магнитному коду карты.
//
&НаСервере
Процедура ПолучитьКлиентаНаСервере(МКод)
	
	Клиент = _ДемоПодключаемоеОборудованиеВызовСервера.НайтиКлиентаПоМК(МКод);
	Если Клиент <> Неопределено Тогда
		Элементы.Список.ТекущаяСтрока = Клиент;
	Иначе
		ТекстСообщения = НСтр("ru = 'Карта не найдена.'");
		ОбщегоНазначенияБПО.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
