                               
Процедура ОбновитьПоставляемыеДрайвера() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВчасноКасаФискальныйРегистратор;
	ИдентификаторОбъекта = "";
	ИмяМакетаДрайвера = Неопределено;
	ПоставляетсяДистрибутивом = Ложь;
	ВерсияДрайвера = Неопределено;
	СнятСПоддержки = Ложь;
	
	Параметры = Новый Структура;
	
	Для Каждого ИмяПеречисления Из Метаданные.Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ЗначенияПеречисления Цикл
		Если Строка(ОбработчикДрайвера) = ИмяПеречисления.Синоним Тогда
			Параметры.Вставить("Имя", ИмяПеречисления.Имя);
			Параметры.Вставить("Наименование", ИмяПеречисления.Синоним);
			Параметры.Вставить("ТипОборудования", Перечисления["ТипыПодключаемогоОборудования"][ИмяПеречисления.Комментарий]);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Драйвер = Справочники.ДрайверыОборудования.НайтиПоНаименованию(Параметры.Наименование);
	
	Если Драйвер.Пустая() Тогда
		Драйвер = Справочники.ДрайверыОборудования.СоздатьЭлемент();		
		НужнаЗапись = Истина;
	Иначе
		Драйвер = Драйвер.ПолучитьОбъект();
		НужнаЗапись = Ложь;
		Если Драйвер.ТипОборудования <> Параметры.ТипОборудования Или Драйвер.ОбработчикДрайвера <> ОбработчикДрайвера Тогда
			НужнаЗапись = Истина;
		КонецЕсли;
		Если (Драйвер.Наименование <> Параметры.Наименование) Или (Драйвер.ИдентификаторОбъекта <> Строка(ИдентификаторОбъекта)) Или (Драйвер.ИмяМакетаДрайвера <> Строка(ИмяМакетаДрайвера)) Или (Драйвер.ПоставляетсяДистрибутивом <> ПоставляетсяДистрибутивом) Или (Драйвер.ВерсияДрайвера <> Строка(ВерсияДрайвера)) Или (Драйвер.СнятСПоддержки <> СнятСПоддержки) Тогда
			НужнаЗапись = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если НужнаЗапись Тогда
		Драйвер.ТипОборудования = Параметры.ТипОборудования;
		Драйвер.ОбработчикДрайвера = ОбработчикДрайвера;
		Драйвер.Наименование = Параметры.Наименование;
		Драйвер.ИдентификаторОбъекта = ИдентификаторОбъекта;
		Драйвер.ИмяМакетаДрайвера = ИмяМакетаДрайвера; 
		Драйвер.ПоставляетсяДистрибутивом = ПоставляетсяДистрибутивом;
		Драйвер.ВерсияДрайвера = ВерсияДрайвера;
		Драйвер.СнятСПоддержки = СнятСПоддержки;
		Драйвер.Записать();
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ИДКонфигурации() Экспорт
	
	Имя = Метаданные.Имя;
	Версия = Метаданные.Версия;
	
	Если Ложь Тогда
		
	ИначеЕсли Найти(ВРег(Имя), ВРег("BASERP")) Тогда	
		ИД = ?(Лев(Версия, 3) = "2.5", "BASERP25", "BASERP");
		
	ИначеЕсли Найти(ВРег(Имя), ВРег("BASSmallBusiness")) Тогда
		ИД = "BASSB";		
		
	ИначеЕсли Найти(ВРег(Имя), ВРег("BASКомплексноеУправлениеПредприятием")) Тогда
		ИД = ?(Лев(Версия, 3) = "2.5", "BASКУП25", "BASКУП");		
			
	ИначеЕсли Найти(ВРег(Имя), ВРег("BASРозничнаяТорговля")) Тогда
		ИД = "BASРТ";
		
	ИначеЕсли Найти(ВРег(Имя), ВРег("BASУправлениеТорговлей")) Тогда
		ИД = ?(Лев(Версия, 3) = "3.5", "BASУТ35", "BASУТ");
		
	ИначеЕсли Найти(ВРег(Имя), ВРег("УправлениеНебольшойФирмойДляУкраины")) Тогда
		ИД = "УНФ";		
		
	ИначеЕсли Найти(ВРег(Имя), ВРег("УправлениеТорговлейДляУкраины")) Тогда
		ИД = "УТ"; 
		
	Иначе
		ИД = Имя;
	КонецЕсли;
	
	Возврат ИД;				
	
КонецФункции

Функция ПолучитьСтавкуНДССтрокой(СтавкаНДС) Экспорт
	
	ИДКонфигурации = ИДКонфигурации();
	Если ИДКонфигурации = "BASSB" Или ИДКонфигурации = "УНФ" Тогда
		Возврат СтавкаНДС;
	КонецЕсли;
		
	ПеречислениеСтавкаНДС = ПеречислениеСтавкаНДСПоСтавкеНДС(СтавкаНДС);
	
	Если ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
		ЗначениеНалога = "20";
	ИначеЕсли ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС14") Тогда
		ЗначениеНалога = "14";
	ИначеЕсли ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7") Тогда
		ЗначениеНалога = "7";
	ИначеЕсли ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0") Тогда
		ЗначениеНалога = "0";
	ИначеЕсли ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
		ЗначениеНалога = "Без НДС";
	ИначеЕсли ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НеНДС") Тогда
		ЗначениеНалога = "Не НДС";
	Иначе
		ЗначениеНалога = Строка(ПеречислениеСтавкаНДС);
	КонецЕсли;
	
	Возврат ЗначениеНалога;
	
КонецФункции

Функция ПолучитьПоСтрокеСтавкуНДС(ЗначениеНалога) Экспорт
	
	ИДКонфигурации = ИДКонфигурации();
	Если ИДКонфигурации = "BASSB" Или ИДКонфигурации = "УНФ" Тогда
		Возврат ЗначениеНалога;
	КонецЕсли; 
	
	Если ЗначениеНалога = "20" Тогда
		ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
	ИначеЕсли ЗначениеНалога = "14" Тогда
		ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС14");
	ИначеЕсли ЗначениеНалога = "7" Тогда
		ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7");
	ИначеЕсли ЗначениеНалога = "0" Тогда
		ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
	ИначеЕсли ЗначениеНалога = "Без НДС" Тогда
		ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	Иначе
		ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НеНДС");
	КонецЕсли;
	
	СтавкаНДС = СтавкаНДСПоЗначениюПеречисления(ПеречислениеСтавкаНДС);
	
	Возврат СтавкаНДС;
	
КонецФункции

Функция ПеречислениеСтавкаНДСПоСтавкеНДС(СтавкаНДС)
	
	ПеречислениеСтавкаНДС = СтавкаНДС["ПеречислениеСтавкаНДС"];
	Возврат ПеречислениеСтавкаНДС;
	
КонецФункции

Функция СтавкаНДСПоЗначениюПеречисления(ПеречислениеСтавкаНДС, ТипНалогообложенияНДС = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтавкиНДСТипыНалогообложенияНДС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС.ТипыНалогообложенияНДС КАК СтавкиНДСТипыНалогообложенияНДС
	|ГДЕ
	|	СтавкиНДСТипыНалогообложенияНДС.Ссылка.ПеречислениеСтавкаНДС = &ПеречислениеСтавкаНДС
	|	И СтавкиНДСТипыНалогообложенияНДС.ТипНалогообложенияНДС = &ТипНалогообложенияНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.ПеречислениеСтавкаНДС = &ПеречислениеСтавкаНДС
	|	И &НалогообложениеНеУказано";
	
	Запрос.УстановитьПараметр("ПеречислениеСтавкаНДС", ПеречислениеСтавкаНДС);
	Если ТипНалогообложенияНДС = Неопределено Тогда
		Запрос.УстановитьПараметр("ТипНалогообложенияНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
		Запрос.УстановитьПараметр("НалогообложениеНеУказано", Истина);
	Иначе
		Запрос.УстановитьПараметр("ТипНалогообложенияНДС", ТипНалогообложенияНДС);
		Запрос.УстановитьПараметр("НалогообложениеНеУказано", Ложь);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.СтавкиНДС.ПустаяСсылка();
	
КонецФункции
