
&НаСервере
Процедура ОтветственныйПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РабочиеЗадачи.Исполнитель КАК Исполнитель,
		|	РабочиеЗадачи.Наименование КАК Наименование,
		|	РабочиеЗадачи.Статус КАК Статус,
		|	РабочиеЗадачи.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.РабочиеЗадачи КАК РабочиеЗадачи
		|ГДЕ
		|	РабочиеЗадачи.Исполнитель = &Исполнитель
		|	И РабочиеЗадачи.Статус <> &Статус";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СостояниеЗадач.Завершенно);
	Запрос.УстановитьПараметр("Исполнитель", Объект.Ответственный.СотрудникПоУмолчанию);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Невыполненые.Добавить();
		НоваяСтрока.СсылкаНаЗадачу = Выборка.Ссылка;
		НоваяСтрока.Задача = Выборка.Ссылка;

	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	ОтветственныйПриИзмененииНаСервере();
КонецПроцедуры
