
Функция Check_printerCheck_printer(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	ПроверитьВсеОборудованиеНаСервере();

	Возврат Ответ;
КонецФункции

&НаСервере
Процедура ПроверитьВсеОборудованиеНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОборудованиеДополнительнаяИнформация.ВидИнформации КАК ВидИнформации,
		|	ОборудованиеДополнительнаяИнформация.Данные КАК Данные,
		|	ОборудованиеДополнительнаяИнформация.Ссылка.Местонахождения КАК Местонахождения,
		|	ОборудованиеДополнительнаяИнформация.Ссылка.Локация КАК Локация,
		|	ОборудованиеДополнительнаяИнформация.Ссылка.ВидОборудования КАК ВидОборудования,
		|	ОборудованиеДополнительнаяИнформация.Ссылка.Код КАК Код,
		|	ОборудованиеДополнительнаяИнформация.Ссылка.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Оборудование.ДополнительнаяИнформация КАК ОборудованиеДополнительнаяИнформация
		|ГДЕ
		|	ОборудованиеДополнительнаяИнформация.ВидИнформации = &ВидИнформации
		|	И ОборудованиеДополнительнаяИнформация.Ссылка.ВидОборудования = &ВидОборудования";
	
	Запрос.УстановитьПараметр("ВидОборудования", Перечисления.ВидыОборудования.Принтер);
	Запрос.УстановитьПараметр("ВидИнформации", Справочники.ВидИнформацииОборудования.IP_адрес);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат = ВнешнееВзаимодействие.Пинг(Выборка.Данные);
		Статус = Результат.Успех;
		КоличествоУдачныхПопыток = Результат.КоличествоУдачныхПопыток;

		Если Статус = Истина Тогда
			Статус = "АКТИВЕН";
		Иначе
			Статус = "НЕ ДОСТУПЕН";
		КонецЕсли;

		Сообщить("Проверка принтера: " + Выборка.Местонахождения + " (" + Выборка.Локация+ ")" + Символы.ПС
				+ "Адресс: " + Выборка.Данные + Символы.ПС
				+ "Состояние: " + Статус + Символы.ПС
				+ "Количество удачных попыток: " + Строка(КоличествоУдачныхПопыток) + "/4");
				
		ВнешнееВзаимодействие.ЗаписьАктивностьОбрудования_В_Регистр(Выборка.Ссылка, Результат.Успех, КоличествоУдачныхПопыток); 		
	КонецЦикла;
	 	
КонецПроцедуры
