
#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ТипОборудования.СписокВыбора.Добавить(Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток);
	Если ОбщегоНазначенияБПО.ИспользуетсяТерминалыСбораДанных() Тогда
		Элементы.ТипОборудования.СписокВыбора.Добавить(Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыполнить(Команда)

	ЗаполнитьБазуТоваров();

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВыполнитьЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтаФорма.Доступность = Истина;
	
	Если ТипЗнч(РезультатВыполнения) = Тип("Структура") Тогда
		
		Если РезультатВыполнения.Результат Тогда
			
			ИдентификаторУстройстваСтрокой = Строка(РезультатВыполнения.ИдентификаторУстройства);
			ТекстСообщения = НСтр("ru='Операция завершена успешна: %1'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", ИдентификаторУстройстваСтрокой);
			
		Иначе
			ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
		КонецЕсли;
		
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВыполнить()
	
	ОчиститьСообщения();
	
	Если ПустаяСтрока(ТипОборудования) Тогда
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(НСтр("ru='Не выбран тип оборудования.'"));
		Возврат;
	КонецЕсли;
	
	ОповещенияПриЗавершение = Новый ОписаниеОповещения("ВыгрузитьВыполнитьЗавершение", ЭтотОбъект);
	
	Если ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток") Тогда
		ПараметрыОперации = ОборудованиеВесовоеОборудованиеКлиентСервер.ПараметрыОперацииВесыСПечатьюЭтикеток();
		Для Каждого Товар Из ТаблицаВыгрузки Цикл
			ТоварнаяПозиция = ОборудованиеВесовоеОборудованиеКлиентСервер.ПараметрыСтрокиВыгрузкиВВесыСПечатьюЭтикеток();
			ТоварнаяПозиция.PLU = Товар.PLU;
			ТоварнаяПозиция.Код = Товар.SKU;
			ТоварнаяПозиция.НаименованиеПолное = Товар.Наименование + " " + Товар.Характеристика;
			ТоварнаяПозиция.ОписаниеТовара     = Товар.ОписаниеТовара;
			ТоварнаяПозиция.ВесовойТовар = Истина;
			ТоварнаяПозиция.СрокХранения = 3;
			ТоварнаяПозиция.Цена = Товар.Цена;
			ПараметрыОперации.ТаблицаТоваров.Добавить(ТоварнаяПозиция)
		КонецЦикла;
		ЭтаФорма.Доступность = Ложь;
		ОборудованиеВесовоеОборудованиеКлиент.НачатьВыгрузкуДанныеВВесыСПечатьюЭтикеток(ОповещенияПриЗавершение, УникальныйИдентификатор, Неопределено, ПараметрыОперации);
		
	ИначеЕсли ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ТерминалСбораДанных") Тогда
		МодульОборудованиеТерминалыСбораДанныхКлиентСервер = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеТерминалыСбораДанныхКлиентСервер");
		МодульОборудованиеТерминалыСбораДанныхКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеТерминалыСбораДанныхКлиент");
		ПараметрыОперации = МодульОборудованиеТерминалыСбораДанныхКлиентСервер.ПараметрыВыгрузкиВТСД();
		Для Каждого Товар Из ТаблицаВыгрузки Цикл
			ТоварнаяПозиция = МодульОборудованиеТерминалыСбораДанныхКлиентСервер.ПараметрыСтрокиВыгрузкиВТСД();
			ТоварнаяПозиция.Код      = Товар.SKU;
			ТоварнаяПозиция.Артикул  = Товар.Артикул;
			ТоварнаяПозиция.Штрихкод = Товар.Штрихкод;
			ТоварнаяПозиция.Наименование                = Товар.Наименование;
			ТоварнаяПозиция.ЕдиницаИзмерения            = Товар.ЕдиницаИзмерения;
			ТоварнаяПозиция.ХарактеристикаНоменклатуры  = Товар.Характеристика;
			ТоварнаяПозиция.СерияНоменклатуры           = Товар.Серия;
			ТоварнаяПозиция.Качество                    = Товар.Качество;
			ТоварнаяПозиция.Цена                        = Товар.Цена;
			ТоварнаяПозиция.Остаток                     = 0;
			ТоварнаяПозиция.Алкоголь                    = Товар.Алкоголь;
			ТоварнаяПозиция.Маркируемый                 = Товар.Маркируемый;
			ТоварнаяПозиция.КодВидаАлкогольнойПродукции = Товар.КодВидаАлкогольнойПродукции;
			ТоварнаяПозиция.КодАлкогольнойПродукции     = Товар.КодАлкогольнойПродукции;
			ТоварнаяПозиция.ЕмкостьТары                 = Товар.ЕмкостьТары;
			ТоварнаяПозиция.Крепость                    = Товар.Крепость;
			ТоварнаяПозиция.ИННПроизводителя            = Товар.ИННПроизводителя;
			ТоварнаяПозиция.КПППроизводителя            = Товар.КПППроизводителя;
			ТоварнаяПозиция.ШтрихкодУпаковки            = Товар.ШтрихкодУпаковки;
			ПараметрыОперации.ТаблицаТоваров.Добавить(ТоварнаяПозиция);
		КонецЦикла;
		ЭтаФорма.Доступность = Ложь;
		МодульОборудованиеТерминалыСбораДанныхКлиент.НачатьВыгрузкуДанныеВТСД(ОповещенияПриЗавершение, УникальныйИдентификатор, Неопределено, ПараметрыОперации);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСписокТоваров(Команда)
	
	ОчиститьСообщения();
	
	Если ПустаяСтрока(ТипОборудования) Тогда
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(НСтр("ru='Не выбран тип оборудования.'"));
		Возврат;
	КонецЕсли;
	
	ОповещенияПриЗавершение = Новый ОписаниеОповещения("ВыгрузитьВыполнитьЗавершение", ЭтотОбъект);
	
	Если ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток") Тогда
		
		ЭтаФорма.Доступность = Ложь;
		ОборудованиеВесовоеОборудованиеКлиент.НачатьОчисткуТоваровВВесахСПечатьюЭтикеток(ОповещенияПриЗавершение, УникальныйИдентификатор);  
		
	ИначеЕсли ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ТерминалСбораДанных") Тогда
		
		ЭтаФорма.Доступность = Ложь;
		МодульОборудованиеТерминалыСбораДанныхКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеТерминалыСбораДанныхКлиент");
		МодульОборудованиеТерминалыСбораДанныхКлиент.НачатьОчисткуДанныеВТСД(ОповещенияПриЗавершение, УникальныйИдентификатор); 
		
	КонецЕсли;
	           
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТоварыИзОборудования(Команда)
	
	ОчиститьСообщения();
	
	Если ПустаяСтрока(ТипОборудования) Тогда
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(НСтр("ru='Не выбран тип оборудования.'"));
		Возврат;
	КонецЕсли;
	
	ОповещенияПриЗавершение = Новый ОписаниеОповещения("ВыгрузитьВыполнитьЗавершение", ЭтотОбъект);
	
	Если ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток") Тогда
		
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(НСтр("ru='Команда не доступна для выбранного типа оборудования.'"))
		
	ИначеЕсли ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ТерминалСбораДанных") Тогда
		
		ЭтаФорма.Доступность = Ложь;
		МодульОборудованиеТерминалыСбораДанныхКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеТерминалыСбораДанныхКлиент");
		МодульОборудованиеТерминалыСбораДанныхКлиент.НачатьЗагрузкуДанныеИзТСД(ОповещенияПриЗавершение, УникальныйИдентификатор);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьБазуТоваров()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	_ДемоНоменклатура.Наименование КАК Наименование,
	                      |	_ДемоШтрихкоды.Штрихкод КАК Штрихкод,
	                      |	Упаковки.Штрихкод КАК ШтрихкодУпаковки,
	                      |	_ДемоНоменклатура.Цена КАК Цена,
	                      |	_ДемоНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                      |	_ДемоНоменклатура.Характеристика КАК Характеристика,
	                      |	_ДемоНоменклатура.ОписаниеТовара КАК ОписаниеТовара,
	                      |	_ДемоНоменклатура.Артикул КАК Артикул,
	                      |	_ДемоНоменклатура.Серия КАК Серия,
	                      |	_ДемоНоменклатура.Качество КАК Качество,
	                      |	 1 КАК Количество,
	                      |	_ДемоНоменклатура.PLU КАК PLU,
	                      |	_ДемоНоменклатура.SKU КАК SKU,
	                      |	_ДемоНоменклатура.Алкоголь КАК Алкоголь,
	                      |	_ДемоНоменклатура.Маркируемый КАК Маркируемый,
	                      |	_ДемоНоменклатура.КодВидаАлкогольнойПродукции КАК КодВидаАлкогольнойПродукции,
	                      |	_ДемоНоменклатура.КодАлкогольнойПродукции КАК КодАлкогольнойПродукции,
	                      |	_ДемоНоменклатура.ЕмкостьТары КАК ЕмкостьТары,
	                      |	_ДемоНоменклатура.Крепость КАК Крепость,
	                      |	_ДемоНоменклатура.ИННПроизводителя КАК ИННПроизводителя,
	                      |	_ДемоНоменклатура.КПППроизводителя КАК КПППроизводителя,  
	                      |	_ДемоНоменклатура.СтавкаНДС КАК СтавкаНДС,
	                      |	_ДемоНоменклатура.Весовой КАК Весовой,
	                      |	_ДемоНоменклатура.Ссылка КАК Номенклатура
	                      |ИЗ
	                      |	Справочник._ДемоНоменклатура КАК _ДемоНоменклатура
	                      |	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._ДемоШтрихкоды КАК _ДемоШтрихкоды
	                      |		ПО (_ДемоШтрихкоды.Владелец = _ДемоНоменклатура.Ссылка),
	                      |	(ВЫБРАТЬ ПЕРВЫЕ 1
	                      |		ШтрихкодУпаковки.Владелец КАК Владелец,
	                      |		ШтрихкодУпаковки.Штрихкод КАК Штрихкод
	                      |	ИЗ
	                      |		РегистрСведений._ДемоШтрихкоды КАК ШтрихкодУпаковки
	                      |	ГДЕ
	                      |		ШтрихкодУпаковки.ИспользоватьДляУпаковки = ЛОЖЬ) КАК Упаковки
	                      |ГДЕ
	                      |	_ДемоНоменклатура.ЭтоГруппа = ЛОЖЬ И 
	                      |	_ДемоШтрихкоды.ИспользоватьДляУпаковки = ЛОЖЬ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	_ДемоШтрихкоды.Штрихкод");
	  
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаВыгрузки.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);     
		НоваяСтрока.НДС = _ДемоПодключаемоеОборудованиеВызовСервера.ВернутьСтавкуНДС(Выборка.СтавкаНДС);
		
		НоваяСтрока.УникальныйИдентификатор = Выборка.Номенклатура.УникальныйИдентификатор();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуВыполнить(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаВыгрузки.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ВыбранныеСтроки = ТаблицаВыгрузки.НайтиСтроки(Новый Структура("SKU", ТекущиеДанные.SKU));
		Для каждого СтрокаТаблицы Из ВыбранныеСтроки Цикл
			ТаблицаВыгрузки.Удалить(СтрокаТаблицы)
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
