
&НаСервере
Процедура ПросмотретьОтчетНаСервере()
	Объект.ТЧ.Очистить();
	ОбщаяКасса=0;
	СуммаДесертов=0;
	СуммаХлеба=0;
	СуммаДизеля=0;
	СуммаРасходов=0;
	СуммаПеребора=0;
	СуммаПроцентов=0;
	КассаКухня=0;
	КассаБар=0;
	СуммаЗП=0;
	Терминал=0;
	РасходыБезТерминала=0;
	Отчет = Документы.ДневнойОтчет.Выбрать(Объект.ДатаНачало,Объект.ДатаКонец+86400);

	Пока Отчет.Следующий() Цикл
			Терминал=0;
			РасходыБезТерминала=0;

		ТекущийОтчет = Отчет.ПолучитьОбъект();
		Если ТекущийОтчет.Заведение = Объект.Заведение Тогда
			//Сообщить("Отчет за " + Строка(ТекущийОтчет.ДатаСмены));
			ВозвратСредиНедели = 0;
			Стирка=0;
			Для Каждого Выборка Из ТекущийОтчет.ОсновнаяИнформация Цикл 
				Если Выборка.Статья.Наименование="Стирка" Тогда
					Стирка=Выборка.Сумма;
				КонецЕсли;
				Если Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.ОбщаяКасса Тогда
					ОбщаяКасса=Выборка.Сумма;
				
				ИначеЕсли Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.Десерты Тогда
					СуммаДесертов=Выборка.Сумма;	
				
				ИначеЕсли Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.Хлеб Тогда
					СуммаХлеба=Выборка.Сумма;	
				ИначеЕсли Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.Анжела Тогда
					ВозвратСредиНедели=Выборка.Сумма;	
				ИначеЕсли Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.ОставленоНаЗакупку Тогда
					ОставленоНаЗакупку=Выборка.Сумма;	
				
				КонецЕсли;
				//
				Если Число(Выборка.Статья.Код) = 6 Тогда
					КассаКухня=Выборка.Сумма;
				КонецЕсли;
				
				Если Число(Выборка.Статья.Код) = 7 Тогда
					КассаБар=Выборка.Сумма;
				КонецЕсли;

			КонецЦикла;
			ТекРасходы = 0;
			Для Каждого Выборка Из ТекущийОтчет.Расходы Цикл
				Если Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.Терминал ИЛИ Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.Карта Тогда
					Терминал=Терминал+Выборка.Сумма;	
				ИНАЧЕ
					РасходыБезТерминала=РасходыБезТерминала+Выборка.Сумма;
				КонецЕслИ;
				ТекРасходы = ТекРасходы + Выборка.Сумма; 
				СуммаРасходов=СуммаРасходов+Выборка.Сумма;
								
			КонецЦикла;
			
			СуммаЗП=0;
			Для Каждого Выборка Из ТекущийОтчет.Зарплаты Цикл 
				СуммаЗП = СуммаЗП + Выборка.Сумма;	
			КонецЦикла;

			СуммаЗакупкиКухни = 0;  
			СуммаУголь=0;
			Для Каждого ПН Из ТекущийОтчет.Накладные Цикл
				Если ПН.Поставщик.Наименование="Уголь" Тогда
					СуммаУголь=СуммаУголь+ПН.Сумма;
				КонецЕсли;
				
				Если ПН.Поставщик.Склад =Перечисления.Склады.Кухня Тогда
					СуммаЗакупкиКухни = СуммаЗакупкиКухни + ПН.Сумма;	
				КонецЕсли;
			КонецЦикла;

			
			
			СуммаЗакупкиБар = 0;
			Для Каждого ПН Из ТекущийОтчет.Накладные Цикл
				Если ПН.Поставщик.Склад =Перечисления.Склады.Бар Тогда
					СуммаЗакупкиБар = СуммаЗакупкиБар + ПН.Сумма;	
				КонецЕсли;
			КонецЦикла;
			
			СуммаХозки = 0;
			Для Каждого ПН Из ТекущийОтчет.Накладные Цикл
				Если ПН.Поставщик.Склад =Перечисления.Склады.Хозтовары Тогда
					СуммаХозки = СуммаХозки + ПН.Сумма;	
				КонецЕсли;
			КонецЦикла;
			
			СуммаХозки=СуммаХозки - СуммаУголь;
			
			Запись = Объект.ТЧ.Добавить();
			Запись.ДатаОтчета = ТекущийОтчет.ДатаСмены;
			Запись.СуммаКассы = ОбщаяКасса;
			Запись.СуммаХлеб = СуммаХлеба;
			Запись.СуммаДесерты = СуммаДесертов;
			Запись.СуммаРасхода = ТекРасходы;
			Запись.КассаКухня = КассаКухня;
			Запись.КассаБар = КассаБар;
			Запись.ЗП = СуммаЗП;
			Запись.Кухня = СуммаЗакупкиКухни;
			Запись.Бар = СуммаЗакупкиБар;
			Запись.Хозка = СуммаХозки;
			Запись.Уголь = СуммаУголь;
			Запись.Стирка=Стирка;
			Запись.Терминал=Терминал;
			Запись.РасходБезТерм=РасходыБезТерминала;


			Если Объект.Заведение = Перечисления.Заведение.Торговая Тогда
				Запись.Процент = (ОбщаяКасса-СуммаХлеба-СуммаДесертов)*0.2;
			Иначе
				Запись.Процент = (ОбщаяКасса-СуммаХлеба-СуммаДесертов)*0.2;
			КонецЕсли;
			Запись.Перебор = -(Запись.Процент-ТекРасходы); 
			Если ДеньНедели(ТекущийОтчет.ДатаСмены)>4 Тогда
				Запись.ВозвратСредиНедели = ВозвратСредиНедели;
			КонецЕсли;
			
			
			Если ДеньНедели(ТекущийОтчет.ДатаСмены)=7 Тогда
				СуммДолгаЗакупщика = 0;
				//закупщик
				Для Каждого Строка Из ТекущийОтчет.ЗадолжнотиЗакупщика Цикл
					Если Строка.Неоплачено > 0 Тогда
						СуммДолгаЗакупщика = СуммДолгаЗакупщика + Строка.Неоплачено;	
					КонецЕсли;
				КонецЦикла;
				//долги
				СуммаНеоплаченыхПН = 0;
				Для Каждого Строка Из ТекущийОтчет.ДолговыеНакладные Цикл
					Если Строка.Оплачен = Ложь И Строка.Ошибка = Ложь Тогда
						СуммаНеоплаченыхПН = СуммаНеоплаченыхПН + Строка.Сумма;	
					КонецЕсли;
				КонецЦикла;
				//
				//Для Каждого Строка Из ТекущийОтчет.Накладные Цикл
				//	Если Строка.Оплачено = Ложь И Строка.Закупщик = Ложь Тогда
				//		СуммаНеоплаченыхПН = СуммаНеоплаченыхПН + Строка.СуммаПН;	
				//	КонецЕсли;
				//КонецЦикла;
				Объект.СуммаДолгаЗакупщику = СуммДолгаЗакупщика;
				Объект.СуммаНезакрытыхПН = СуммаНеоплаченыхПН; 
				Объект.ОставленоНаЗакупку = ОставленоНаЗакупку;
				//оставелно
					
			КонецЕсли;	
			
			
						
						
		КонецЕсли;
	КонецЦикла;
	
	СуммаЗакупкиПонедельника = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДневнойОтчетНакладные.Ссылка.ДатаСмены КАК ДатаСмены,
		|	ДневнойОтчетНакладные.Ссылка.Заведение КАК Заведение,
		|	ДневнойОтчетНакладные.Поставщик КАК Поставщик,
		|	ДневнойОтчетНакладные.Сумма КАК СуммаПН
		|ИЗ
		|	Документ.ДневнойОтчет.Накладные КАК ДневнойОтчетНакладные
		|ГДЕ
		|	ДневнойОтчетНакладные.Ссылка.ДатаСмены = &ДатаСмены
		|	И ДневнойОтчетНакладные.Ссылка.Заведение = &Заведение";
	
	Запрос.УстановитьПараметр("ДатаСмены", НачалоДня(Объект.ДатаКонец));
	Запрос.УстановитьПараметр("Заведение", Объект.Заведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Поставщик.Склад = Перечисления.Склады.Кухня Тогда
			СуммаЗакупкиПонедельника = СуммаЗакупкиПонедельника + Выборка.СуммаПН;	
		КонецЕсли;
		
	КонецЦикла;
		
	//	
	//СуммаПроцентов=(ОбщаяКасса-СуммаХлеба-СуммаДесертов)*0.2;
	//СуммаПеребора=СуммаПроцентов-(СуммаРасходов+СуммаДизеля);
	Объект.СуммаПеребора = Объект.ТЧ.Итог("Перебор") - Объект.ТЧ.Итог("ВозвратСредиНедели");
	Сообщить(Строка(Объект.Заведение) + " - " + Строка(Объект.СуммаПеребора));
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьОтчет(Команда)
	ПросмотретьОтчетНаСервере();
КонецПроцедуры
