
Функция ПоддержкаАсинхронногоРежима() Экспорт
	
	Возврат Ложь;
	
КонецФункции

Функция ПодключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	Результат = Истина;		
	НовыйСтандарт = Ложь;
	
	ВыходныеПараметры = Новый Массив();
	ПараметрыПодключения.Вставить("ИДУстройства", "");
	
	SecureConnection = Неопределено;
	Host = Неопределено;
	Port = Неопределено;
	Device = Неопределено;
	CorrespondenceTable = Неопределено;
	
	Параметры.Свойство("P_SecureConnection", SecureConnection);
	Параметры.Свойство("P_Host", Host);
	Параметры.Свойство("P_Port", Port);
	Параметры.Свойство("P_Device", Device);
	Параметры.Свойство("P_CorrespondenceTable", CorrespondenceTable);
	
	Если SecureConnection = Неопределено Или Host = Неопределено Или Port = Неопределено Или Device = Неопределено Тогда
		Результат = Ложь;
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Не настроєні параметри пристрою.
		|Для коректної роботи пристрою необхідно задати параметри його роботи.
		|Зробити це можна за допомогою форми ""Настройка параметрів"" моделі
		|обладнання для підключення в формі ""Підключення та настройка обладнання"".");
	ИначеЕсли CorrespondenceTable = Неопределено Тогда
		Результат = Ложь;
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Не заповнені параметри торгового устаткування (параметри оподаткування).");
	КонецЕсли;
	
	Если Результат Тогда
		ТипОборудованияИспользуемый = "";
		
		Если ПараметрыПодключения.Свойство("ТипОборудования") Тогда
			ТипОборудованияИспользуемый = ПараметрыПодключения.ТипОборудования;
			Попытка
				ОбъектДрайвера.УстановитьПараметр("EquipmentType", ТипОборудованияИспользуемый); 
			Исключение
				Результат = Ложь;
				ВыходныеПараметры.Добавить(999);
				ВыходныеПараметры.Добавить("Помилка звернення до драйвера.");
				Возврат Результат;
			КонецПопытки;
		КонецЕсли;
		
		НаименованиеДрайвера = "";
		ОписаниеДрайвера = "";
		ТипОборудования = "";
		ИнтеграционныйКомпонент = Ложь;
		ОсновнойДрайверУстановлен = Ложь;
		РевизияИнтерфейса = РевизияИнтерфейсаДрайверов();
		URLЗагрузкиДрайвера = "";
		ПараметрыДрайвера = "";
		ДополнительныеДействия = "";
		
		Попытка
			РевизияИнтерфейса = ОбъектДрайвера.ПолучитьРевизиюИнтерфейса();
			НовыйСтандарт = Истина;
			ОписаниеДрайвера = "";
			ОбъектДрайвера.ПолучитьОписание(ОписаниеДрайвера);
			
			ОписаниеДрайвераПараметры = ПолучитьОписаниеДрайвераXMLПакета(ОписаниеДрайвера);
			НаименованиеДрайвера = ОписаниеДрайвераПараметры.НаименованиеДрайвера;
			ОписаниеДрайвера = ОписаниеДрайвераПараметры.ОписаниеДрайвера;
			ТипОборудования = ОписаниеДрайвераПараметры.ТипОборудования;
			ИнтеграционныйКомпонент = ОписаниеДрайвераПараметры.ИнтеграционныйКомпонент;
			ОсновнойДрайверУстановлен = ОписаниеДрайвераПараметры.ОсновнойДрайверУстановлен;
			URLЗагрузкиДрайвера = ОписаниеДрайвераПараметры.URLЗагрузкиДрайвера;
		Исключение
			НовыйСтандарт = Ложь;
		КонецПопытки;
		
		Если Не НовыйСтандарт Тогда
			Попытка
				ОбъектДрайвера.ПолучитьОписание(НаименованиеДрайвера, ОписаниеДрайвера, ТипОборудования, РевизияИнтерфейса, ИнтеграционныйКомпонент, ОсновнойДрайверУстановлен, URLЗагрузкиДрайвера);
			Исключение
				Результат = Ложь;
				ВыходныеПараметры.Очистить();
				ВыходныеПараметры.Добавить(999);
				ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.ПолучитьОписание>." + Символы.ПС + ОписаниеОшибки());
				Возврат Результат;
			КонецПопытки;
		КонецЕсли;
		
		ПараметрыПодключения.Вставить("РевизияИнтерфейса", РевизияИнтерфейса);
		
		Для Каждого Параметр Из Параметры Цикл
			Если Лев(Параметр.Ключ, 2) = "P_" Тогда
				ЗначениеПараметра = Параметр.Значение;
				ИмяПараметра = Сред(Параметр.Ключ, 3);
				ОбъектДрайвера.УстановитьПараметр(ИмяПараметра, ЗначениеПараметра); 
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			Ответ = ОбъектДрайвера.Подключить(ПараметрыПодключения.ИДУстройства);
		Исключение
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.Подключить>." + Символы.ПС + ОписаниеОшибки());
			Возврат Результат;
		КонецПопытки;
		
		Если Не Ответ Тогда
			Результат = Ложь;
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("");
			ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
		Иначе
			
			ВремВыходныеПараметры = Новый Массив();
			Если ПолучитьШиринуСтроки(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВремВыходныеПараметры) Тогда
				ВремШиринаСтроки = ВремВыходныеПараметры[0];
				ШиринаСтроки = ?(ВремШиринаСтроки <> Неопределено И ВремШиринаСтроки > 0, ВремШиринаСтроки, 32);
			КонецЕсли;
			ПараметрыПодключения.Вставить("ШиринаСтроки", ШиринаСтроки);
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОтключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
	
	ВыходныеПараметры = Новый Массив();
	
	ОбъектДрайвера.Отключить(ПараметрыПодключения.ИДУстройства);
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьКоманду(Команда, ВходныеПараметры = Неопределено, ВыходныеПараметры = Неопределено, ОбъектДрайвера, Параметры, ПараметрыПодключения) Экспорт
	
	Результат = Истина;	
	
	ВыходныеПараметры = Новый Массив();
	
	Если Не Параметры = Неопределено Тогда
		Для Каждого Параметр Из Параметры Цикл
			Если Лев(Параметр.Ключ, 2) = "P_" Тогда
				ЗначениеПараметра = Параметр.Значение;
				ИмяПараметра = Сред(Параметр.Ключ, 3);
				Ответ = ОбъектДрайвера.УстановитьПараметр(ИмяПараметра, ЗначениеПараметра); 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Команда = "ТестУстройства" Или Команда = "CheckHealth" Тогда
		Результат = ТестУстройства(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "ВыполнитьДополнительноеДействие" Или Команда = "DoAdditionalAction" Тогда
		ИмяДействия = ВходныеПараметры[0];
		Результат = ВыполнитьДополнительноеДействие(ОбъектДрайвера, Параметры, ПараметрыПодключения, ИмяДействия, ВыходныеПараметры);
		
	ИначеЕсли Команда = "ПолучитьВерсиюДрайвера" Или Команда = "GetVersion" Тогда
		Результат = ПолучитьВерсиюДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "ПолучитьОписаниеДрайвера" Или Команда = "GetDescription" Тогда
		Результат = ПолучитьОписаниеДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
		
	ИначеЕсли Команда = "OpenCashDrawer" Или Команда = "ОткрытьДенежныйЯщик" Тогда
		Результат = ОткрытьДенежныйЯщик(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "GetLineLength" Или Команда = "ПолучитьШиринуСтроки" Тогда
		Результат = ПолучитьШиринуСтроки(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "OpenShift" Или Команда = "OpenDay" Или Команда = "ОткрытьСмену" Тогда	
		Результат = ОткрытьСмену(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры);
		
	ИначеЕсли Команда = "CloseShift" Или Команда = "PrintZReport" Или Команда = "ЗакрытьСмену" Тогда	
		Результат = ЗакрытьСмену(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры);
		
	ИначеЕсли Команда = "ReportCurrentStatusOfSettlements" Или Команда = "ОтчетОТекущемСостоянииРасчетов" Тогда
		Результат = ОтчетОТекущемСостоянииРасчетов(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры);
		
	ИначеЕсли Команда = "PrintXReport" Или Команда = "НапечататьОтчетБезГашения" Тогда
		Результат = ОтчетБезГашения(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры);
		
	ИначеЕсли Команда = "Encash" Или Команда = "Инкассация" Тогда
		Результат = Инкассация(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры);
		
	ИначеЕсли Команда = "PrintReceipt" Или Команда = "CheckFiscalization" Или Команда = "ПечатьЧека" Или Команда = "ФискализацияЧека" Тогда
		Результат = ФискализацияЧека(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры);
		
	ИначеЕсли Команда = "PrintText" Или Команда = "ПечатьТекста" Тогда
		СтрокаТекста = ВходныеПараметры[0];
		Результат = ПечатьТекста(ОбъектДрайвера, Параметры, ПараметрыПодключения, СтрокаТекста, ВыходныеПараметры);
		
	ИначеЕсли Команда = "PrintTextDocument" Или Команда = "ПечатьТекстовогоДокумента" Тогда
		Результат = НачатьПечатьТекстовыхДокументов(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры);
		
	ИначеЕсли Команда = "OpenCheck" Или Команда = "ОткрытьЧек" Тогда
		ЧекВозврата = ВходныеПараметры[0];
		ФискальныйЧек = ВходныеПараметры[1];
		Результат = ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ЧекВозврата, ФискальныйЧек, ВыходныеПараметры);
		
	ИначеЕсли Команда = "CancelCheck" Или Команда = "ОтменитьЧек" Тогда
		Результат = ОтменитьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "StornoCheck" Или Команда = "СторнироватьЧек" Тогда
		Результат = СторнироватьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);		
		
	ИначеЕсли Команда = "AnnulCheck" Или Команда = "АннулироватьЧек" Тогда
		ТипЧека = ВходныеПараметры[0];
		ФискальныйЧек = ВходныеПараметры[1];
		Результат = АннулироватьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТипЧека, ФискальныйЧек, ВыходныеПараметры);
		
	ИначеЕсли Команда = "ОтобразитьЧек" Тогда
	   	ФискальныйЧек = ВходныеПараметры[0];
		Результат = ОтобразитьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ФискальныйЧек, ВыходныеПараметры);
		
	ИначеЕсли Команда = "PrintPReportDate" Или Команда = "НапечататьПериодическийОтчетПоДатам" Тогда
		Результат = НапечататьПериодическийОтчетПоДатам(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры);
		
	ИначеЕсли Команда = "PrintPReportNumber" Или Команда = "НапечататьПериодическийОтчетПоНомерам" Тогда
		Результат = НапечататьПериодическийОтчетПоНомерам(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры);
		
	ИначеЕсли Команда = "PrintNullReceipt" Или Команда = "НапечататьНулевойЧек" Тогда
		Результат = НапечататьНулевойЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "PrintSoldReport" Или Команда = "НапечататьОтчетОПроданныхТоварах" Тогда
		Результат = НапечататьОтчетОПроданныхТоварах(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);		
		
		
	Иначе
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Команда ""%Команда%"" не підтримується цим драйвером.");
		ВыходныеПараметры[1] = СтрЗаменить(ВыходныеПараметры[1], "%Команда%", Команда);
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РазмерПакетаПоУмолчанию() Экспорт
	
	РазмерПакета = 200;
	Возврат РазмерПакета;
	
КонецФункции

Функция ОткрытьДенежныйЯщик(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;
	
	Попытка
		Ответ = ОбъектДрайвера.ОткрытьДенежныйЯщик(ПараметрыПодключения.ИДУстройства);
		Если Не Ответ Тогда
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("");
			ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
		КонецЕсли;
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.ОткрытьДенежныйЯщик>." + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьШиринуСтроки(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
	ШиринаСтроки = 0;
	
	Попытка
		Ответ = ОбъектДрайвера.ПолучитьШиринуСтроки(ПараметрыПодключения.ИДУстройства, ШиринаСтроки);
		Если Не Ответ Тогда
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("");
			ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
		Иначе
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(ШиринаСтроки);
		КонецЕсли;
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.ПолучитьШиринуСтроки>." + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ОткрытьСмену(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры)
	
	Результат = Истина;
	Кассир = ?(ВходныеПараметры <> Неопределено И ВходныеПараметры.Свойство("Кассир"), ВходныеПараметры.Кассир, "Адміністратор");
	НомерСмены = 0;
	НомерДокумента = 0;
	ФискальныеДанныеСтруктура = Неопределено;
	ПараметрыСостояния = "";
	
	Попытка
		Результат = ОбъектДрайвера.ОткрытьСмену(ПараметрыПодключения.ИДУстройства);
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.ОткрытьСмену>." + Символы.ПС + ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;
	
	Если Результат Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(НомерСмены);
		ВыходныеПараметры.Добавить(НомерДокумента);
		ВыходныеПараметры.Добавить(2);
		ВыходныеПараметры.Добавить(ДатаСеанса());
		ВыходныеПараметры.Добавить(ФискальныеДанныеСтруктура);
		ВыходныеПараметры.Добавить(ПараметрыСостояния);
	Иначе
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗакрытьСмену(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры)
	
	Результат = Истина;
	РезультатСостояние = Ложь;
	Кассир = ?(ВходныеПараметры <> Неопределено И ВходныеПараметры.Свойство("Кассир"), ВходныеПараметры.Кассир, "Адміністратор");
	НомерСмены = 0;
	НомерДокумента = 0;
	СтатусСмены = 0;
	ФискальныеДанныеСтруктура = Неопределено;
	ПараметрыСостояния = "";
	
	Попытка
		Результат = ОбъектДрайвера.НапечататьОтчетСГашением(ПараметрыПодключения.ИДУстройства);
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.НапечататьОтчетСГашением>." + Символы.ПС + ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;
	
	Если Результат Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(НомерСмены);
		ВыходныеПараметры.Добавить(НомерДокумента);
		ВыходныеПараметры.Добавить(1);
		ВыходныеПараметры.Добавить(ДатаСеанса());
		ВыходныеПараметры.Добавить(ФискальныеДанныеСтруктура);
		ВыходныеПараметры.Добавить(ПараметрыСостояния);
	Иначе
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОтчетОТекущемСостоянииРасчетов(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры)
	
	Результат = Истина;
	НомерСмены = 0;
	НомерДокумента = 0;
	ФискальныеДанныеСтруктура = Неопределено;
	ПараметрыСостояния = "";
	
	Попытка
		Результат = ОбъектДрайвера.НапечататьОтчетБезГашения(ПараметрыПодключения.ИДУстройства);
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.НапечататьОтчетБезГашения>." + Символы.ПС + ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;
	
	Если Результат Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(НомерСмены);
		ВыходныеПараметры.Добавить(НомерДокумента);
		ВыходныеПараметры.Добавить(2);
		ВыходныеПараметры.Добавить(ДатаСеанса());
		ВыходныеПараметры.Добавить(ФискальныеДанныеСтруктура);
		ВыходныеПараметры.Добавить(ПараметрыСостояния);
	Иначе
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОтчетБезГашения(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры)
	
	Результат = Истина;
	НомерСмены = 0;
	НомерДокумента = 0;
	
	Попытка
		Результат = ОбъектДрайвера.НапечататьОтчетБезГашения(ПараметрыПодключения.ИДУстройства);
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.НапечататьОтчетБезГашения>." + Символы.ПС + ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;
	
	Если Результат Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(НомерСмены);
		ВыходныеПараметры.Добавить(НомерДокумента);
		ВыходныеПараметры.Добавить(2);
		ВыходныеПараметры.Добавить(ДатаСеанса());
	Иначе
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

Функция Инкассация(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры)
	
	Результат = Истина;
	НомерСмены = 0;
	НомерДокумента = 0;
	Если ТипЗнч(ВходныеПараметры) = Тип("Массив") Тогда
		ТипИнкассации = ВходныеПараметры[0];
		Сумма = ВходныеПараметры[1];
	Иначе
		ТипИнкассации = ?(ВходныеПараметры.Свойство("ТипИнкассации"), ВходныеПараметры.ТипИнкассации, 0);
		Сумма = ?(ВходныеПараметры.Свойство("Сумма"), ВходныеПараметры.Сумма, 0); 
	КонецЕсли;
	
	Попытка
		Результат = ОбъектДрайвера.НапечататьЧекВнесенияВыемки(ПараметрыПодключения.ИДУстройства, ?(ТипИнкассации = 1, Сумма, -Сумма));	
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.НапечататьЧекВнесенияВыемки>." + Символы.ПС + ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;
	
	Если Результат Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(НомерСмены);
		ВыходныеПараметры.Добавить(НомерДокумента);
		ВыходныеПараметры.Добавить(2);
		ВыходныеПараметры.Добавить(ДатаСеанса());
	Иначе
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ФискализацияЧека(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры)

	ИДКонфигурации = ПодключаемоеОборудованиеВчасноКасаВызовСервера.ИДКонфигурации();
	
	ДатаСеанса = ДатаСеанса();
	
	Если ИДКонфигурации = "BASSB" Или ИДКонфигурации = "УНФ" Тогда
		
		Возврат ПечатьЧекаПоШаблону(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры);
		
	Иначе
		
		ШаблонЧека = СформироватьШаблонЧека(ВходныеПараметры);
		Возврат ПечатьЧекаПоШаблону(ОбъектДрайвера, Параметры, ПараметрыПодключения, ШаблонЧека, ВыходныеПараметры);
		
	КонецЕсли;
	
КонецФункции

Функция НачатьПечатьТекстовыхДокументов(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
	СтрокаТекста = "";
	
	ВыходныеПараметры.Очистить();
	ВыходныеПараметры.Добавить(999);
	ВыходныеПараметры.Добавить("Даний тип обладнання не підтримує дану команду.");
	Результат = Ложь;
	
	Возврат Результат;
	
КонецФункции

Функция ПечатьТекста(ОбъектДрайвера, Параметры, ПараметрыПодключения, СтрокаТекста, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
	
	Результат = ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, Ложь, Ложь, ВыходныеПараметры);
	Если Результат Тогда
		Для НомерСтроки = 1 По СтрЧислоСтрок(СтрокаТекста) Цикл
			ВыделеннаяСтрока = СтрПолучитьСтроку(СтрокаТекста, НомерСтроки);
			Если (Найти(ВыделеннаяСтрока, "[отрезка]") > 0) Или (Найти(ВыделеннаяСтрока, "[cut]") > 0) Тогда
				ТаблицаОплат = Новый Массив();
				Результат = ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплат, ВыходныеПараметры);
				Результат = ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, Ложь, Ложь, ВыходныеПараметры);
			Иначе
				Если (Найти(ВыделеннаяСтрока, "|ШтрихКод|") > 0) Тогда
					ВыделеннаяСтрока = Сред(ВыделеннаяСтрока, СтрДлина("|ШтрихКод|") + 1);
					ВремТипШтрихкода = Сред(ВыделеннаяСтрока, 1, Найти(ВыделеннаяСтрока, "|") - 1);
					ВремШтрихКод = Сред(ВыделеннаяСтрока, Найти(ВыделеннаяСтрока, "|") + 1); 
					ВремВыходныеПараметры = Новый Массив();
					Если Не ПечатьШтрихкода(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВремТипШтрихкода, ВремШтрихКод, ВремВыходныеПараметры) Тогда
						Текст = "<Штрихкод %ТипШтрихКода% не роздрукований>";
						Текст = СтрЗаменить(Текст, "%ТипШтрихКода%", ВремТипШтрихкода);
						Если Не НапечататьНефискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения, Текст, ВремВыходныеПараметры) Тогда
							Прервать;
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли Не НапечататьНефискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыделеннаяСтрока, ВыходныеПараметры) Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Результат Тогда
		ТаблицаОплат = Новый Массив();
		Результат = ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплат, ВыходныеПараметры);
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

Функция НапечататьПериодическийОтчетПоДатам(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры)
	
	Результат = Истина;
	
	Попытка
		Результат = ОбъектДрайвера.НапечататьПериодическийОтчетПоДатам(ПараметрыПодключения.ИДУстройства, ВходныеПараметры[0], ВходныеПараметры[1], Ложь);
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.НапечататьПериодическийОтчетПоДатам>." + Символы.ПС + ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;
	
	Если Результат Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(1);
		ВыходныеПараметры.Добавить(1);
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(ДатаСеанса());
	Иначе
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НапечататьПериодическийОтчетПоНомерам(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры)
	
	Результат = Истина;
		
	Попытка
		Результат = ОбъектДрайвера.НапечататьПериодическийОтчетПоНомерам(ПараметрыПодключения.ИДУстройства, ВходныеПараметры[0], ВходныеПараметры[1], Ложь);
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.НапечататьПериодическийОтчетПоНомерам>." + Символы.ПС + ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;
	
	Если Результат Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(1);
		ВыходныеПараметры.Добавить(1);
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(ДатаСеанса());
	Иначе
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НапечататьНулевойЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	ТаблицаОплат = Новый Массив();
	
	Результат = Истина;
	Результат = ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, Ложь, Истина, ВыходныеПараметры);
	
	Если Результат Тогда
		ОшибкаПриПечатиСтроки = Ложь;
		
		Если Не ОшибкаПриПечатиСтроки Тогда
			Результат = ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплат, ВыходныеПараметры);	
		Иначе
			Результат = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НапечататьОтчетОПроданныхТоварах(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;
		
	Попытка
		Результат = ОбъектДрайвера.НапечататьОтчетОПроданныхТоварах(ПараметрыПодключения.ИДУстройства);
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.НапечататьПериодическийОтчетПоНомерам>." + Символы.ПС + ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;
	
	Если Результат Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(1);
		ВыходныеПараметры.Добавить(1);
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(ДатаСеанса());
	Иначе
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТипЧека, ФискальныйЧек, ВыходныеПараметры, НомерЧекаВозврата = Неопределено) Экспорт
	
	ИДКонфигурации = ПодключаемоеОборудованиеВчасноКасаВызовСервера.ИДКонфигурации();
	
	Если НомерЧекаВозврата = Неопределено Тогда
		НомерЧекаВозврата = ?(ИДКонфигурации = "BASSB" Или ИДКонфигурации = "УНФ", "", 0);
	КонецЕсли;
		
	Результат = Истина;
	НомерСмены = 0;
	НомерЧека = 0;
	
	Если ИДКонфигурации = "BASSB" Или ИДКонфигурации = "УНФ" Тогда
		НомерЧекаВозврата = "";
	Иначе
		НомерЧекаВозврата = 0;
	КонецЕсли;
	
	Попытка
		
		Ответ = ОбъектДрайвера.ОткрытьЧек(ПараметрыПодключения.ИДУстройства, ФискальныйЧек, ТипЧека, Истина, НомерЧека, НомерСмены);
		
		Если Не Ответ Тогда
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("");
			ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
		Иначе
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(НомерСмены);
			ВыходныеПараметры.Добавить(НомерЧека);
			ВыходныеПараметры.Добавить(2);
			ВыходныеПараметры.Добавить(ДатаСеанса());
			ВыходныеПараметры.Добавить("");
			ВыходныеПараметры.Добавить("");
			ВыходныеПараметры.Добавить("");
			ВыходныеПараметры.Добавить("");
		КонецЕсли;
	Исключение
		
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.ОткрытьЧек>." + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплат, ВыходныеПараметры, СуммаЧека = 0, НомерЧекаВозврата = Неопределено, ЧекККМ = Неопределено) Экспорт

	ИДКонфигурации = ПодключаемоеОборудованиеВчасноКасаВызовСервера.ИДКонфигурации();
	
	Если НомерЧекаВозврата = Неопределено Тогда
		НомерЧекаВозврата = ?(ИДКонфигурации = "BASSB" Или ИДКонфигурации = "УНФ", "", 0);
	КонецЕсли;
	
	Результат = Истина;
	
	СуммаНаличнойОплаты = 0;
	СуммаБезналичнойОплаты1 = 0;
	СуммаБезналичнойОплаты2 = 0;
	СуммаБезналичнойОплаты3 = 0;
	
	НомерСозданногоЧека = 0; 
	ФискальныйНомерСозданногоЧека = "";
	Для ИндексОплаты = 0 По ТаблицаОплат.Количество() - 1 Цикл
		Если ТаблицаОплат[ИндексОплаты][0].Значение = 0 Тогда
			СуммаНаличнойОплаты = СуммаНаличнойОплаты + ТаблицаОплат[ИндексОплаты][1].Значение;
		ИначеЕсли ТаблицаОплат[ИндексОплаты][0].Значение = 1 Тогда
			СуммаБезналичнойОплаты1 = СуммаБезналичнойОплаты1 + ТаблицаОплат[ИндексОплаты][1].Значение;
		ИначеЕсли ТаблицаОплат[ИндексОплаты][0].Значение = 2 Тогда
			СуммаБезналичнойОплаты2 = СуммаБезналичнойОплаты2 + ТаблицаОплат[ИндексОплаты][1].Значение;
		Иначе
			СуммаБезналичнойОплаты3 = СуммаБезналичнойОплаты3 + ТаблицаОплат[ИндексОплаты][1].Значение;
		КонецЕсли;
	КонецЦикла;
	
	Попытка		
		
		Ответ = ОбъектДрайвера.ЗакрытьЧек(ПараметрыПодключения.ИДУстройства, СуммаНаличнойОплаты, СуммаБезналичнойОплаты1, СуммаБезналичнойОплаты2, СуммаБезналичнойОплаты3, СуммаЧека, НомерЧекаВозврата, НомерСозданногоЧека, ФискальныйНомерСозданногоЧека);
		
		Если Не Ответ Тогда
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("");
			ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
			ОтменитьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
			
		Иначе 
			ВыходныеПараметры[1] = ФискальныйНомерСозданногоЧека;
			
		КонецЕсли;
		
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.ЗакрытьЧек>." + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ОтменитьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
	
	Попытка
		ОбъектДрайвера.ОтменитьЧек(ПараметрыПодключения.ИДУстройства);
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.ОтменитьЧек>." + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция СторнироватьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
	
	Попытка
		ОбъектДрайвера.СторнироватьЧек(ПараметрыПодключения.ИДУстройства);
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.СторнироватьЧек>." + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;   
	
КонецФункции

Функция НапечататьФискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения, Наименование, Количество, Цена, Сумма, НомерСекции, СтавкаНДС, ДопРеквизиты, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
	
	Попытка
		
		Ответ = ОбъектДрайвера.НапечататьФискСтроку(ПараметрыПодключения.ИДУстройства, Наименование, Количество, Цена, Сумма, НомерСекции, СтавкаНДС, ДопРеквизиты);
		
		Если Не Ответ Тогда
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("");
			ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
			ОтменитьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		КонецЕсли;
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.НапечататьФискСтроку>." + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция НапечататьНефискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения, СтрокаТекста, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
	
	Попытка
		Ответ = ОбъектДрайвера.НапечататьНефискСтроку(ПараметрыПодключения.ИДУстройства, СтрокаТекста);
		Если Не Ответ Тогда
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("");
			ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
			ОтменитьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		КонецЕсли;
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.НапечататьНефискСтроку>." + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;	
	
КонецФункции

Функция ПечатьШтрихкода(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТипШтрихКода, ШтрихКод, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
	
	Попытка
		Ответ = ОбъектДрайвера.НапечататьШтрихКод(ПараметрыПодключения.ИДУстройства, ТипШтрихКода, ШтрихКод);
		Если Не Ответ Тогда
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("");
			ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
		КонецЕсли;
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.НапечататьШтрихКод>." + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;	
	
КонецФункции

Функция АннулироватьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТипЧека, ФискальныйЧек, ВыходныеПараметры)
	
	Результат = Истина;	
	
	Результат = ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТипЧека, ФискальныйЧек, ВыходныеПараметры);
	Если Результат Тогда
		Результат = ОтменитьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

Функция ОтобразитьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ФискальныйЧек, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
	
	Попытка
		ОбъектДрайвера.ОтобразитьЧек(ПараметрыПодключения.ИДУстройства, ФискальныйЧек);
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.ОтобразитьЧек>." + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;   
	
КонецФункции

Функция ТестУстройства(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;
	РезультатТеста = "";
	АктивированДемоРежим = "";
	
	Попытка
		Ответ = ОбъектДрайвера.ТестУстройства(РезультатТеста, АктивированДемоРежим);
		
		Если Ответ Тогда
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(0);
		Иначе
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
		КонецЕсли;
		ВыходныеПараметры.Добавить(РезультатТеста);
		ВыходныеПараметры.Добавить(АктивированДемоРежим);
		
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.ТестУстройства>." + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьДополнительноеДействие(ОбъектДрайвера, Параметры, ПараметрыПодключения, ИмяДействия, ВыходныеПараметры)
	
	Результат = Истина;
	
	Попытка
		Ответ = ОбъектДрайвера.ВыполнитьДополнительноеДействие(ИмяДействия);
		Если Не Ответ Тогда
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("");
			ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
		Иначе
			ВыходныеПараметры.Очистить();
		КонецЕсли;
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("Помилка виклику методу <ОбъектДрайвера.ВыполнитьДополнительноеДействие>." + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьВерсиюДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;
	
	ВыходныеПараметры.Добавить("Встановлений");
	ВыходныеПараметры.Добавить("Не визначена");
	
	Попытка
		ВерсияДрайвера = ОбъектДрайвера.ПолучитьНомерВерсии();
	Исключение
		
		Попытка
			ОписаниеДрайвера = "";
			ОбъектДрайвера.ПолучитьОписание(ОписаниеДрайвера);
			ОписаниеДрайвераПараметры = ПолучитьОписаниеДрайвераXMLПакета(ОписаниеДрайвера);
			ВерсияДрайвера = ОписаниеДрайвераПараметры.ВерсияДрайвера;
		Исключение
			Результат = Истина;
		КонецПопытки;
	КонецПопытки;
	
	ВыходныеПараметры[1] = ВерсияДрайвера;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОписаниеДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;
	
	ВыходныеПараметры.Очистить();
	ВыходныеПараметры.Добавить("Встановлений");
	ВыходныеПараметры.Добавить("Не визначена");
	
	ВыходныеПараметры.Добавить("Не визначено");
	ВыходныеПараметры.Добавить("Не визначено");
	ВыходныеПараметры.Добавить("Не визначено");
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	
	НаименованиеДрайвера = "";
	ОписаниеДрайвера = "";
	ТипОборудования = "";
	ИнтеграционныйКомпонент = Ложь;
	ОсновнойДрайверУстановлен = Ложь;
	РевизияИнтерфейса = РевизияИнтерфейсаДрайверов();
	URLЗагрузкиДрайвера = "";
	ПараметрыДрайвера = "";
	ДополнительныеДействия = "";
	
	Если ПараметрыПодключения.Свойство("ТипОборудования") Тогда
		ТипОборудования = ПараметрыПодключения.ТипОборудования;
		ОбъектДрайвера.УстановитьПараметр("EquipmentType", ТипОборудования); 
	КонецЕсли;
	
	Попытка
		ВерсияДрайвера = ОбъектДрайвера.ПолучитьНомерВерсии();
		ОбъектДрайвера.ПолучитьОписание(НаименованиеДрайвера, ОписаниеДрайвера, ТипОборудования, РевизияИнтерфейса, ИнтеграционныйКомпонент, ОсновнойДрайверУстановлен, URLЗагрузкиДрайвера);
	Исключение
		Попытка
			ОписаниеДрайвера = "";
			ОбъектДрайвера.ПолучитьОписание(ОписаниеДрайвера);
			ОписаниеДрайвераПараметры = ПолучитьОписаниеДрайвераXMLПакета(ОписаниеДрайвера);
			ВерсияДрайвера = ОписаниеДрайвераПараметры.ВерсияДрайвера;
			НаименованиеДрайвера = ОписаниеДрайвераПараметры.НаименованиеДрайвера;
			ОписаниеДрайвера = ОписаниеДрайвераПараметры.ОписаниеДрайвера;
			ТипОборудования = ОписаниеДрайвераПараметры.ТипОборудования;
			ИнтеграционныйКомпонент = ОписаниеДрайвераПараметры.ИнтеграционныйКомпонент;
			ОсновнойДрайверУстановлен = ОписаниеДрайвераПараметры.ОсновнойДрайверУстановлен;
			URLЗагрузкиДрайвера = ОписаниеДрайвераПараметры.URLЗагрузкиДрайвера;
			РевизияИнтерфейса = ОбъектДрайвера.ПолучитьРевизиюИнтерфейса();
		Исключение
			ИсключениеРезультат = Ложь;
			Сообщить("Помилка отримання опису драйвера" + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
	КонецПопытки;
	
	Если Результат Тогда
		ВыходныеПараметры[1] = ВерсияДрайвера;
		ВыходныеПараметры[2] = НаименованиеДрайвера;
		ВыходныеПараметры[3] = ОписаниеДрайвера;
		ВыходныеПараметры[4] = ТипОборудования;
		ВыходныеПараметры[5] = РевизияИнтерфейса;
		ВыходныеПараметры[6] = ИнтеграционныйКомпонент;
		ВыходныеПараметры[7] = ОсновнойДрайверУстановлен;
		ВыходныеПараметры[8] = URLЗагрузкиДрайвера;
		
		ОбъектДрайвера.ПолучитьПараметры(ПараметрыДрайвера);
		ВыходныеПараметры[9] = ПараметрыДрайвера;
		ОбъектДрайвера.ПолучитьДополнительныеДействия(ДополнительныеДействия);
		ВыходныеПараметры[10] = ДополнительныеДействия;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьШаблонЧека(ВходныеПараметры, ДополнительныйТекст = Неопределено, ТипОборудования = "")
	
	ТаблицаНоменклатуры = ВходныеПараметры[0];
	ТаблицаОплат = ВходныеПараметры[1];
	ОбщиеПараметры = ВходныеПараметры[2];
	
	ТипыЧеков = Новый Соответствие();
	ТипыЧеков.Вставить(0, "ПРОДАЖА"); 
	ТипыЧеков.Вставить(1, "ВОЗВРАТ");
	ТипыЧеков.Вставить(2, "ВНЕСЕНИЕ"); 
	ТипыЧеков.Вставить(3, "ВЫЕМКА");
	ТипыЧеков.Вставить(4, "ОТЧЕТ БЕЗ ГАШЕНИЯ");
	ТипыЧеков.Вставить(5, "ОТЧЕТ С ГАШЕНИЕМ");
	
	ПараметрыЧека = Новый Структура();
	ПараметрыЧека.Вставить("ТипЧека", ТипыЧеков.Получить(ОбщиеПараметры[0])); 
	ПараметрыЧека.Вставить("ФискальныйЧек", ОбщиеПараметры[1]);
	ПараметрыЧека.Вставить("СуммаДокумента", ОбщиеПараметры[3]);
	ПараметрыЧека.Вставить("ТекстШапки", ?(ОбщиеПараметры.Количество() > 7, ВРег(ОбщиеПараметры[6]), ""));
	ПараметрыЧека.Вставить("ТекстПодвала", ?(ОбщиеПараметры.Количество() > 8, ВРег(ОбщиеПараметры[7]), ""));
	ПараметрыЧека.Вставить("НомерЧека", ?(ОбщиеПараметры.Количество() > 10, ОбщиеПараметры[9], ""));
	ПараметрыЧека.Вставить("НомерКассы", ?(ОбщиеПараметры.Количество() > 11, ОбщиеПараметры[10], ""));
	ПараметрыЧека.Вставить("ДатаВремя", ?(ОбщиеПараметры.Количество() > 12, ВРег(ОбщиеПараметры[11]), ""));
	ПараметрыЧека.Вставить("ИмяКассира", ?(ОбщиеПараметры.Количество() > 13, ВРег(ОбщиеПараметры[12]), ""));
	ПараметрыЧека.Вставить("ОрганизацияНазвание", ?(ОбщиеПараметры.Количество() > 14, ВРег(ОбщиеПараметры[13]), ""));
	ПараметрыЧека.Вставить("ОрганизацияИНН", ?(ОбщиеПараметры.Количество() > 15, ОбщиеПараметры[14], ""));
	ПараметрыЧека.Вставить("ДокументОснование", ?(ОбщиеПараметры.Количество() > 17, ОбщиеПараметры[17], ""));
	ПараметрыЧека.Вставить("НомерЧекаВозврата", ?(ОбщиеПараметры.Количество() > 18, ОбщиеПараметры[18], ""));
	
	ТаблицаДопРеквизитов = Новый Массив;
	ТаблицаДопРеквизитов.Добавить(Новый Массив);
	
	Если ТаблицаНоменклатуры <> Неопределено Тогда
		ПозицииЧека = Новый Массив();
		Для ИндексМассива = 0 По ТаблицаНоменклатуры.Количество() - 1 Цикл
			СтрокаПозицииЧека = Новый Структура();
			СтрокаПозицииЧека.Вставить("ФискальнаяСтрока");
			СтрокаПозицииЧека.Вставить("Наименование", ТаблицаНоменклатуры[ИндексМассива][0].Значение);
			СтрокаПозицииЧека.Вставить("Количество", ТаблицаНоменклатуры[ИндексМассива][5].Значение);
			СтрокаПозицииЧека.Вставить("Цена", ТаблицаНоменклатуры[ИндексМассива][4].Значение);
			СтрокаПозицииЧека.Вставить("СуммаСкидок", ТаблицаНоменклатуры[ИндексМассива][7].Значение);
			СтрокаПозицииЧека.Вставить("ПроцентСкидок", ТаблицаНоменклатуры[ИндексМассива][8].Значение);
			СтрокаПозицииЧека.Вставить("Сумма", ТаблицаНоменклатуры[ИндексМассива][9].Значение);
			СтрокаПозицииЧека.Вставить("НомерСекции", ТаблицаНоменклатуры[ИндексМассива][3].Значение);
			СтрокаПозицииЧека.Вставить("СуммаНДС", ТаблицаНоменклатуры[ИндексМассива][11].Значение);
			СтрокаПозицииЧека.Вставить("СтавкаНДС", ТаблицаНоменклатуры[ИндексМассива][12].Значение);
			СтрокаПозицииЧека.Вставить("СтавкаНДССтрокой", ТаблицаНоменклатуры[ИндексМассива][17].Значение);
			СтрокаПозицииЧека.Вставить("ЭтоПодакцизныйТовар", ТаблицаНоменклатуры[ИндексМассива][18].Значение);
			СтрокаПозицииЧека.Вставить("КодПоУКТВЭД", ТаблицаНоменклатуры[ИндексМассива][19].Значение);
			СтрокаПозицииЧека.Вставить("Артикул", ТаблицаНоменклатуры[ИндексМассива][20].Значение);
			СтрокаПозицииЧека.Вставить("Штрихкод", ТаблицаНоменклатуры[ИндексМассива][1].Значение);
			СтрокаПозицииЧека.Вставить("ШтрихкодыАкцизныхМарок", ТаблицаНоменклатуры[ИндексМассива][21].Значение);
			СтрокаПозицииЧека.Вставить("ЕдиницаИзмерения", ТаблицаНоменклатуры[ИндексМассива][22].Значение);
			СтрокаПозицииЧека.Вставить("ЦенаВключаетНДС", ТаблицаНоменклатуры[ИндексМассива][23].Значение);
			ПозицииЧека.Добавить(СтрокаПозицииЧека);
		КонецЦикла;
	Иначе
		ПозицииЧека = Неопределено;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ДополнительныйТекст) Тогда
		Если ПозицииЧека = Неопределено Тогда
			ПозицииЧека = Новый Массив();
		КонецЕсли;
		СтрокаПозицииЧека = Новый Структура();
		СтрокаПозицииЧека.Вставить("ТекстоваяСтрока");
		СтрокаПозицииЧека.Вставить("Текст", ДополнительныйТекст);
		ПозицииЧека.Добавить(СтрокаПозицииЧека);
	КонецЕсли;
	
	Если ТаблицаОплат <> Неопределено Тогда
		ОплатаЧека = Новый Массив();
		Для ИндексОплаты = 0 По ТаблицаОплат.Количество() - 1 Цикл
			СтрокаОплаты = Новый Структура();
			СтрокаОплаты.Вставить("ТипОплаты", ТаблицаОплат[ИндексОплаты][0].Значение);
			СтрокаОплаты.Вставить("Сумма", ТаблицаОплат[ИндексОплаты][1].Значение);
			СтрокаОплаты.Вставить("Наименование", ТаблицаОплат[ИндексОплаты][2].Значение);
			ОплатаЧека.Добавить(СтрокаОплаты);
		КонецЦикла; 
	Иначе
		ТаблицаОплат = Неопределено;
	КонецЕсли;
	
	ШаблонЧека = Новый Массив();
	ШаблонЧека.Добавить(ПараметрыЧека);
	ШаблонЧека.Добавить(ПозицииЧека);
	ШаблонЧека.Добавить(ОплатаЧека);
	
	Возврат ШаблонЧека; 
	
КонецФункции

Функция ПечатьЧекаПоШаблону(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры)
	
	ИДКонфигурации = ПодключаемоеОборудованиеВчасноКасаВызовСервера.ИДКонфигурации();
	
	Результат = Истина;
	
	Если ИДКонфигурации = "BASSB" Или ИДКонфигурации = "УНФ" Тогда
		ОбщиеПараметры = ВходныеПараметры;
	Иначе
		ОбщиеПараметры = ВходныеПараметры[0];
	КонецЕсли;
	
	Если ИДКонфигурации = "BASSB" Или ИДКонфигурации = "УНФ" Тогда
		ПозицииЧека = ОбщиеПараметры.ПозицииЧека;
		ТаблицаОплат = ОбщиеПараметры.ТаблицаОплат;
	Иначе
		ПозицииЧека = ВходныеПараметры[1];
		ТаблицаОплат = ВходныеПараметры[2];
	КонецЕсли;
	
	ТаблицаДопРеквизитов = Новый Массив;
	ТаблицаДопРеквизитов.Добавить(Новый Массив);	
	
	Если ИДКонфигурации = "BASSB" Или ИДКонфигурации = "УНФ" Тогда                                                   
		ТипЧека = ?(ОбщиеПараметры.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств"), Ложь, Истина);	
	Иначе
		ФискальныйЧек = ?(ОбщиеПараметры.Свойство("ФискальныйЧек"), ОбщиеПараметры.ФискальныйЧек, Ложь);
		ТипЧека = ?(ОбщиеПараметры.Свойство("ТипЧека"), ?(ВРег(ОбщиеПараметры.ТипЧека) = "ПРОДАЖА", Ложь, Истина), Ложь);
	КонецЕсли;
	
	Если ОбщиеПараметры.Свойство("ПодписьЧека") Тогда
		РасширенныеПараметры = ОбщиеПараметры.ПодписьЧека; 
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(РасширенныеПараметры.НомерСмены);
		ВыходныеПараметры.Добавить(РасширенныеПараметры.НомерЧека);
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(ДатаСеанса());
		ВыходныеПараметры.Добавить(Неопределено);
		ВыходныеПараметры.Добавить(Неопределено);
		ВыходныеПараметры.Добавить(Неопределено);
	Иначе
		Результат = ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТипЧека, Истина, ВыходныеПараметры);
	КонецЕсли;
	
	Если Результат Тогда	
		
		ОшибкаПриПечати = Ложь;
		Для ИндексМассива = 0 По ПозицииЧека.Количество() - 1 Цикл
			
			ПозицияЧека = ПозицииЧека[ИндексМассива];
			Если ПозицияЧека.Свойство("ФискальнаяСтрока") Тогда
				
				Наименование = ?(ПозицияЧека.Свойство("Наименование"), ПозицияЧека.Наименование, "");
				Количество = ?(ПозицияЧека.Свойство("Количество"), ПозицияЧека.Количество, 1);
				Цена = ?(ПозицияЧека.Свойство("Цена"), ПозицияЧека.Цена, 0);
				Сумма = ?(ПозицияЧека.Свойство("Сумма"), ПозицияЧека.Сумма, 0);
				НомерСекции = ?(ПозицияЧека.Свойство("НомерСекции"), ПозицияЧека.НомерСекции, 0);
				СтавкаНДС = ?(ПозицияЧека.Свойство("СтавкаНДС"), ПозицияЧека.СтавкаНДС, 0);
				
				ТаблицаДопРеквизитов[0].Очистить();
				ТаблицаДопРеквизитов[0].Добавить(?(ПозицияЧека.Свойство("СтавкаНДССтрокой"), ПозицияЧека.СтавкаНДССтрокой, 0));
				ТаблицаДопРеквизитов[0].Добавить(?(ПозицияЧека.Свойство("ЭтоПодакцизныйТовар"), ПозицияЧека.ЭтоПодакцизныйТовар, Ложь));
				
				ТаблицаДопРеквизитов[0].Добавить(?(ПозицияЧека.Свойство("Наименование"), ПозицияЧека.Наименование, ""));
				ТаблицаДопРеквизитов[0].Добавить(?(ПозицияЧека.Свойство("КодПоУКТВЭД"), ПозицияЧека.КодПоУКТВЭД, ""));
				ТаблицаДопРеквизитов[0].Добавить(?(ПозицияЧека.Свойство("Артикул"), ПозицияЧека.Артикул, ""));
				ТаблицаДопРеквизитов[0].Добавить(?(ПозицияЧека.Свойство("Штрихкод"), ПозицияЧека.Штрихкод, ""));
				ТаблицаДопРеквизитов[0].Добавить(?(ПозицияЧека.Свойство("ЕдиницаИзмерения"), ПозицияЧека.ЕдиницаИзмерения, ""));
				ТаблицаДопРеквизитов[0].Добавить(?(ПозицияЧека.Свойство("ПроцентСкидок"), ПозицияЧека.ПроцентСкидок, 0));
				ТаблицаДопРеквизитов[0].Добавить(?(ПозицияЧека.Свойство("СуммаСкидок"), ПозицияЧека.СуммаСкидок, 0));
				ТаблицаДопРеквизитов[0].Добавить(?(ПозицияЧека.Свойство("ЦенаВключаетНДС"), ПозицияЧека.ЦенаВключаетНДС, 1));
				ТаблицаДопРеквизитов[0].Добавить(?(ПозицияЧека.Свойство("СуммаНДС"), ПозицияЧека.СуммаНДС, 0));
				ТаблицаДопРеквизитов[0].Добавить(?(ПозицияЧека.Свойство("ШтрихкодыАкцизныхМарок"), ПозицияЧека.ШтрихкодыАкцизныхМарок, ""));
				
				ДопРеквизиты = СформироватьТаблицуДопРеквизитов(ТаблицаДопРеквизитов);
				
				Если Не НапечататьФискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения, Наименование, Количество, Цена, Сумма, НомерСекции, СтавкаНДС, ДопРеквизиты, ВыходныеПараметры) Тогда 
					
					ОшибкаПриПечати = Истина; 
					Прервать;
				КонецЕсли;
			ИначеЕсли ПозицияЧека.Свойство("ТекстоваяСтрока") Тогда
				Текст = ?(ПозицияЧека.Свойство("Текст"), ПозицияЧека.Текст, "");
				Если Не НапечататьНефискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения, Текст, ВыходныеПараметры) Тогда
					ОшибкаПриПечати = Истина; 
					Прервать;
				КонецЕсли;
			ИначеЕсли ПозицияЧека.Свойство("Штрихкод") Тогда
				ВремВыходныеПараметры = Новый Массив();
				ТипШтрихКодаЗнач = ?(ПозицияЧека.Свойство("ТипШтрихКода"), ПозицияЧека.ТипШтрихКода, "");
				ШтрихКод = ?(ПозицияЧека.Свойство("ШтрихКод"), ПозицияЧека.ШтрихКод, "");
				Если Не ПечатьШтрихкода(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТипШтрихКодаЗнач, ШтрихКод, ВремВыходныеПараметры) Тогда
					Текст = "<Штрихкод %ТипШтрихКода% не роздрукований>";
					Текст = СтрЗаменить(Текст, "%ТипШтрихКода%", ТипШтрихКодаЗнач);
					Если Не НапечататьНефискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения, Текст, ВремВыходныеПараметры) Тогда
						ОшибкаПриПечати = Истина; 
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;		
		КонецЦикла;
		
		Если Не ОшибкаПриПечати Тогда
			ТаблицаОплатЧека = Новый Массив();
			Если ТаблицаОплат <> Неопределено Тогда 
				Если ИДКонфигурации = "BASSB" Или ИДКонфигурации = "УНФ" Тогда
					
					СуммаНаличными = 0;
					СуммаЭлектронными = 0;
					СуммаПостоплатой = 0;
					СуммаПредоплатой = 0;
					СуммаПредоставлением = 0;
					
					Для ИндексОплаты = 0 По ТаблицаОплат.Количество() - 1 Цикл
						Если ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно") Тогда
							СуммаЭлектронными = СуммаЭлектронными + ТаблицаОплат[ИндексОплаты].Сумма;
						ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Предоплата") Тогда
							СуммаПредоплатой = СуммаПредоплатой + ТаблицаОплат[ИндексОплаты].Сумма;
						ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата") Тогда
							СуммаПостоплатой = СуммаПостоплатой + ТаблицаОплат[ИндексОплаты].Сумма;
						ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.ВстречноеПредоставление") Тогда
							СуммаПредоставлением = СуммаПредоставлением + ТаблицаОплат[ИндексОплаты].Сумма;
						Иначе
							СуммаНаличными = СуммаНаличными + ТаблицаОплат[ИндексОплаты].Сумма;
						КонецЕсли;
					КонецЦикла;
					
					СтрокаОплаты = Новый СписокЗначений();
					СтрокаОплаты.Добавить(0);
					СтрокаОплаты.Добавить(СуммаНаличными);
					ТаблицаОплатЧека.Добавить(СтрокаОплаты);
					
					СтрокаОплаты = Новый СписокЗначений();
					СтрокаОплаты.Добавить(1);
					СтрокаОплаты.Добавить(СуммаЭлектронными + СуммаПредоставлением);
					ТаблицаОплатЧека.Добавить(СтрокаОплаты);
					
					СтрокаОплаты = Новый СписокЗначений();
					СтрокаОплаты.Добавить(2);
					СтрокаОплаты.Добавить(СуммаПостоплатой);
					ТаблицаОплатЧека.Добавить(СтрокаОплаты);
					
					СтрокаОплаты = Новый СписокЗначений();
					СтрокаОплаты.Добавить(3);
					СтрокаОплаты.Добавить(СуммаПредоплатой);
					ТаблицаОплатЧека.Добавить(СтрокаОплаты);
					
				Иначе
					
					Для ИндексОплаты = 0 По ТаблицаОплат.Количество() - 1 Цикл
						СтрокаОплаты = Новый СписокЗначений();
						СтрокаОплаты.Добавить(ТаблицаОплат[ИндексОплаты].ТипОплаты);
						СтрокаОплаты.Добавить(ТаблицаОплат[ИндексОплаты].Сумма);
						СтрокаОплаты.Добавить(ТаблицаОплат[ИндексОплаты].Наименование);
						СтрокаОплаты.Добавить("");
						ТаблицаОплатЧека.Добавить(СтрокаОплаты);
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
			
			Если ОбщиеПараметры.Свойство("СуммаДокумента") Тогда
				СуммаЧека = ОбщиеПараметры.СуммаДокумента;
			Иначе
				СуммаЧека = 0;
				Для Каждого ПозицияЧека Из ОбщиеПараметры.ПозицииЧека Цикл
					СуммаЧека = СуммаЧека + ПозицияЧека.Сумма;
				КонецЦикла;
			КонецЕсли;
						
			Если ТипЧека Тогда 
				ЧекККМ = 0;
				Если ИДКонфигурации = "BASSB" Или ИДКонфигурации = "УНФ" Тогда
					НомерЧекаВозврата = ?(ОбщиеПараметры.Свойство("ЧекККМПродажаНомерЧекаККМ"), ОбщиеПараметры.ЧекККМПродажаНомерЧекаККМ, "");	
				Иначе
					НомерЧекаВозврата = ОбщиеПараметры.НомерЧекаВозврата;
				КонецЕсли;
			Иначе
				НомерЧекаВозврата = "";
			КонецЕсли;	 
			Результат = ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплатЧека, ВыходныеПараметры, СуммаЧека, НомерЧекаВозврата, ОбщиеПараметры.ДокументОснование);
		Иначе
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьТаблицуДопРеквизитов(ДанныеЗагрузки)
	
	Результат = Новый Массив();
	
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Table");
	Для Каждого Позиция Из ДанныеЗагрузки Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Record");
		
		ЗаписьXML.ЗаписатьАтрибут("VAT", Позиция[0]);
		ЗаписьXML.ЗаписатьАтрибут("IsExcisable", Строка(Формат(Позиция[1], "БЛ=False; БИ=True")));
		
		ЗаписьXML.ЗаписатьАтрибут("Nomenclature", Позиция[2]);
		ЗаписьXML.ЗаписатьАтрибут("UKTZED", Позиция[3]);
		ЗаписьXML.ЗаписатьАтрибут("VendorCode", Позиция[4]);
		ЗаписьXML.ЗаписатьАтрибут("Barcode", Позиция[5]);
		ЗаписьXML.ЗаписатьАтрибут("Dimension", Строка(Позиция[6]));
		ЗаписьXML.ЗаписатьАтрибут("Discount", СтрЗаменить(Строка(Формат(Позиция[7], "ЧН=0; ЧГ=0")), ",", "."));
		ЗаписьXML.ЗаписатьАтрибут("DiscountAmount", СтрЗаменить(Строка(Формат(Позиция[8], "ЧН=0; ЧГ=0")), ",", "."));
		ЗаписьXML.ЗаписатьАтрибут("PriceIncludeVAT", Строка(Позиция[9]));
		ЗаписьXML.ЗаписатьАтрибут("AmountVAT", СтрЗаменить(Строка(Формат(Позиция[10], "ЧН=0; ЧГ=0")), ",", "."));
		ЗаписьXML.ЗаписатьАтрибут("ExciseStampBarcode", Позиция[11]);
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

Функция РевизияИнтерфейсаДрайверов()
	
	РевизияИнтерфейса = 3006;
	Возврат РевизияИнтерфейса;
	
КонецФункции

Функция ПолучитьОписаниеДрайвераXMLПакета(Данные)
	
	Параметры = Новый Структура();
	
	Если Не ПустаяСтрока(Данные) Тогда
		ЧтениеXML = Новый ЧтениеXML; 
		ЧтениеXML.УстановитьСтроку(Данные);
		ЧтениеXML.ПерейтиКСодержимому();
		Если ЧтениеXML.Имя = "DriverDescription" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			НаименованиеДрайвера = ЧтениеXML.ЗначениеАтрибута("Name");
			ОписаниеДрайвера = ЧтениеXML.ЗначениеАтрибута("Description");
			ТипОборудования = ЧтениеXML.ЗначениеАтрибута("EquipmentType");
			ВерсияДрайвера = ЧтениеXML.ЗначениеАтрибута("DriverVersion");
			ВерсияИнтеграционногоКомпонента = ЧтениеXML.ЗначениеАтрибута("IntegrationComponentVersion");
			ИнтеграционныйКомпонент = ВРег(ЧтениеXML.ЗначениеАтрибута("IntegrationComponent")) = "TRUE";
			ОсновнойДрайверУстановлен = ВРег(ЧтениеXML.ЗначениеАтрибута("MainDriverInstalled")) = "TRUE";
			URLЗагрузкиДрайвера = ЧтениеXML.ЗначениеАтрибута("DownloadURL");
			Параметры.Вставить("НаименованиеДрайвера", НаименованиеДрайвера);
			Параметры.Вставить("ОписаниеДрайвера", ОписаниеДрайвера);
			Параметры.Вставить("ТипОборудования", ТипОборудования);
			Параметры.Вставить("ВерсияДрайвера", ВерсияДрайвера);
			Параметры.Вставить("ВерсияИнтеграционногоКомпонента", ВерсияИнтеграционногоКомпонента);
			Параметры.Вставить("ИнтеграционныйКомпонент", ИнтеграционныйКомпонент);
			Параметры.Вставить("ОсновнойДрайверУстановлен", ОсновнойДрайверУстановлен);
			Параметры.Вставить("URLЗагрузкиДрайвера", URLЗагрузкиДрайвера);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

Функция ДатаСеанса()

	Возврат ТекущаяДата();		
	
КонецФункции
