&НаКлиенте
Перем ДополнительныеПараметры;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьПодключаемоеОборудование = _ДемоПодключаемоеОборудованиеВызовСервера.ИспользоватьПодключаемоеОборудование();
	
	Объект.Кассир = "Казакова Н.А.";
	Объект.Организация = "ООО ""Альфа""";
	Объект.ДатаКоррекции = ТекущаяДата();
	
	ОбновитьИнтерфейсПользователя();
	
	Если Не ОбщегоНазначенияБПО.ИспользуетсяТерминалыСбораДанных() Тогда
		Элементы.ТоварыЗагрузитьИзТСД.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДополнительныеПараметры = МенеджерОборудованияКлиентСервер.ДополнительныеПараметрыОперации();
	
	// ПодключаемоеОборудование
	Если ИспользоватьПодключаемоеОборудование Тогда
		ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ПоддерживаемыеТипы.СчитывательМагнитныхКарт = Истина;
		ПоддерживаемыеТипы.СканерШтрихкода = Истина;
		ПоддерживаемыеТипы.ДисплейПокупателя = Истина;
		ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", ЭтотОбъект);    
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(ОповещенияПриПодключении, УникальныйИдентификатор, ПоддерживаемыеТипы);
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	СтрокаДисплеяПокупателя = НСтр("ru = 'Добро пожаловать.'");
	ПересчитатьДокументНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При подключении оборудования произошла ошибка:
				|""%ОписаниеОшибки%"".'" );
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ru = 'Оборудование подключено.'" );
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		ВывестиИнформациюНаДисплейПокупателя();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Оповестить("ОбновитьСписок");
	
	// ПодключаемоеОборудование
	Если ИспользоватьПодключаемоеОборудование Тогда     
		
		ОборудованиеДисплеиПокупателяКлиент.НачатьОчисткуДисплеяПокупателя(, УникальныйИдентификатор,,, ДополнительныеПараметры);
		
		ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ПоддерживаемыеТипы.СчитывательМагнитныхКарт = Истина;
		ПоддерживаемыеТипы.СканерШтрихкода = Истина;
		ПоддерживаемыеТипы.ДисплейПокупателя = Истина;
		
		ОповещенияПриОтключении = Новый ОписаниеОповещения("ОтключитьОборудованиеЗавершение", ЭтотОбъект);    
		МенеджерОборудованияКлиент.НачатьОтключениеОборудованияПоТипу(ОповещенияПриОтключении, УникальныйИдентификатор, ПоддерживаемыеТипы);
		
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При отключении оборудования произошла ошибка: ""%ОписаниеОшибки%"".'" );
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ru = 'Оборудование отключено.'" );
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьПолученныйШКНаКлиенте(Параметр.Штрихкод);
		ИначеЕсли ИмяСобытия = "TracksData" Тогда
			ПолученКодИзСМК(Параметр);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОбновитьИнтерфейсПользователя();
	
	Если Объект.Статус = Перечисления._ДемоСтатусыЧековККМ.Фискализирован Тогда
		
		Элементы.ГруппаШапка.ТолькоПросмотр = Истина;
		
		Элементы.ФискализацияЧека.Видимость = Ложь;
		Элементы.ЧекКоррекции.Видимость = Истина;
		Элементы.ЧекКоррекции.КнопкаПоУмолчанию = Истина;
		
		Элементы.Отложить.Видимость = Ложь;
		Элементы.Сохранить.Видимость = Ложь;
		
		Элементы.ТоварыГруппаКнопок.Видимость = Ложь; 
		Элементы.ОплатаНаличныеБезСдачи.Видимость= Ложь; 
		
		Элементы.СтраницаДанныеАгента.ТолькоПросмотр = Истина;
		
	ИначеЕсли Объект.Статус = Перечисления._ДемоСтатусыЧековККМ.Коррекция Тогда
		
		Элементы.ГруппаШапка.ТолькоПросмотр = Истина;
		
		Элементы.ФискализацияЧека.Видимость = Ложь;
		Элементы.ЧекКоррекции.Видимость = Истина;
		Элементы.ЧекКоррекции.КнопкаПоУмолчанию = Истина;
		
		Элементы.Отложить.Видимость = Ложь;
		Элементы.Сохранить.Видимость = Ложь;
		
		Элементы.ТоварыГруппаКнопок.Видимость = Ложь; 
		Элементы.ОплатаНаличныеБезСдачи.Видимость= Ложь; 
		
		Элементы.СтраницаКоррекция.ТолькоПросмотр = Ложь; 
		Элементы.СтраницаТовары.ТолькоПросмотр = Ложь; 
		Элементы.СтраницаОплата.ТолькоПросмотр = Ложь;
		Элементы.СтраницаДанныеАгента.ТолькоПросмотр = Ложь;
		
	Иначе
		
		Элементы.ГруппаШапка.ТолькоПросмотр = Ложь;
		
		Элементы.ФискализацияЧека.Доступность = Истина;
		Элементы.ФискализацияЧека.КнопкаПоУмолчанию = Истина;
		Элементы.ЧекКоррекции.Видимость = Истина;
		Элементы.ЧекКоррекции.КнопкаПоУмолчанию = Ложь;
		
		Элементы.Отложить.Видимость = Истина;
		
		Элементы.ТоварыГруппаКнопок.Видимость = Истина; 
		Элементы.ОплатаНаличныеБезСдачи.Видимость = Истина; 
		
		Элементы.СтраницаКоррекция.ТолькоПросмотр = Ложь; 
		Элементы.СтраницаТовары.ТолькоПросмотр = Ложь; 
		Элементы.СтраницаОплата.ТолькоПросмотр = Ложь;
		Элементы.СтраницаДанныеАгента.ТолькоПросмотр = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиКомандФормы

// Процедура вызывается нажатием кнопки "Получить вес".
//
&НаКлиенте
Процедура ПолучитьВесВыполнить(Команда)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТекстСообщения = НСтр("ru='Необходимо выбрать строку, для которой нужно получить вес.'"); 
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Доступность = Ложь;
	
	ОповещенияПриПолученииВеса = Новый ОписаниеОповещения("ПолучитьВесВыполнить_Завершение", ЭтотОбъект);
	ОборудованиеВесовоеОборудованиеКлиент.НачатьПолученияВесаСЭлектронныхВесов(ОповещенияПриПолученииВеса, УникальныйИдентификатор, Неопределено, Неопределено, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВесВыполнить_Завершение(РезультатВыполнения, Параметры) Экспорт
	
	Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда
		
		ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
		
		Если РезультатВыполнения.Вес = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Электронные весы вернули нулевой вес.'");
			ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Иначе
			ТекущаяСтрока.Количество = РезультатВыполнения.Вес; // Вес получен
			РассчитатьСуммуРучнойСкидки();
			ПересчитатьДокументНаКлиенте();  
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТСД(Команда)
	
	Если ИспользоватьПодключаемоеОборудование Тогда
		Доступность = Ложь;
		ОповещенияПриЗагрузкеИзТСД = Новый ОписаниеОповещения("ЗагрузитьИзТСДЗавершение", ЭтотОбъект);
		МодульОборудованиеТерминалыСбораДанныхКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеТерминалыСбораДанныхКлиент");
		МодульОборудованиеТерминалыСбораДанныхКлиент.НачатьЗагрузкуДанныеИзТСД(ОповещенияПриЗагрузкеИзТСД, УникальныйИдентификатор, , , ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТСДЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Доступность = Истина;
	Если РезультатВыполнения.Результат Тогда
		Если РезультатВыполнения.Свойство("ТаблицаТоваров") Тогда
			Для Каждого Данные Из РезультатВыполнения.ТаблицаТоваров Цикл
				ОбработатьПолученныйШКНаСервере(Данные.Штрихкод, Данные.Количество);
			КонецЦикла;
			ПересчитатьДокументНаКлиенте();
		КонецЕсли;
	Иначе
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(РезультатВыполнения.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФискализацияЧека_Завершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		// Установить полученное значение номера чека реквизиту документа.
		Объект.НомерСменыККМ = РезультатВыполнения.НомерСменыККТ;
		Объект.НомерЧекаККМ = РезультатВыполнения.НомерЧекаККТ;
		
		Объект.НомерПредписания = Объект.НомерЧекаККМ;
		Объект.ОписаниеКоррекции = "Чек ККМ";
		
		Если Параметры.ЧекКоррекции Тогда
			Объект.Статус = ПредопределенноеЗначение("Перечисление._ДемоСтатусыЧековККМ.Коррекция");
		Иначе
			Объект.Статус = ПредопределенноеЗначение("Перечисление._ДемоСтатусыЧековККМ.Фискализирован");
		КонецЕсли;
	
		Объект.Дата = ОбщегоНазначенияБПОКлиентСервер.ДатаСеанса();
		Если Не ЗначениеЗаполнено(Объект.НомерЧекаККМ) Тогда
			Объект.НомерЧекаККМ = 1;
		КонецЕсли;
			
		ПараметрыЗаписи = Новый Структура("РежимЗаписи, РежимПроведения", РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
		Если ЗаписатьДокументНаСервере(ПараметрыЗаписи) Тогда
			Оповестить("ОбновитьСписок");
			ОбновитьИнтерфейсПользователя();
		Иначе
			ТекстСообщения = НСтр("ru = 'Ошибка записи документа'");
			ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 
		
		ТекстСообщения = НСтр("ru = 'Операция завершена успешно.'");
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ФискализацияЧека_ПослеОткрытииЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	// Осуществялем запрос а ЕГАИС
	ПараметрыВыполнения.ПродолжитьПечать = Истина; // Если запрос в ЕГАИС успешен
	
	АдресЧека = "URL";  // Заполняет ЕГАИС
	ПодписьЧека = "подпись"; // Заполняет ЕГАИС
	
	ПараметрыВыполнения.Вставить("АдресЧека", АдресЧека);
	ПараметрыВыполнения.Вставить("ПодписьЧека", ПодписьЧека);
	ПараметрыВыполнения.Вставить("ИНН", "23452352");
	ПараметрыВыполнения.Вставить("КПП", "23452352");
	ПараметрыВыполнения.Вставить("НаименованиеОрганизации", "ООО ""РОСИЙСКИЕ ТЕХНОЛОГИИ""");
	
	Если Не ПараметрыВыполнения.ПродолжитьПечать Тогда 
		ПараметрыВыполнения.ОписаниеОшибки = НСтр("ru = 'При подписи чека произошла ошибка.'");
	КонецЕсли;
		
	ВыполнитьОбработкуОповещения(ПараметрыВыполнения.ОповещениеПродолжения, ПараметрыВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ФискализацияЧека_ПриОшибкеПечатиЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	// Делает отмену запроса в ЕГАИС
	ВыполнитьОбработкуОповещения(ПараметрыВыполнения.ОповещениеПродолжения, ПараметрыВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ФискализацияЧека_ВыбратьУстройствоЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(РезультатВыполнения.ОписаниеОшибки);
		Возврат;
	КонецЕсли;
		
	Доступность = Ложь;
	
	Расчет = Истина;
	ВывестиИнформациюНаДисплейПокупателя();
	
	ОбщиеПараметры = ПолучитьДанныеЧека(Параметры);
	
	Если Объект.ЕГАИС Тогда      
		ОповещениеПослеОткрытииЧека = Новый ОписаниеОповещения("ФискализацияЧека_ПослеОткрытииЧека", ЭтотОбъект, ОбщиеПараметры);
		ОповещениеПриОшибкеПечатиЧека = Новый ОписаниеОповещения("ФискализацияЧека_ПриОшибкеПечатиЧека", ЭтотОбъект, ОбщиеПараметры);
		ДополнительныеПараметры.Вставить("ОповещениеПослеОткрытииЧека", ОповещениеПослеОткрытииЧека);
		ДополнительныеПараметры.Вставить("ОповещениеПриОшибкеПечатиЧека", ОповещениеПриОшибкеПечатиЧека);
	КонецЕсли;
	
	ПровестиФорматноЛогическийКонтрольНаСервере(ОбщиеПараметры, РезультатВыполнения.ИдентификаторУстройства);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ФискализацияЧека_Завершение", ЭтотОбъект, Параметры);
	Если Параметры.ЧекКоррекции Тогда
			ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФормированиеЧекаКоррекцииНаФискальномУстройстве(ОписаниеОповещения,
				УникальныйИдентификатор, РезультатВыполнения.ИдентификаторУстройства, ОбщиеПараметры, ДополнительныеПараметры);
		Иначе
			ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(ОписаниеОповещения,
				УникальныйИдентификатор, РезультатВыполнения.ИдентификаторУстройства, ОбщиеПараметры, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры
        
&НаКлиенте
Процедура ФискализацияЧека(Параметры) Экспорт
	
	ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
	ПоддерживаемыеТипы.ПринтерЧеков = Истина;
	ПоддерживаемыеТипы.ККТ = Истина;
	
	ПослеВыбратьУстройство = Новый ОписаниеОповещения("ФискализацияЧека_ВыбратьУстройствоЗавершение", ЭтотОбъект, Параметры);
	МенеджерОборудованияКлиент.ВыбратьУстройство(ПослеВыбратьУстройство, ПоддерживаемыеТипы,
			НСтр("ru='Выберите фискальное устройство'"),
			НСтр("ru='Фискальное устройство не подключено.'"), 
			НСтр("ru='Фискальное устройство не выбрано.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ФискализироватьЧекВыполнить_Продолжить(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения <> Неопределено И Тип(РезультатВыполнения) = Тип("Структура") Тогда
		ФискализацияЧека(РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФискализироватьЧекВыполнить(Команда)
	
	Записать();
	
	ОчиститьСообщения();         
	ПараметрыВыполнения = Новый Структура("ЧекКоррекции", Ложь);
	
	Если Объект.Статус <> ПредопределенноеЗначение("Перечисление._ДемоСтатусыЧековККМ.Фискализирован") Тогда
		ПараметрыКоманды = Неопределено;
		Обработчик = Новый ОписаниеОповещения("ФискализироватьЧекВыполнить_Продолжить", ЭтотОбъект, ПараметрыКоманды);
		ОткрытьФорму("Документ._ДемоЧек.Форма.ФормированиеЧека",  ПараметрыВыполнения, ПараметрыКоманды,,,, Обработчик, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		ОшибкаПовторнаяФискализацияЧека();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекКоррекции(Команда)
	
	Записать();
	
	ОчиститьСообщения();         
	ПараметрыВыполнения = Новый Структура("ЧекКоррекции", Истина);
	
	ПараметрыКоманды = Неопределено;
	Обработчик = Новый ОписаниеОповещения("ФискализироватьЧекВыполнить_Продолжить", ЭтотОбъект, ПараметрыКоманды);
	ОткрытьФорму("Документ._ДемоЧек.Форма.ФормированиеЧека",  ПараметрыВыполнения, ПараметрыКоманды,,,, Обработчик, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

// Процедура вызывается при нажатии кнопки "Отложить".
//
&НаКлиенте
Процедура ОтложитьВыполнить(Команда)
	
	Если ОтложитьЧек() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

// Функция записывает чек в базу со статусом Отложен.
//
&НаКлиенте
Процедура СохранитьВыполнить(Команда)
	
	ОтложитьЧек();
	ПересчитатьДокументНаКлиенте();
	
КонецПроцедуры

// Процедура вызывается при нажатии кнопкии "Открыть денежный ящик".
//
&НаКлиенте
Процедура ОткрытьДенежныйЯщик(Команда)
	
	Если ИспользоватьПодключаемоеОборудование Тогда
		ОчиститьСообщения();
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьОткрытиеДенежногоЯщика(, УникальныйИдентификатор)
	КонецЕсли;
	
КонецПроцедуры

// Процедура вызывается при наж атии кнопки "Ввести штрихкод".
//
&НаКлиенте
Процедура ВводШтрихкодаЗавершение(ВыбЗнач, Параметры) Экспорт
	
	Если Не ПустаяСтрока(ВыбЗнач) Тогда 
		ОбработатьПолученныйШКНаСервере(ВыбЗнач);
		ПересчитатьДокументНаКлиенте();
	КонецЕсли;    
	
КонецПроцедуры

&НаКлиенте
Процедура ВводШтрихкода(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВводШтрихкодаЗавершение", ЭтотОбъект, Параметры); 
	ПоказатьВводСтроки(Оповещение, , НСтр("ru = 'Введите штрихкод'"));
	
КонецПроцедуры

// Процедура вызывается при нажатии кнопки "Заполнить демо данными".
//
&НаКлиенте
Процедура ЗаполнитьДемоДанными(Команда)
	
	Если НЕ ЗаполнитьДемоДаннымиНаСервере() Тогда
		ТекстПредупреждения = НСтр("ru = 'Справочник ""Номенклатура"" не заполнен.'");
		ПоказатьПредупреждение(, ТекстПредупреждения, 10);
	Иначе
		ПересчитатьДокументНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

// Процедура вызывается при нажатии кнопки "Товарный чек".
//
&НаКлиенте
Процедура ПечатьТоварногоЧекаВыполнить(Команда)
	
	ОчиститьСообщения();
	
	Если Объект.Проведен Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПечатьТоварногоЧекаВыполнить_ПолучениеШириныСтроки", ЭтотОбъект);  
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолучениеШириныСтрокиПечатающегоУстройства(ОписаниеОповещения, УникальныйИдентификатор); 
	Иначе
		ТекстПредупреждения = НСтр("ru = 'Перед печатью товарного чека необходимо пробить чек.'");
		ПоказатьПредупреждение(, ТекстПредупреждения, 10);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстНефискальногоЧека(ОбщиеПараметры, ШиринаСтроки)
	
	Шаблон = ШаблоныФискальныхДокументов.ШаблонКассовыйЧек(ШиринаСтроки, ОбщиеПараметры);
	Возврат ШаблоныФискальныхДокументов.ВывестиКакТекст(Шаблон);
	
КонецФункции

&НаКлиенте
Процедура ПечатьТоварногоЧекаВыполнить_ПолучениеШириныСтроки(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		
		ОбщиеПараметры = ПолучитьДанныеЧека();
		
		Текст = ТекстНефискальногоЧека(ОбщиеПараметры, РезультатВыполнения.ШиринаСтроки);
		ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПечатиТекста(Текст);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПечатьТоварногоЧекаВыполнить_ВыполнениеКомандыЗавершение", ЭтотОбъект, Параметры);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПечатьТекста(ОписаниеОповещения, УникальныйИдентификатор, РезультатВыполнения.ИдентификаторУстройства, ПараметрыОперации); 
	Иначе
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(РезультатВыполнения.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТоварногоЧекаВыполнить_ВыполнениеКомандыЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'При печати возникла ошибка: ""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%ОписаниеОшибки%",  РезультатВыполнения.ОписаниеОшибки);
	Иначе
		ТекстСообщения = НСтр("ru = 'Операция завершена.'");
	КонецЕсли;
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТоварыПозицияПриИзменении(Элемент)
	
	РассчитатьСуммуРучнойСкидки();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПозицияПриИзмененииПроцент(Элемент)
	
	РассчитатьПроцентРучнойСкидки();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДокументПриИзменении(Элемент)
	
	ПересчитатьДокументНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СвойстваНоменклатуры = ЗаполнитьСвойстваНоменклатуры(ТекущаяСтрока.Номенклатура);
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СвойстваНоменклатуры);
	ТекущаяСтрока.СпособРасчета  = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой"); 
	
	Если Не ПолучитьСвойствоВесовойНаСервере(ТекущаяСтрока.Номенклатура) Тогда
		Текущаястрока.Количество = 1;
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена;
	КонецЕсли;
	
	РассчитатьСуммуНДС();
	СтрокаДисплеяПокупателя = ТекущаяСтрока.Номенклатура;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДанныеЧека(ПараметрыОперации = Неопределено);
	
	// Общие параметры чека
	ОбщиеПараметры = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииЧекаКоррекции();
	
	ОбщиеПараметры.ДокументОснование = Объект.Ссылка;
	Если ЗначениеЗаполнено(КорректируемыйДокумент) Тогда
		ОбщиеПараметры.КорректируемыйДокумент = КорректируемыйДокумент
	КонецЕсли;
	
	//ФискальнаяОперации = МенеджерОборудованияВызовСервера.ДанныеФискальнойОперации(ОбщиеПараметры.ДокументОснование, XMLСтрока(ОбщиеПараметры.ДокументОснование));
	//Если ФискальнаяОперации <> Неопределено Тогда
	//	ПараметрыQRКода = МенеджерОборудованияКлиентСервер.ПараметрыQRКодаЧекаККТ();
	//	ПараметрыQRКода.ДатаВремяРасчета = ФискальнаяОперации.Дата;
	//	ПараметрыQRКода.СуммаРасчета = ФискальнаяОперации.Сумма;
	//	ПараметрыQRКода.НомерФискальногоНакопителя = ФискальнаяОперации.ЗаводскойНомерФН;
	//	ПараметрыQRКода.НомерФискальногоДокумента = ФискальнаяОперации.НомерЧекаККМ;
	//	ПараметрыQRКода.ФискальныйПризнак = ФискальнаяОперации.ФискальныйПризнак;
	//	ПараметрыQRКода.ПризнакРасчета = Объект.ТипОперации;
	//	QRКод = МенеджерОборудованияКлиентСервер.СформироватьQRКодЧекаККТ(ПараметрыQRКода);
	//	ОбщиеПараметры.Вставить("QRКод", QRКод);
	//КонецЕсли;

	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека();
		СтрокаПозицииЧека.ПризнакСпособаРасчета  = СтрокаТЧ.СпособРасчета;
		СтрокаПозицииЧека.ПризнакПредметаРасчета = СтрокаТЧ.ПредметРасчета;
		СтрокаПозицииЧека.Наименование = Строка(СтрокаТЧ.Номенклатура);
		СтрокаПозицииЧека.Количество   = СтрокаТЧ.Количество;
		СтрокаПозицииЧека.Цена = СтрокаТЧ.Цена;
		СтрокаПозицииЧека.Сумма = СтрокаТЧ.Сумма;
		СтрокаПозицииЧека.СуммаСкидок = СтрокаТЧ.СуммаРучнойСкидки;
		СтрокаПозицииЧека.СтавкаНДС = _ДемоПодключаемоеОборудованиеВызовСервера.ВернутьСтавкуНДС(СтрокаТЧ.СтавкаНДС);
		СтрокаПозицииЧека.НомерСтрокиТовара = СтрокаТЧ.НомерСтроки;
		СтрокаПозицииЧека.СуммаНДС = СтрокаТЧ.СуммаНДС;      
		СтрокаПозицииЧека.ЕдиницаИзмерения = "Штука";
		СтрокаПозицииЧека.Штрихкод = СтрокаТЧ.Штрихкод;
		СтрокаПозицииЧека.ДанныеКодаТоварнойНоменклатуры.РеквизитКодаТовара = СтрокаТЧ.РеквизитКодаТовара; 
		
		СтрокаПозицииЧека.ПризнакАгентаПоПредметуРасчета = СтрокаТЧ.Номенклатура.ПризнакАгента;
		СтрокаПозицииЧека.ДанныеПоставщика.Телефон       = СтрокаТЧ.Номенклатура.ДанныеПоставщикаТелефон;
		СтрокаПозицииЧека.ДанныеПоставщика.Наименование  = СтрокаТЧ.Номенклатура.ДанныеПоставщикаНаименование;
		СтрокаПозицииЧека.ДанныеПоставщика.ИНН           = СтрокаТЧ.Номенклатура.ДанныеПоставщикаИНН;
		СтрокаПозицииЧека.ДанныеАгента.ПлатежныйАгент.Операция = СтрокаТЧ.Номенклатура.ПлатежныйАгентОперация;
		СтрокаПозицииЧека.ДанныеАгента.ПлатежныйАгент.Телефон  = СтрокаТЧ.Номенклатура.ПлатежныйАгентТелефон;
		СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.Телефон      = СтрокаТЧ.Номенклатура.ОператорПереводаТелефон;
		СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.Наименование = СтрокаТЧ.Номенклатура.ОператорПереводаНаименование;
		СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.Адрес        = СтрокаТЧ.Номенклатура.ОператорПереводаАдрес;
		СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.ИНН          = СтрокаТЧ.Номенклатура.ОператорПереводаИНН;
		СтрокаПозицииЧека.ДанныеАгента.ОператорПоПриемуПлатежей.Телефон = СтрокаТЧ.Номенклатура.ОператорПоПриемуПлатежейТелефон;   
		
		СтрокаПозицииЧека.ЗапросПроверкиКода.ИдентификаторЗапроса = "2ce10bdb-6510-4d37-be04-dd473b98c728";  
		СтрокаПозицииЧека.ЗапросПроверкиКода.ВременнаяМетка = "1692691702065";   
		СтрокаПозицииЧека.ЗапросПроверкиКода.ИдентификаторЭкземпляра = "4c182ce0-a325-42a9-ab9e-b5e562cc8721";
		СтрокаПозицииЧека.ЗапросПроверкиКода.ВерсияБазы = "52cadcfe-a28f-4877-8b2f-da0481ddf1fa";
		
		СтрокаПозицииЧека.КодСтраныПроисхожденияТовара = СтрокаТЧ.КодСтраныПроисхожденияТовара;
		СтрокаПозицииЧека.НомерТаможеннойДекларации    = СтрокаТЧ.НомерТаможеннойДекларации;
		СтрокаПозицииЧека.СуммаАкциза                  = СтрокаТЧ.СуммаАкциза;
		СтрокаПозицииЧека.ДополнительныйРеквизит       = СтрокаТЧ.ДополнительныйРеквизит;       
		СтрокаПозицииЧека.КодЕдиницыИзмерения          = "796";
		
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	КонецЦикла;
	
	// Подготовка таблицы оплат
	Для Каждого СтрокаТО Из Объект.Оплата Цикл
		СтрокаОплаты  = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
		СтрокаОплаты.ТипОплаты = СтрокаТО.ВидОплаты;
		СтрокаОплаты.Сумма = СтрокаТО.СуммаОплаты;
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	КонецЦикла;
	
	ОбщиеПараметры.ПризнакАгента = Объект.ПризнакАгента;
	ОбщиеПараметры.ДанныеПоставщика.Телефон       = Объект.ДанныеПоставщикаТелефон;
	ОбщиеПараметры.ДанныеПоставщика.Наименование  = Объект.ДанныеПоставщикаНаименование;
	ОбщиеПараметры.ДанныеПоставщика.ИНН           = Объект.ДанныеПоставщикаИНН;
	ОбщиеПараметры.ДанныеАгента.ПлатежныйАгент.Операция = Объект.ПлатежныйАгентОперация;
	ОбщиеПараметры.ДанныеАгента.ПлатежныйАгент.Телефон  = Объект.ПлатежныйАгентТелефон;
	ОбщиеПараметры.ДанныеАгента.ОператорПеревода.Телефон      = Объект.ОператорПереводаТелефон;
	ОбщиеПараметры.ДанныеАгента.ОператорПеревода.Наименование = Объект.ОператорПереводаНаименование;
	ОбщиеПараметры.ДанныеАгента.ОператорПеревода.Адрес        = Объект.ОператорПереводаАдрес;
	ОбщиеПараметры.ДанныеАгента.ОператорПеревода.ИНН          = Объект.ОператорПереводаИНН;
	ОбщиеПараметры.ДанныеАгента.ОператорПоПриемуПлатежей.Телефон = Объект.ОператорПоПриемуПлатежейТелефон;
	
	// Общие реквизиты для всех типов оборудования.
	ОбщиеПараметры.ТипРасчета          = Объект.ТипОперации;
	ОбщиеПараметры.Кассир              = СокрЛП(Объект.Кассир);
	ОбщиеПараметры.КассирИНН           = СокрЛП(Объект.КассирИНН);
	
	ОбщиеПараметры.ОрганизацияНазвание = Объект.Организация;
	ОбщиеПараметры.ОрганизацияИНН      = "0000000000";
	ОбщиеПараметры.ОрганизацияКПП      = "234523454542";
	
	Если Не ПустаяСтрока(Объект.Клиент) Тогда
		ОбщиеПараметры.СведенияОПокупателе.Покупатель    = Строка(Объект.Клиент);
		ОбщиеПараметры.СведенияОПокупателе.ПокупательИНН = Объект.Клиент.ИНН;
	КонецЕсли;
	
	//ОбщиеПараметры.АдресРасчетов       = "г.Москва, Дмитровское ш. д.9";
	//ОбщиеПараметры.МестоРасчетов       = "Северное крыло, комната 9441";
	
	// Параметры необходимые для чека ЕНВД на принтере чеков
	ОбщиеПараметры.НомерКассы = "3463345";
	ОбщиеПараметры.НомерЧека  = Объект.Номер;
	ОбщиеПараметры.НомерСмены = 1;
	// Новые параметры для ККТ по ФЗ-54
	ОбщиеПараметры.ОтправительEmail  = "info@1c.ru";
	Если ПараметрыОперации <> Неопределено Тогда                                
		ОбщиеПараметры.Электронно = ПараметрыОперации.Электронно;
		ОбщиеПараметры.ПокупательEmail   = ПараметрыОперации.ПокупательEmail;
		ОбщиеПараметры.Отправляет1СEmail = ПараметрыОперации.ОтправлятьEmailСредствами1С;
		ОбщиеПараметры.ПокупательНомер = ПараметрыОперации.ПокупательНомер;
		ОбщиеПараметры.Отправляет1СSMS = ПараметрыОперации.ОтправлятьSMSСредствами1С;
	Иначе
		ОбщиеПараметры.Электронно = Ложь;
	КонецЕсли;
	
	ОбщиеПараметры.СистемаНалогообложения = Объект.СистемаНалогообложения;
	
	ОбщиеПараметры.ДанныеКоррекции.ТипКоррекции      = Объект.ТипКоррекции;
	ОбщиеПараметры.ДанныеКоррекции.ОписаниеКоррекции = Объект.ОписаниеКоррекции;
	ОбщиеПараметры.ДанныеКоррекции.ДатаКоррекции     = Объект.ДатаКоррекции;
	ОбщиеПараметры.ДанныеКоррекции.НомерПредписания  = Объект.НомерПредписания;
	ОбщиеПараметры.НеприменениеККТ = НеприменениеККТ;
	
	ОбщиеПараметры.ДополнительныйРеквизит = Объект.ДополнительныйРеквизит;
	ОбщиеПараметры.ДополнительныйРеквизитПользователя.Наименование = Объект.РеквизитПользователяНаименование;
	ОбщиеПараметры.ДополнительныйРеквизитПользователя.Значение = Объект.РеквизитПользователяЗначение;
	
	ОбщиеПараметры.СформироватьЧекКоррекции = СформироватьЧекКоррекции;
	Возврат ОбщиеПараметры;
	
КонецФункции

// Процедура из массива параметров выбирает код магнитной карты, полученный с СМК.
//
&НаКлиенте
Процедура ПолученКодИзСМК(Параметр)
	
	Если Параметр.СписокШаблонов <> Неопределено И Параметр.СписокШаблонов.Количество() > 0 Тогда
		МКод = Параметр.СписокШаблонов[0].ДанныеДорожек[0].ЗначениеПоля;
	Иначе
		МКод = Параметр.КодКарты;
	КонецЕсли;
	
	ПолучитьКлиентаНаСервере(МКод);
	
КонецПроцедуры

// Процедура производит поиск клиента в справочнике Клиенты по коду магнитной карты.
//
&НаСервере
Процедура ПолучитьКлиентаНаСервере(МКод)
	
	Клиент = _ДемоПодключаемоеОборудованиеВызовСервера.НайтиКлиентаПоМК(МКод);
	Если Клиент <> Неопределено Тогда
		Объект.Клиент = Клиент;
	Иначе
		ПустаяСсылка = Новый (Тип("СправочникСсылка._ДемоКлиенты"));
		Объект.Клиент = ПустаяСсылка;
		ОбщегоНазначенияБПО.СообщитьПользователю(НСтр("ru = 'Клиент не найден.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолученныйШКНаклиенте(ДанныеСканера)
	
	МодульМенеджерОборудованияМаркировкаКлиентСервер = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("МенеджерОборудованияМаркировкаКлиентСервер");
	ДанныеМаркировки = МодульМенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(ДанныеСканера);
		
		Если ДанныеМаркировки.Разобран Тогда
		 Если ПустаяСтрока(ДанныеМаркировки.EAN) Тогда
			ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
			Если ТекущаяСтрока = Неопределено Тогда
				ТекстСообщения = НСтр("ru='Необходимо выбрать строку, для которой вводиться контрольная марка.'"); 
				ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
				Возврат;
			Иначе
				ТекущаяСтрока.РеквизитКодаТовара = ДанныеМаркировки.РеквизитКодаТовара;
				ТекущаяСтрока.Штрихкод = ДанныеСканера;
				Возврат;
			КонецЕсли;
		Иначе
			ОбработатьПолученныйШКНаСервере(ДанныеМаркировки.EAN, , ДанныеМаркировки);
		КонецЕсли;
	Иначе
	ОбработатьПолученныйШКНаСервере(ДанныеСканера);
	КонецЕсли;
	
	ПересчитатьДокументНаКлиенте();  
	
КонецПроцедуры

// Процедура производит поиск позиции в справочнике Номенклатура по штрихкоду.
//
&НаСервере
Процедура ОбработатьПолученныйШКНаСервере(ТекКод, Количество = 1, ДанныеМаркировки = Неопределено)
	
	РезультатОбработки = _ДемоПодключаемоеОборудованиеВызовСервера.ПоискПоШтрихкоду(ТекКод);
	Если РезультатОбработки.Количество() Тогда
		СтруктураПараметров = ЗаполнитьСвойстваНоменклатуры(РезультатОбработки[0]._ДемоНоменклатура);
		СтруктураПараметров.Вставить("Количество", Количество);
		Если ДанныеМаркировки <> Неопределено  Тогда
			СтруктураПараметров.Вставить("ГлобальныйИдентификаторТорговойЕдиницы", ДанныеМаркировки.GTIN);
			СтруктураПараметров.Вставить("СерийныйНомер", ДанныеМаркировки.СерийныйНомер);
			СтруктураПараметров.Вставить("РеквизитКодаТовара", ДанныеМаркировки.РеквизитКодаТовара);
			СтруктураПараметров.Вставить("Штрихкод", ТекКод);
		КонецЕсли;    
		ДобавитьПозициюНоменклатуры(СтруктураПараметров);
		СтрокаДисплеяПокупателя = РезультатОбработки[0]._ДемоНоменклатура;
	Иначе
		ОбщегоНазначенияБПО.СообщитьПользователю(НСтр("ru = 'Товар не найден.'"));
	КонецЕсли;

КонецПроцедуры

// Процедура добавляет заполненную строку в ТЧ Товары.
//
&НаСервере
Процедура ДобавитьПозициюНоменклатуры(СтруктураПараметров)
	
	ТекущаяСтрока = Объект.Товары.Добавить();
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураПараметров);
	
	Если Не СтруктураПараметров.Весовой Тогда
		ТекущаяСтрока.Количество = СтруктураПараметров.Количество;
	КонецЕсли;
	
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	Элементы.Товары.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
	
КонецПроцедуры

// Процедура рассчитывает сумму ручной скидки по проценту.
//
&НаКлиенте
Процедура РассчитатьПроцентРучнойСкидки()
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.СуммаРучнойСкидки = Окр(ТекущаяСтрока.Цена * ТекущаяСтрока.Количество * (ТекущаяСтрока.ПроцентРучнойСкидки/100),2);
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество - ТекущаяСтрока.СуммаРучнойСкидки;
	
	РассчитатьСуммуНДС();
	
КонецПроцедуры

// Процедура рассчитывает процент ручной скидки по сумме скидки.
//
&НаКлиенте
Процедура РассчитатьСуммуРучнойСкидки()
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	СуммаСтр = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	Если ТекущаяСтрока.СуммаРучнойСкидки > СуммаСтр Тогда
		ТекущаяСтрока.СуммаРучнойСкидки = 0;
		ТекущаяСтрока.ПроцентРучнойСкидки = 0;
		ТекущаяСтрока.Сумма = СуммаСтр;
		Текст = НСтр("ru = 'Сумма ручной скидки не может превышать стоимость'");
		ПоказатьПредупреждение(, Текст, 10);
	Иначе
		Если СуммаСтр > 0 Тогда
			ТекущаяСтрока.ПроцентРучнойСкидки = (ТекущаяСтрока.СуммаРучнойСкидки / СуммаСтр) * 100;
			ТекущаяСтрока.Сумма = СуммаСтр - ТекущаяСтрока.СуммаРучнойСкидки;
		Иначе
			ТекущаяСтрока.ПроцентРучнойСкидки = 0;
			ТекущаяСтрока.Сумма = 0;
		КонецЕсли;
	КонецЕсли;
	
	РассчитатьСуммуНДС();
	
КонецПроцедуры

// Процедура обновляет информацию о текущем состоянии документа.
//
&НаКлиенте
Процедура ПересчитатьДокументНаКлиенте()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма");
	Объект.СуммаСкидки = Объект.Товары.Итог("СуммаРучнойСкидки");
	Объект.СуммаБезСкидки = Объект.СуммаДокумента + Объект.СуммаСкидки;
	Объект.СуммаНДС = Объект.Товары.Итог("СуммаНДС");
	Объект.СуммаОплаты = Объект.Оплата.Итог("СуммаОплаты");
	
	Сдача = Объект.СуммаОплаты - Объект.СуммаДокумента;
	Если Сдача > 0 Тогда
		Объект.Сдача = Сдача;
	Иначе
		Объект.Сдача = 0;
	КонецЕсли;
	
	ВывестиИнформациюНаДисплейПокупателя();
	
КонецПроцедуры

// Процедура вывода информации на дисплей покупателя.
//
&НаКлиенте
Процедура ВывестиИнформациюНаДисплейПокупателя()
	
	Если НЕ ИспользоватьПодключаемоеОборудование Тогда
		Возврат;
	КонецЕсли;
	
	ФорматнаяСтрока = "ЧДЦ=2; ЧРГ=' '; ЧН=0.00; ЧГ=0";
	ДлинаТекста     = 20;
	
	ДПТекст1 = "";
	ДПТекст2 = "";
	
	Если Расчет Тогда
		
		ДПТекст1 = ?(
		Не ЗначениеЗаполнено(СтрокаДисплеяПокупателя),
		"",
		Лев(" К ОПЛАТЕ: " + Формат(Объект.СуммаДокумента, ФорматнаяСтрока), ДлинаТекста));
		
		Доплата = Объект.СуммаДокумента - Объект.СуммаОплаты;
		
		ДПТекст2 = ?(
		Не ЗначениеЗаполнено(СтрокаДисплеяПокупателя),
		"",
		Лев(НСтр("ru='    СДАЧА: '") + Формат(Объект.Сдача, ФорматнаяСтрока), ДлинаТекста));
		
	Иначе
		
		ДПТекст1 = ?(
		Не ЗначениеЗаполнено(СтрокаДисплеяПокупателя),
		"",
		Лев(СтрокаДисплеяПокупателя, ДлинаТекста));
		
		ДПТекст2 = ?(
		Не ЗначениеЗаполнено(СтрокаДисплеяПокупателя),
		"",
		Лев(НСтр("ru='ИТОГО: '") + Формат(Объект.СуммаДокумента, ФорматнаяСтрока), ДлинаТекста));
		
	КонецЕсли;
	
	Пока СтрДлина(ДПТекст1) < ДлинаТекста Цикл
		ДПТекст1 = ДПТекст1 + " ";
	КонецЦикла;
		
	Пока СтрДлина(ДПТекст2) < ДлинаТекста Цикл
		ДПТекст2 = ДПТекст2 + " ";
	КонецЦикла;
	
	ПараметрыОперации = ОборудованиеДисплеиПокупателяКлиент.ПараметрыОперацииДисплейПокупателя(ДПТекст1 + Символы.ПС + ДПТекст2);
	ОборудованиеДисплеиПокупателяКлиент.НачатьВыводИнформацииНаДисплейПокупателя(, УникальныйИдентификатор, ,ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

// Процедура выводит предупреждение о невозможности повторной печати чека.
//
&НаКлиенте
Процедура ОшибкаПовторнаяФискализацияЧека()
	
	ТекстПредупреждения = НСтр("ru = 'Чек уже фискализирован на фискальном устройстве'");
	ПоказатьПредупреждение(, ТекстПредупреждения, 10);
	
КонецПроцедуры

// Функция записывает чек в базу со статусом Отложен и закрывает документ.
//
&НаКлиенте
Функция ОтложитьЧек()
	
	Результат = Истина;
	Если НЕ Объект.Проведен Тогда
		Объект.СуммаОплаты = 0;
		Объект.Статус = ПредопределенноеЗначение("Перечисление._ДемоСтатусыЧековККМ.Отложен");
		ПараметрыЗаписи = Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись);
		Если НЕ ЗаписатьДокументНаСервере(ПараметрыЗаписи) Тогда
			Результат = Ложь;
			ТекстСообщения = НСтр("ru = 'Ошибка записи документа'");
			ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Оповестить("ОбновитьСписок");
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Если Объект.Проведен Тогда
		ОшибкаПовторнаяФискализацияЧека();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура рассчитывает сумму НДС по ставке для текущей строки в ТЧ Товары.
//
&НаКлиенте
Процедура РассчитатьСуммуНДС()
	
	// Цена включает НДС
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Сумма = ТекущаяСтрока.Сумма;
	Ставка = _ДемоПодключаемоеОборудованиеВызовСервера.ВернутьСтавкуНДС(ТекущаяСтрока.СтавкаНДС);
	Если Ставка = Неопределено Тогда
		ТекущаяСтрока.СуммаНДС = 0;
	ИначеЕсли Ставка > 0 И Ставка < 100 Тогда
		ТекущаяСтрока.СуммаНДС = Окр(Сумма - Сумма/( 1 + Ставка/ 100), 2);
	ИначеЕсли Ставка > 100 Тогда
		ТекущаяСтрока.СуммаНДС = Окр(Сумма - Сумма/( 1 + (Ставка - 100)/ 100), 2);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПровестиФорматноЛогическийКонтрольНаСервере(ОбщиеПараметры, ИдентификаторУстройства)
	
	Если ОбщегоНазначенияБПО.ИспользуетсяФорматноЛогическийКонтроль() Тогда
		МодульФорматноЛогическийКонтроль = ОбщегоНазначенияБПО.ОбщийМодуль("ФорматноЛогическийКонтроль");
		МодульФорматноЛогическийКонтроль.ПровестиФорматноЛогическийКонтроль(ОбщиеПараметры, ИдентификаторУстройства);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЗаполнитьСвойстваНоменклатуры(Номенклатура)
	
	СвойстваНоменклатуры = Новый Структура();
	СвойстваНоменклатуры.Вставить("Номенклатура", Номенклатура);
	СвойстваНоменклатуры.Вставить("Характеристика", Номенклатура.Характеристика);
	СвойстваНоменклатуры.Вставить("Весовой", Номенклатура.Весовой);
	СвойстваНоменклатуры.Вставить("Цена", Номенклатура.Цена);
	СвойстваНоменклатуры.Вставить("ЕдиницаИзмерения", Номенклатура.ЕдиницаИзмерения);
	СвойстваНоменклатуры.Вставить("СтавкаНДС", Номенклатура.СтавкаНДС);
	СвойстваНоменклатуры.Вставить("ПредметРасчета", Номенклатура.ПризнакПредметаРасчета);
	Возврат СвойстваНоменклатуры;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСвойствоВесовойНаСервере(Номенклатура)
	
	Возврат Номенклатура.Весовой;
	
КонецФункции

// Функция записи и проведения документа.
//
&НаСервере
Функция ЗаписатьДокументНаСервере(ПараметрыЗаписи)
	
	Результат = Ложь;
	
	Попытка
		Результат = Записать(ПараметрыЗаписи);
	Исключение
		ТекстСообщения = ОписаниеОшибки();
		ОбщегоНазначенияБПО.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Функция заполняет ТЧ Товары данными из справочника Номенклатура.
//
&НаСервере
Функция ЗаполнитьДемоДаннымиНаСервере()
	
	Результат = _ДемоПодключаемоеОборудованиеВызовСервера.ВыбратьДемоДанные();
	Если Результат.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе
		Объект.Товары.Загрузить(Результат);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура НаличныеБезСдачи(Команда)
	
	Объект.Оплата.Очистить();
	Строка = Объект.Оплата.Добавить();
	Строка.ВидОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Наличные");
	Строка.СуммаОплаты = Объект.Товары.Итог("Сумма");
	ПересчитатьДокументНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьНаЭТ(Команда)                    
	
	Доступность = Ложь;
	
	ОчиститьСообщения();
	ПараметрыОперации = Новый Структура();
	ПараметрыОперации.Вставить("ТипТранзакции"               , "AuthorizeSales");
	ПараметрыОперации.Вставить("ЗапретРедактированияСуммы"   , Ложь);
	ПараметрыОперации.Вставить("Сумма", Объект.Товары.Итог("Сумма"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОплатитьНаЭТ_ВыполнитьОперацию", ЭтотОбъект, ПараметрыОперации);
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ФормаАвторизацииЭТ", ПараметрыОперации,,,  ,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры            

 &НаКлиенте
Процедура ОплатитьНаЭТ_ВыполнитьОперацию(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Если НЕ Параметры.Свойство("ТипТранзакции") Тогда
			ТекстСообщения = НСтр("ru = 'Не указан тип транзакции.'");
			ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		ПараметрыОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();  
		ПараметрыОперации.ДокументОснование = Объект.Ссылка;
		ПараметрыОперации.ТипТранзакции  = Параметры.ТипТранзакции;
		ПараметрыОперации.СуммаОперации  = Результат.Сумма;
		ПараметрыОперации.СсылочныйНомер = Результат.СсылочныйНомер;
		
		Оповещение = Новый ОписаниеОповещения("ОплатитьНаЭТ_Завершение", ЭтотОбъект);
		ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеОперацииНаЭквайринговомТерминале(Оповещение, УникальныйИдентификатор, Неопределено, ПараметрыОперации);
	Иначе
		Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьНаЭТ_Завершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда               
		Строка = Объект.Оплата.Добавить();
		Строка.ВидОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно");
		Строка.СуммаОплаты = Объект.Товары.Итог("Сумма");
		ТекстСообщения = НСтр("ru = 'Операция выполнена успешно.'");
		ПересчитатьДокументНаКлиенте();
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
	Доступность = Истина;
	
КонецПроцедуры

#КонецОбласти