
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СтатусыЗадач
	Движения.СтатусыЗадач.Записывать = Истина;
	Движение = Движения.СтатусыЗадач.Добавить();
	Движение.Период = Дата;
	Движение.ТекущийПлан = ТекущийПлан;
	Движение.ЗаказКлиента = ЗаказКлиента;
	Движение.ПланРодитель = ПланРодитель;
	Движение.АктуальныйСтатус = НовыйСтатус;
	Движение.СледующийПлан = СледующийПлан;
	Движение.ФункцТипЗадачи = ТипЗадачи;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
