
&НаСервере
Процедура УстановкаПервоначальныхЗначений()
	Объект.Статус = Перечисления.СостояниеЗадач.Создано;
	Объект.СрокВыполнения = ТекущаяДата();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановкаПервоначальныхЗначений();
КонецПроцедуры


&НаСервере
Процедура СтатусПриИзмененииНаСервере()
	Если Объект.Статус = Перечисления.СостояниеЗадач.Завершенно Тогда
		Объект.Выполнена = Истина;
	КонецЕсли;
	ЭтотОбъект.Записать();
КонецПроцедуры


&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	СтатусПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ДобавитьВАктНаСервере()
	//найти документ акта	
	СсылкаНаАктРабот = Документы.АктРабот.СсылкаНаАктРабот(Объект.Дата, Объект.Исполнитель);
	
	Если СсылкаНаАктРабот = Неопределено Тогда
		СсылкаНаАктРабот = Документы.АктРабот.СоздатьАктРабот(Объект.Дата, Объект.Исполнитель);	
	КонецЕсли;

	//заполнить
	Документы.АктРабот.ДобавитЗаписьВАктРабот(СсылкаНаАктРабот, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВАкт(Команда)
	ДобавитьВАктНаСервере();
КонецПроцедуры


