
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаименованиеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	Объект.Наименование = Текст;
	ЗаполнитьПолноеНаименование(Текст);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ИзображениеТовара = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Картинка");
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(ИзображениеТовара) Тогда
		ТекущийОбъект.Картинка = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ИзображениеТовара));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.SKU = 0 Тогда
		Объект.SKU = _ДемоПодключаемоеОборудованиеВызовСервера.ПолучитьМаксимальныйКодSKU();
	КонецЕсли;
	
	Элементы.АлкогольнаяПродукция.Видимость = Объект.Алкоголь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьПолноеНаименование(Текст)
	
	Объект.НаименованиеПолное = ?(Объект.НаименованиеПолное = "",Текст,Объект.НаименованиеПолное);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзображение(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьИзображениеЗавершить", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещения,,,, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзображениеЗавершить(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;
	
	ИзображениеТовара = Адрес;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеТовараНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Объект.ОписаниеТовара = Объект.НаименованиеПолное;
	
КонецПроцедуры

&НаКлиенте
Процедура АлкогольПриИзменении(Элемент)
	
	Элементы.АлкогольнаяПродукция.Видимость = Объект.Алкоголь;
	Если Объект.Алкоголь Тогда
		Элементы.Атрибуты.ТекущаяСтраница = Элементы.АлкогольнаяПродукция;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
