Функция СоздатьРасходОрдера(ДатаНакладной, Заведение, Касса, Поставщик, Сумма, Статья, Ссылка, СсылкаНакладной, РР, ДатаОтчета) Экспорт
	
	РасходОрдер = Документы.РасходныйКассовыйОрдер.СоздатьДокумент();
	РасходОрдер.Дата =  ДатаНакладной;
	РасходОрдер.Заведение = Заведение;
	РасходОрдер.Касса = Касса;
	РасходОрдер.Поставщик = Поставщик;
	РасходОрдер.Сумма = Сумма;
	РасходОрдер.Статья = Статья;
	РасходОрдер.РасчетныйСчет = РР;
	РасходОрдер.СсылкаНаНакладную = СсылкаНакладной;
	РасходОрдер.СсылкаНаОтчет = Ссылка;
	РасходОрдер.ДатаСозданияДокумента = ДатаОтчета;

	РасходОрдер.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат РасходОрдер.Ссылка;
	
КонецФункции

Функция СсылкаНаРасходОрдер(Заведение, ДатаСмены,ИндексСтраницы, ИндексСтроки) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйКассовыйОрдер.Ссылка КАК Ссылка,
		|	РасходныйКассовыйОрдер.Дата КАК Дата,
		|	РасходныйКассовыйОрдер.Заведение КАК Заведение,
		|	РасходныйКассовыйОрдер.ИндексСтроки КАК ИндексСтроки,
		|	РасходныйКассовыйОрдер.ИндексСтраницы КАК ИндексСтраницы
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|ГДЕ
		|	РасходныйКассовыйОрдер.Дата = &Дата
		|	И РасходныйКассовыйОрдер.Заведение = &Заведение
		|	И РасходныйКассовыйОрдер.ИндексСтроки = &ИндексСтроки
		|	И РасходныйКассовыйОрдер.ИндексСтраницы = &ИндексСтраницы";
	
	Запрос.УстановитьПараметр("Дата", ДатаСмены);
	Запрос.УстановитьПараметр("Заведение", Заведение);
	Запрос.УстановитьПараметр("ИндексСтраницы", ИндексСтраницы);
	Запрос.УстановитьПараметр("ИндексСтроки", ИндексСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();		
		
	Возврат Выборка.Ссылка;	
	
КонецФункции

Функция ПроверкаОплатыПН(СсылкаНаНакладную) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйКассовыйОрдер.СсылкаНаНакладную КАК СсылкаНаНакладную
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|ГДЕ
		|	РасходныйКассовыйОрдер.СсылкаНаНакладную = &СсылкаНаНакладную";
	
	Запрос.УстановитьПараметр("СсылкаНаНакладную", СсылкаНаНакладную);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;	
	КонецЦикла;
	
	Возврат Ложь;	
КонецФункции


Функция СсылкаНаРассчет(СсылкаНаНакладную) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйКассовыйОрдер.СсылкаНаНакладную КАК СсылкаНаНакладную,
		|	РасходныйКассовыйОрдер.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|ГДЕ
		|	РасходныйКассовыйОрдер.СсылкаНаНакладную = &СсылкаНаНакладную";
	
	Запрос.УстановитьПараметр("СсылкаНаНакладную", СсылкаНаНакладную);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;	
	КонецЦикла;
	
	Возврат Неопределено;
	
	
КонецФункции
