#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции


Функция ПреобразоватьТоварВМассив(Товар)

	Массив = Новый Массив;
	Массив.Добавить(Товар);
	
	Возврат Массив;

КонецФункции // ПреобразоватьТоварВМассив()

Функция ПолучитьЦенуТовара(МассивТоваров, Дата = Неопределено) Экспорт 
	//ЦеныТоваров = Новый Соответствие; 

	//Если НЕ ТипЗнч(МассивТоваров) = Тип("Массив") Тогда
	//	
	//	Если ТипЗнч(МассивТоваров) = Тип("СправочникСсылка.Номенклатура") Тогда
	//		МассивТоваров = ПреобразоватьТоварВМассив(МассивТоваров);
	//	Иначе
	//		Сообщить("Переданный тип не соответствует массиву");
	//		Возврат ЦеныТоваров;	
	//	КонецЕсли
	//		
	//КонецЕсли;

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	//	|	ЦеныСрезПоследних.Цена КАК Цена
	//	|ИЗ
	//	|	РегистрСведений.Цены.СрезПоследних КАК ЦеныСрезПоследних
	//	|ГДЕ
	//	|	ЦеныСрезПоследних.Номенклатура В(&Номенклатура)";
	//
	//Запрос.УстановитьПараметр("Номенклатура", МассивТоваров);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Выборка = РезультатЗапроса.Выбрать();

	//Пока Выборка.Следующий() Цикл
	//	ЦеныТоваров.Вставить(Выборка.Номенклатура, Выборка.Цена);		
	//КонецЦикла;
	//
	//   Возврат ЦеныТоваров;
	
	Если НЕ ТипЗнч(МассивТоваров) = Тип("СправочникСсылка.Номенклатура") Тогда
		Сообщить("Переданный тип не соответствует массиву");
		Возврат 0;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(, Номенклатура = &Номенклатура) КАК ЦеныСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", МассивТоваров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Цена;	
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции // ПолучитьЦенуТовара()

Функция НайтиНоменклатуруПоШтрихКоду(ШтрихКод) Экспорт 
	
	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(ШтрихКод, "Число") Тогда
		Возврат Неопределено;
	КонецЕсли;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НоменклатураШтрихКоды.Ссылка.Ссылка КАК Ссылка,
		|	НоменклатураШтрихКоды.ШтрихКод КАК ШтрихКод
		|ИЗ
		|	Справочник.Номенклатура.ШтрихКоды КАК НоменклатураШтрихКоды
		|ГДЕ
		|	НоменклатураШтрихКоды.ШтрихКод = &ШтрихКод";
	
	Запрос.УстановитьПараметр("ШтрихКод", Формат(ШтрихКод, "ЧРГ=' '; ЧГ=0"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий(); 
	
	Возврат Выборка.Ссылка;

КонецФункции 

Функция НайтиНоменклатуруПоКоду(Код) Экспорт

	Возврат Справочники.Номенклатура.НайтиПоКоду(Код, Истина);	

КонецФункции // НайтиПоКоду()

Функция НайтиНоменклатуруПоНазванию(Название) Экспорт

	Возврат Справочники.Номенклатура.НайтиПоНаименованию(Название);	

КонецФункции // НайтиПоКоду()

Функция ПолучитьПроцентНаценки(Номенклатура) Экспорт 

    Возврат Номенклатура.Родитель.ПроцентНаценки;
	
КонецФункции 

&НаСервере
Функция  ГлобальныйПоискПоШтрихКоду(ШтрихКод) Экспорт 
	
	Номенклатура = НайтиНоменклатуруПоШтрихКоду(ШтрихКод);
	
	Если Номенклатура = Неопределено Тогда
		
		Номенклатура = НайтиНоменклатуруПоКоду(ШтрихКод);
		//товар не обнаружен
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;  
	
	Возврат Номенклатура;

КонецФункции // ОбработкаВводаШтрихКода()

Функция ШтрихкодНоменклатуры(Номенклатура) Экспорт 
	
	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(Номенклатура, "СправочникСсылка.Номенклатура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НоменклатураШтрихКоды.Ссылка.Ссылка КАК Ссылка,
		|	НоменклатураШтрихКоды.ШтрихКод КАК ШтрихКод
		|ИЗ
		|	Справочник.Номенклатура.ШтрихКоды КАК НоменклатураШтрихКоды
		|ГДЕ
		|	НоменклатураШтрихКоды.Ссылка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ШтрихКод;
	КонецЦикла;
	
	Возврат Номенклатура.Код;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецФункции
#КонецОбласти

#Область Инициализация

#КонецОбласти

          

