Функция ПроверкаОбработкиЗаявки(Ссылка) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаЗадачи.Заявка КАК Заявка
		|ИЗ
		|	РегистрСведений.ЗаявкаЗадачи КАК ЗаявкаЗадачи
		|ГДЕ
		|	ЗаявкаЗадачи.Заявка = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий(); 
	
	Возврат Выборка.Заявка;
	
КонецФункции

Функция СсылкаНаЗадачуИзЗаявки(Ссылка) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаЗадачи.Заявка КАК Заявка,
		|	ЗаявкаЗадачи.Задача КАК Задача
		|ИЗ
		|	РегистрСведений.ЗаявкаЗадачи КАК ЗаявкаЗадачи
		|ГДЕ
		|	ЗаявкаЗадачи.Заявка = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий(); 
	
	Возврат Выборка.Задача;
	
КонецФункции
