#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УстройствоРаспознаванияПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ЗаполнитьТаблицуТоваровНаСервере(Количество)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 10
		|	_ДемоНоменклатура.Ссылка КАК Ссылка,
		|	_ДемоНоменклатура.SKU КАК SKU
		|ИЗ
		|	Справочник._ДемоНоменклатура КАК _ДемоНоменклатура";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 10", СтрШаблон("ПЕРВЫЕ %1", Формат(Количество,"ЧГ=0")));
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Строка = ТаблицаТоваров.Добавить();
		Строка.Номенклатура = Выборка.Ссылка;
		Строка.SKU = Выборка.SKU;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьТаблицуТоваров(Команда)
	
	Если ТаблицаТоваров.Количество()>0 Тогда
		Результат = Ждать ВопросАсинх(НСтр("ru = 'Очистить таблицу?'"),РежимДиалогаВопрос.ДаНетОтмена);
		Если Результат =КодВозвратаДиалога.Отмена Тогда
			Возврат;
		ИначеЕсли Результат =КодВозвратаДиалога.Да Тогда
			ТаблицаТоваров.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	Если Команда = Команды.ЗаполнитьТаблицуТоваров10 Тогда
		ЗаполнитьТаблицуТоваровНаСервере(10);
	ИначеЕсли Команда = Команды.ЗаполнитьТаблицуТоваров100 Тогда
		ЗаполнитьТаблицуТоваровНаСервере(100);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключить(Команда)
	
	Если ЗначениеЗаполнено(УстройствоРаспознавания) Тогда
		Контекст = Новый Структура();
		Контекст.Вставить("СообщениеУспех", "Устройство успешно подключено.");
		Контекст.Вставить("СообщениеОшибка", "Не удалось подключить устройство, ошибка: %1");
		Оповещение = Новый ОписаниеОповещения("ОперацияВыполненаЗаверешние", ЭтотОбъект, Контекст);
		МенеджерОборудованияКлиент.НачатьПодключениеОборудования(Оповещение, ЭтаФорма.УникальныйИдентификатор, ,УстройствоРаспознавания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отключить(Команда)
	
	Если ЗначениеЗаполнено(УстройствоРаспознавания) Тогда
		Контекст = Новый Структура();
		Контекст.Вставить("СообщениеУспех", "Устройство успешно отключено.");
		Контекст.Вставить("СообщениеОшибка", "Не удалось отключить устройство, ошибка: %1");
		Оповещение = Новый ОписаниеОповещения("ОперацияВыполненаЗаверешние", ЭтотОбъект, Контекст);
		МенеджерОборудованияКлиент.НачатьОтключениеОборудования(Оповещение, ЭтаФорма.УникальныйИдентификатор,,УстройствоРаспознавания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Настройка(Команда)
	
	Если ЗначениеЗаполнено(УстройствоРаспознавания) Тогда
		МенеджерОборудованияКлиент.ВыполнитьНастройкуОборудования(УстройствоРаспознавания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьТовары(Команда)
	
	ПараметрыВыгрузки = ОборудованиеУстройствоРаспознаванияКлиентСервер.ПараметрыОперацииВыгрузкиВУстройствоРаспознавания();
	Для Каждого Строка Из ТаблицаТоваров Цикл
		СтрокаВыгрузки = ОборудованиеУстройствоРаспознаванияКлиентСервер.ПараметрыСтрокиВыгрузкиВУстройствоРаспознавания();
		СтрокаВыгрузки.Наименование = Строка(Строка.Номенклатура);
		СтрокаВыгрузки.Код = Строка.SKU;
		ПараметрыВыгрузки.ТаблицаТоваров.Добавить(СтрокаВыгрузки);
	КонецЦикла;
	Контекст = Новый Структура();
	Оповещение = Новый ОписаниеОповещения("ОперацияТоварыЗавершение", ЭтотОбъект, Контекст);
	ОборудованиеУстройствоРаспознаванияКлиент.НачатьВыгрузкуТоваровВУстройствоРаспознавания(
		Оповещение, 
		ЭтаФорма.УникальныйИдентификатор, 
		УстройствоРаспознавания, 
		ПараметрыВыгрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТовары(Команда)
	
	Контекст = Новый Структура();
	Оповещение = Новый ОписаниеОповещения("ОперацияТоварыЗавершение", ЭтотОбъект, Контекст);
	ОборудованиеУстройствоРаспознаванияКлиент.НачатьОчисткуТоваровВРаспознавателе(
		Оповещение, 
		ЭтаФорма.УникальныйИдентификатор, 
		УстройствоРаспознавания);
		
КонецПроцедуры

&НаКлиенте
Процедура Распознать(Команда)
	
	ПараметрыОперации = ОборудованиеУстройствоРаспознаванияКлиентСервер.ПараметрыОперацииРаспознать();
	ПараметрыОперации.Обучение = ПроводитьОбучение;
	ПараметрыОперации.Варианты = 10;
	
	Контекст = Новый Структура();
	Оповещение = Новый ОписаниеОповещения("РаспознатьЗавершение", ЭтотОбъект, Контекст);
	ОборудованиеУстройствоРаспознаванияКлиент.НачатьРаспознавание(
		Оповещение, 
		ЭтаФорма.УникальныйИдентификатор, 
		УстройствоРаспознавания, 
		ПараметрыОперации);
		
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	
	Если Элементы.ТаблицаРаспознано.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ОборудованиеУстройствоРаспознаванияКлиентСервер.ПараметрыОперацииПодтвердить();
	ПараметрыОперации.Код =  Элементы.ТаблицаРаспознано.ТекущиеДанные.SKU;
	
	Контекст = Новый Структура();
	Оповещение = Новый ОписаниеОповещения("ПодтвердитьЗавершение", ЭтотОбъект, Контекст);
	ОборудованиеУстройствоРаспознаванияКлиент.НачатьПодтверждениеРаспознавания(
		Оповещение, 
		ЭтаФорма.УникальныйИдентификатор, 
		УстройствоРаспознавания, 
		ПараметрыОперации);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОперацияВыполненаЗаверешние(РезультатВыполнения, Контекст) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		Сообщить(Контекст.СообщениеУспех);
	Иначе
		Сообщить(СтрШаблон(Контекст.СообщениеОшибка, РезультатВыполнения.ОписаниеОшибки));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацияТоварыЗавершение(РезультатВыполнения, Контекст) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		Сообщить(РезультатВыполнения.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Функция НайтиПоSKU(МассивКодов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	_ДемоНоменклатура.Ссылка КАК Ссылка,
		|	_ДемоНоменклатура.SKU КАК SKU
		|ИЗ
		|	Справочник._ДемоНоменклатура КАК _ДемоНоменклатура
		|ГДЕ
		|	_ДемоНоменклатура.SKU В(&МассивКодов)";
	
	Запрос.УстановитьПараметр("МассивКодов", МассивКодов);
	
	
	Результат = Новый Соответствие();
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.SKU, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура РаспознатьЗавершение(РезультатВыполнения, Контекст) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Ошибка распознавания: %1'"), РезультатВыполнения.ОписаниеОшибки));
		Возврат;
	КонецЕсли;
	
	РаспознанныеКоды = Новый Массив();
	Для Каждого Запись Из РезультатВыполнения.РаспознанныеТовары Цикл
		РаспознанныеКоды.Добавить(Запись.Код);
	КонецЦикла;
	НайденныеТовары = НайтиПоSKU(РаспознанныеКоды);
	
	ТаблицаРаспознано.Очистить();
	Для Каждого Запись Из РезультатВыполнения.РаспознанныеТовары Цикл
		Строка = ТаблицаРаспознано.Добавить();
		Строка.SKU          = Запись.Код;
		Строка.Вероятность  = Запись.Вероятность;
		Строка.Номенклатура = НайденныеТовары.Получить(Запись.Код);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьЗавершение(РезультатВыполнения, Контекст) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		Сообщить("Обучение успешно выполнено");
	Иначе
		Сообщить("Обучение не выполнено: "+РезультатВыполнения.ОписаниеОшибки);
	КонецЕсли;
	//Отбор = Новый Структура();
	//Отбор.Вставить("SKU", 0);
	//ТаблицаРаспознано.Очистить();
	//Для Каждого Запись Из РезультатВыполнения.РаспознанныеТовары Цикл
	//	Отбор.SKU = Запись.Код;
	//	МассивСтрок = ТаблицаТоваров.НайтиСтроки(Отбор);
	//	Если МассивСтрок.Количество()>0 Тогда
	//		Строка = ТаблицаРаспознано.Добавить();
	//		Строка.Номенклатура = МассивСтрок[0].Номенклатура;
	//		Строка.Вероятность = Запись.Вероятность;
	//	КонецЕсли;
	//КонецЦикла;
	//ТаблицаРаспознано.Сортировать("Вероятность Убыв");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаспознаноВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Подтвердить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()
	
	Если ЗначениеЗаполнено(УстройствоРаспознавания) Тогда
		Элементы.ТаблицаТоваровРаспознать.Доступность = Истина;
		Элементы.ТаблицаТоваровПодтвердить.Доступность = Истина;
		Элементы.ТаблицаТоваровВыгрузитьТовары.Доступность = Истина;
		Элементы.ТаблицаТоваровОчиститьТовары.Доступность = Истина;
		Элементы.Подключить.Доступность = Истина;
		Элементы.Отключить.Доступность = Истина;
		Элементы.Настройка.Доступность = Истина;
		Элементы.ПроводитьОбучение.Доступность = Истина;
		
	Иначе
		Элементы.ТаблицаТоваровРаспознать.Доступность = Ложь;
		Элементы.ТаблицаТоваровПодтвердить.Доступность = Ложь;
		Элементы.ТаблицаТоваровВыгрузитьТовары.Доступность = Ложь;
		Элементы.ТаблицаТоваровОчиститьТовары.Доступность = Ложь;
		Элементы.Подключить.Доступность = Ложь;
		Элементы.Отключить.Доступность = Ложь;
		Элементы.Настройка.Доступность = Ложь;
		Элементы.ПроводитьОбучение.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти







