
#Область ПроцедурыИФункцииПанельАдминистрирования

// Дополнительные переопределяемые действия с управляемой формой в Панели администрирования БПО
// при событии "ПриСозданииНаСервере".
//
// Параметры:
//  ЭтаФорма - ФормаКлиентскогоПриложения - Форма настройки оборудования
//  Отказ - Булево - Отказ создания
//  Параметры - Структура - Параметры операции
//  СтандартнаяОбработка - Булево - Стандартная обработка
//
Процедура ПанельАдминистрированияПриСозданииНаСервере(ЭтаФорма, Отказ, Параметры, СтандартнаяОбработка) Экспорт
	
	ДобавляемыеРеквизиты = Новый Массив();
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("_ДемоОбменСПодключаемымОборудованием", Новый ОписаниеТипов("Булево")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("_ДемоРаспределеннаяФискализация",      Новый ОписаниеТипов("Булево")));
	
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	ЭтаФорма._ДемоОбменСПодключаемымОборудованием = Константы._ДемоОбменСПодключаемымОборудованием.Получить();
	ЭтаФорма._ДемоРаспределеннаяФискализация      = Константы._ДемоРаспределеннаяФискализация.Получить();
	
	Элементы = ЭтаФорма.Элементы;
	
	Элемент = Элементы.ИспользоватьРаспределеннуюФискализацию;
	Элемент.ПутьКДанным = "_ДемоРаспределеннаяФискализация";
	
	Элемент = Элементы.Вставить(
		"ОфлайнОборудованиеПодключено", 
		Тип("ПолеФормы"), 
		Элементы.ГруппаУправлениеОфлайнОборудованиемПерваяСтрока,
		Элементы.ОткрытьОфлайнОборудование);
	Элемент.Вид                  = ВидПоляФормы.ПолеФлажка;
	Элемент.Заголовок            = НСтр("ru = 'Демо: Обмен с офлайн-оборудованием'");
	Элемент.ПутьКДанным          = "_ДемоОбменСПодключаемымОборудованием";
	Элемент.ПоложениеЗаголовка   = ПоложениеЗаголовкаЭлементаФормы.Право;
	Элемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Подсказка            = НСтр("ru = 'Использование правил обмена с оборудованием. 
							|Необходимо для использования офлайн-касс, прайс-чекеров и весов с печатью этикеток.'");
	Элемент.РасширеннаяПодсказка.Заголовок = Подсказка;
	Элемент.РасширеннаяПодсказка.Ширина = 40;
	Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииРеквизита");
	
КонецПроцедуры

Процедура ПанельАдминистрированияУстановкаДоступности(Форма, РеквизитПутьКДанным) Экспорт
	
	Если РеквизитПутьКДанным = "_ДемоОбменСПодключаемымОборудованием" Тогда
		ОбменДоступен = Форма._ДемоОбменСПодключаемымОборудованием;
		
		Элементы = Форма.Элементы;
		Элементы.ОткрытьОфлайнОборудование.Доступность = ОбменДоступен;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаполненииКомандПанелиАдминистрирования(Форма, Команды) Экспорт
	
	Элементы = Форма.Элементы;
	
	ГруппаФЗ54 = НастройкиПрограммыБПО.НоваяГруппаПанелиАдминистрирования(Форма, "Группа_ФЗ54");
	ГруппаФЗ54.Заголовок = НСтр("ru = 'Демо: Изменения 54-ФЗ'");
	
	Команда = Команды.Добавить();
	Команда.ГруппаФормы   = ГруппаФЗ54;
	Команда.Представление = НСтр("ru = 'Демо: Подключить кассы к оператору фискальных данных'");
	Команда.Порядок       = 50;
	Команда.Важность      = "Важное";
	Команда.Подсказка     = НСтр("ru = 'Сервис  «1С-ОФД» обеспечит удобное подключение ваших касс к оператору фискальных данных без наценок к официальной стоимости услуг ОФД.'");
	Команда.Обработчик    = "http://v8.1c.ru/cnt.jsp/:kd_roz:/https://portal.1c.ru/applications/56";
	
	Команда = Команды.Добавить();
	Команда.ГруппаФормы   = ГруппаФЗ54;
	Команда.Представление = НСтр("ru = 'Демо: Все о 54-ФЗ и переходе на онлайн-ККТ'");
	Команда.Порядок       = 80;
	Команда.Важность      = "Важное";
	Команда.Подсказка     = НСтр("ru = 'С 1 июля 2017 года можно будет использовать только те ККТ, которые передают данные о продажах в ФНС через оператора фискальных данных (Федеральный закон 54-ФЗ).'");
	Команда.Обработчик    = "http://v8.1c.ru/cnt.jsp/:kd_roz:/http://v8.1c.ru/kkt/";
	
	Команда = Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Демо: Клиентский модуль'");
	Команда.Подсказка = НСтр("ru = 'Пример вызова процедуры клиентского модуля Менеджер оборудования клиент Открыть подключаемое оборудование'");
	Команда.Обработчик = "МенеджерОборудованияКлиент.ОткрытьПодключаемоеОборудование";
	
	Команда = Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Демо: Подключаемое оборудование'");
	Команда.Подсказка = НСтр("ru = 'Пример команды Форма списка справочника Подключаемое оборудование'");
	Команда.ИмяФормы = "Справочник.ПодключаемоеОборудование.ФормаСписка";
	
	Команда = Команды.Добавить();
	Команда.Важность = "Важное";
	Команда.Представление = НСтр("ru = 'Демо: Внутренняя ссылка'");
	Команда.Подсказка = НСтр("ru = 'Пример команды внутренная ссылка на регистр сведений очередь чеков'");
	Команда.Обработчик = "e1cib/list/РегистрСведений.ОчередьЧековККТ";
	
	Команда = Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Демо: Внешняя ссылка'");
	Команда.Подсказка = НСтр("ru = 'Пример команды ссылка на внешний сайт'");
	Команда.Обработчик = "http://v8.1c.ru/cnt.jsp/:kd_roz:/http://v8.1c.ru/kkt/";
	
	
КонецПроцедуры

#КонецОбласти