#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Штрихкод") Тогда
		Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(Параметры.Штрихкод,"Число") Тогда
			Возврат;
		КонецЕсли;
		НовыйШтрихкод = Объект.ШтрихКоды.Добавить();
	    НовыйШтрихкод.ШтрихКод = Параметры.Штрихкод;
	КонецЕсли;   
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	НаименованиеПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура НаименованиеПриИзмененииНаСервере()

	Если НЕ Объект.НазваниеНаЭтикетке = "" Тогда
		//Ответ = Вопрос("Изменить название на этикетке?", РежимДиалогаВопрос.ДаНет);
		
		
		Возврат;
	КонецЕсли;
	
	Объект.НазваниеНаЭтикетке = Объект.Наименование;

КонецПроцедуры // НаименованиеПриИзмененииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШтрихКоды
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

