
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!

	// регістр ТекущееСостояниеОборудования
	Движения.ТекущееСостояниеОборудования.Записывать = Истина;
	Для Каждого ТекСтрокаСписок Из Список Цикл
		Движение = Движения.ТекущееСостояниеОборудования.Добавить();
		Движение.Период = Дата;
		Движение.ДатаИзминения = Дата;
		Движение.Оборудование = ТекСтрокаСписок.Оборудование;
		Движение.Состояние = ТекСтрокаСписок.Состояние;
		Движение.Местоположение = ТекСтрокаСписок.Местоположение;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
