
#Область ПроцедурыИФункцииРаботыСШтрихкодами

//Демо процедура заполнения структуры прайс-листа при выгрузке методом GetPriceList web-сервиса EquipmentService
//так же используется при выгрузке на ККМ Offline при использовании драйвера 1С:ККМ Offline
//Для заполнения используются подготовленные пустые структуры получаемые функциями из модуля МенеджерОборудованияСервисыКлиентСервер
//
Процедура ЗаполнитьПрайсЛист(ИДУстройства, ПрайсЛист, ПолнаяВыгрузка) Экспорт
	
	///////////////
	// Товар (без характеристик, без упаковок)
	ЗаписьТовара = МенеджерОфлайнОборудования.ЗаписьТовараПрайсЛиста();
	
	ЗаписьТовара.Код = "100";
	
	// Штрихкод
	ЗаписьШтрихкода = МенеджерОфлайнОборудования.ЗаписьШтрихкодаПрайсЛиста();
	ЗаписьШтрихкода.Штрихкод = "2000019197966";
	ЗаписьШтрихкода.ТипШтрихкода = "EAN13";
	ЗаписьТовара.Штрихкоды.Добавить(ЗаписьШтрихкода);
	
	ЗаписьШтрихкода = МенеджерОфлайнОборудования.ЗаписьШтрихкодаПрайсЛиста();
	ЗаписьШтрихкода.Штрихкод = "2100020307795";
	ЗаписьТовара.Штрихкоды.Добавить(ЗаписьШтрихкода);
	
	ЗаписьТовара.Цена = 2480;
	ЗаписьТовара.Остаток = 5;
	ЗаписьТовара.УникальныйИдентификатор = Новый УникальныйИдентификатор("204ddd0f-db2c-4e5b-8b30-7a0f2f71875a");
	ЗаписьТовара.Наименование = "Вентилятор настольный";
	ЗаписьТовара.СтавкаНДС = МенеджерОфлайнОборудования.СтавкаНДС20();
	ЗаписьТовара.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	
	ЗаписьТовара.КодЕдиницыИзмерения = "1";
	ЗаписьТовара.УникальныйИдентификаторЕдиницыИзмерения = Новый УникальныйИдентификатор("b63f92f6-d8bf-4921-812e-50c01515cc2f");
	
	ЗаписьТовара.КодГруппы = "1";
	ЗаписьТовара.УникальныйИдентификаторГруппы = Новый УникальныйИдентификатор("0608b9cb-ba98-431c-b560-a288f6d43ffc");
	
	ЗаписьТовара.Артикул = "ВН-900";
	ЗаписьТовара.Описание = "3 скорости";
	ЗаписьТовара.ЭтоВесовойТовар = Ложь;
	
	ЗаписьТовара.НомерСекции = 1;
	
	ПрайсЛист.Товары.Добавить(ЗаписьТовара);
	
	
	///////////////
	// Табак
	ЗаписьТовара = МенеджерОфлайнОборудования.ЗаписьТовараПрайсЛиста();
	
	ЗаписьТовара.Код = "100";
	
	// Штрихкод
	
	ЗаписьШтрихкода = МенеджерОфлайнОборудования.ЗаписьШтрихкодаПрайсЛиста();
	ЗаписьШтрихкода.Штрихкод = "210000773498";
	ЗаписьТовара.Штрихкоды.Добавить(ЗаписьШтрихкода);
	
	ЗаписьТовара.Цена = 130;
	ЗаписьТовара.Остаток = 17;
	ЗаписьТовара.УникальныйИдентификатор = Новый УникальныйИдентификатор("204ddd0f-db2c-4e5b-8b30-7a0f2f71825a");
	ЗаписьТовара.Наименование = "Маяльборо";
	ЗаписьТовара.СтавкаНДС = МенеджерОфлайнОборудования.СтавкаНДС20();
	ЗаписьТовара.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	
	ЗаписьТовара.КодЕдиницыИзмерения = "1";
	ЗаписьТовара.УникальныйИдентификаторЕдиницыИзмерения = Новый УникальныйИдентификатор("b63f92f6-d8bf-4921-812e-50c01515cc2f");
	
	ЗаписьТовара.КодГруппы = "1";
	ЗаписьТовара.УникальныйИдентификаторГруппы = Новый УникальныйИдентификатор("0608b9cb-ba98-431c-b560-a288f6d43ffc");
	
	ЗаписьТовара.Артикул = "Красный";
	ЗаписьТовара.НомерСекции = 1;
	
	ЗаписьТовара.ЭтоМаркированнаяПродукция = Истина;
	ЗаписьТовара.ТипМаркированнойПродукции = Перечисления.ТипыМаркировкиККТ.ТабачнаяПродукция;
	
	ПрайсЛист.Товары.Добавить(ЗаписьТовара);
	
	
	///////////////
	// Товар алкоголь
	ЗаписьТовара = МенеджерОфлайнОборудования.ЗаписьТовараПрайсЛиста();
	
	ЗаписьТовара.Код = "200";
	
	// Штрихкод
	ЗаписьШтрихкода = МенеджерОфлайнОборудования.ЗаписьШтрихкодаПрайсЛиста();
	ЗаписьШтрихкода.Штрихкод = "2100020307801";
	ЗаписьТовара.Штрихкоды.Добавить(ЗаписьШтрихкода);
	
	ЗаписьТовара.Цена = 1444;
	ЗаписьТовара.Остаток = 3;
	ЗаписьТовара.УникальныйИдентификатор = Новый УникальныйИдентификатор("8194894a-5b38-41a3-910d-fa93f63580d2");
	ЗаписьТовара.Наименование = "Настойка горькая ""Лесной ручей кедровая""";
	ЗаписьТовара.СтавкаНДС = МенеджерОфлайнОборудования.СтавкаНДС18();
	ЗаписьТовара.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПодакцизныйТовар;
	
	ЗаписьТовара.КодЕдиницыИзмерения = "1";
	ЗаписьТовара.УникальныйИдентификаторЕдиницыИзмерения = Новый УникальныйИдентификатор("b63f92f6-d8bf-4921-812e-50c01515cc2f");
	
	ЗаписьТовара.КодГруппы = "2";
	ЗаписьТовара.УникальныйИдентификаторГруппы = Новый УникальныйИдентификатор("0a18372d-3f06-4580-899a-b520ac9f241f");
	
	ЗаписьТовара.НомерСекции = 2;
	
	ЗаписьТовара.ЭтоАлкоголь = Истина;
	ЗаписьТовара.АлкогольныеРеквизиты.Маркируемый = Истина;
	ЗаписьТовара.АлкогольныеРеквизиты.КодВидаАлкогольнойПродукции = "229";
	ЗаписьТовара.АлкогольныеРеквизиты.ЕмкостьТары = 0.5;
	ЗаписьТовара.АлкогольныеРеквизиты.Крепость = 40;
	ЗаписьТовара.АлкогольныеРеквизиты.ИННПроизводителя = "1111111111";
	ЗаписьТовара.АлкогольныеРеквизиты.КПППроизводителя = "222222222";
	ЗаписьТовара.АлкогольныеРеквизиты.ВРозлив = Ложь;
	
	ПрайсЛист.Товары.Добавить(ЗаписьТовара);
	
	
	
	///////////////
	// Товар (с характеристикам, без упаковок)
	ЗаписьТовара = МенеджерОфлайнОборудования.ЗаписьТовараПрайсЛиста();
	
	ЗаписьТовара.УникальныйИдентификатор = Новый УникальныйИдентификатор("204ddd0f-db2c-4e5b-8b30-7a0f2f71875a");
	ЗаписьТовара.Наименование = "Куртка";
	ЗаписьТовара.СтавкаНДС = МенеджерОфлайнОборудования.СтавкаНДС18();
	ЗаписьТовара.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	
	ЗаписьТовара.КодЕдиницыИзмерения = "1";
	ЗаписьТовара.УникальныйИдентификаторЕдиницыИзмерения = Новый УникальныйИдентификатор("b63f92f6-d8bf-4921-812e-50c01515cc2f");
	
	ЗаписьТовара.КодГруппы = "1";
	ЗаписьТовара.УникальныйИдентификаторГруппы = Новый УникальныйИдентификатор("0608b9cb-ba98-431c-b560-a288f6d43ffc");
	ЗаписьТовара.Артикул = "К-3140 ";
	
	ЗаписьТовара.НомерСекции = 1;
	
	// Характеристика
	ЗаписьТовара.ИмеетХарактеристики = Истина;
		ЗаписьХарактеристики = МенеджерОфлайнОборудования.ЗаписьХарактеристикиПрайсЛиста();
		ЗаписьХарактеристики.Код = "300";
		
		// штрихкод
		ЗаписьШтрихкода = МенеджерОфлайнОборудования.ЗаписьШтрихкодаПрайсЛиста();
		ЗаписьШтрихкода.Штрихкод = "2500001006769";
		ЗаписьХарактеристики.Штрихкоды.Добавить(ЗаписьШтрихкода);
		
		ЗаписьХарактеристики.УникальныйИдентификатор = Новый УникальныйИдентификатор("b358867a-8c94-4658-be01-066c1cdffe28");
		ЗаписьХарактеристики.Наименование = "Белая";
		ЗаписьХарактеристики.Цена = 1299;
		ЗаписьХарактеристики.Остаток = 15;
		
		ЗаписьТовара.Характеристики.Добавить(ЗаписьХарактеристики);
		
	// Характеристика
		ЗаписьХарактеристики = МенеджерОфлайнОборудования.ЗаписьХарактеристикиПрайсЛиста();
		ЗаписьХарактеристики.Код = "400";
		
		// штрихкод
		ЗаписьШтрихкода = МенеджерОфлайнОборудования.ЗаписьШтрихкодаПрайсЛиста();
		ЗаписьШтрихкода.Штрихкод = "2100020307818";
		ЗаписьХарактеристики.Штрихкоды.Добавить(ЗаписьШтрихкода);
		
		ЗаписьХарактеристики.УникальныйИдентификатор = Новый УникальныйИдентификатор("b333910f-d65d-4344-9919-99d3d4f43619");
		ЗаписьХарактеристики.Наименование = "Черная";
		ЗаписьХарактеристики.Цена = 1350;
		ЗаписьХарактеристики.Остаток = 10;
		
		ЗаписьТовара.Характеристики.Добавить(ЗаписьХарактеристики);
		
	ПрайсЛист.Товары.Добавить(ЗаписьТовара);
	
	
	
	///////////////
	// Товар (без характеристик, с упаковками)
	ЗаписьТовара = МенеджерОфлайнОборудования.ЗаписьТовараПрайсЛиста();
	
	ЗаписьТовара.УникальныйИдентификатор = Новый УникальныйИдентификатор("92970ed7-f747-4db8-8160-fb357f456b18");
	ЗаписьТовара.Наименование = "Шоколадный батончик";
	ЗаписьТовара.СтавкаНДС = МенеджерОфлайнОборудования.СтавкаНДС0();
	ЗаписьТовара.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	
	ЗаписьТовара.КодЕдиницыИзмерения = "1";
	ЗаписьТовара.УникальныйИдентификаторЕдиницыИзмерения = Новый УникальныйИдентификатор("b63f92f6-d8bf-4921-812e-50c01515cc2f");
	
	ЗаписьТовара.КодГруппы = "1";
	ЗаписьТовара.УникальныйИдентификаторГруппы = Новый УникальныйИдентификатор("0608b9cb-ba98-431c-b560-a288f6d43ffc");
	
	ЗаписьТовара.НомерСекции = 1;
	
	
	// Базовая ЕИ
	ЗаписьТовара.Код = "500";
	// штрихкод
	ЗаписьШтрихкода = МенеджерОфлайнОборудования.ЗаписьШтрихкодаПрайсЛиста();
	ЗаписьШтрихкода.Штрихкод = "2100020307832";
	ЗаписьТовара.Штрихкоды.Добавить(ЗаписьШтрихкода);
	
	ЗаписьТовара.Цена = 10;
	ЗаписьТовара.Остаток = 20;
	
	
	// Упаковка
	ЗаписьТовара.ИмеетУпаковки = Истина;
	
		ЗаписьУпаковки = МенеджерОфлайнОборудования.ЗаписьУпаковкиПрайсЛиста();
		ЗаписьУпаковки.Код = "510";
		ЗаписьУпаковки.Наименование = "Упаковка";
		ЗаписьУпаковки.Коэффициент = 24;
		ЗаписьУпаковки.УникальныйИдентификатор = Новый УникальныйИдентификатор("1e61fdfa-0dc3-43cf-a885-e9e0e33f83ae");
		
		// штрихкод
		ЗаписьШтрихкода = МенеджерОфлайнОборудования.ЗаписьШтрихкодаПрайсЛиста();
		ЗаписьШтрихкода.Штрихкод = "2100020307825";
		ЗаписьУпаковки.Штрихкоды.Добавить(ЗаписьШтрихкода);
		
		ЗаписьУпаковки.Цена = 240;
		ЗаписьУпаковки.Остаток = 8;
		
		ЗаписьТовара.Упаковки.Добавить(ЗаписьУпаковки);
		
	ПрайсЛист.Товары.Добавить(ЗаписьТовара);
	
	
	
	///////////////
	// Товар (с характеристиками, с упаковками)
	ЗаписьТовара = МенеджерОфлайнОборудования.ЗаписьТовараПрайсЛиста();
	
	ЗаписьТовара.УникальныйИдентификатор = Новый УникальныйИдентификатор("6b60380c-bce8-44db-bf94-7957572d2afe");
	ЗаписьТовара.Наименование = "Футболка";
	ЗаписьТовара.СтавкаНДС = МенеджерОфлайнОборудования.СтавкаНДС10();
	ЗаписьТовара.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	
	ЗаписьТовара.КодЕдиницыИзмерения = "1";
	ЗаписьТовара.УникальныйИдентификаторЕдиницыИзмерения = Новый УникальныйИдентификатор("b63f92f6-d8bf-4921-812e-50c01515cc2f");
	
	ЗаписьТовара.КодГруппы = "1";
	ЗаписьТовара.УникальныйИдентификаторГруппы = Новый УникальныйИдентификатор("0608b9cb-ba98-431c-b560-a288f6d43ffc");
	
	ЗаписьТовара.НомерСекции = 1;
	
	// Характеристика
	ЗаписьТовара.ИмеетХарактеристики = Истина;
	
		ЗаписьХарактеристики = МенеджерОфлайнОборудования.ЗаписьХарактеристикиПрайсЛиста();
		
		ЗаписьХарактеристики.УникальныйИдентификатор = Новый УникальныйИдентификатор("f7f92464-b12a-4ee5-b055-49c0ed781685");
		ЗаписьХарактеристики.Наименование = "Желтая";
		ЗаписьХарактеристики.ИмеетУпаковки = Истина;
		
		// Базовая ЕИ
		ЗаписьХарактеристики.Код = "900";
		// штрихкод
		ЗаписьШтрихкода = МенеджерОфлайнОборудования.ЗаписьШтрихкодаПрайсЛиста();
		ЗаписьШтрихкода.Штрихкод = "20009656";
		ЗаписьХарактеристики.Штрихкоды.Добавить(ЗаписьШтрихкода);
		
		ЗаписьХарактеристики.Цена = 300;
		ЗаписьХарактеристики.Остаток = 2;
		
		// Упаковка
		ЗаписьУпаковки = МенеджерОфлайнОборудования.ЗаписьУпаковкиПрайсЛиста();
			ЗаписьУпаковки.Код = "700";
			ЗаписьУпаковки.Наименование = "Коробка бол.";
			ЗаписьУпаковки.Коэффициент = 10;
			ЗаписьУпаковки.УникальныйИдентификатор = Новый УникальныйИдентификатор("3d66f6f8-d70b-46e9-848e-78ed3199936b");
			
			ЗаписьУпаковки.Цена = 3000;
			ЗаписьУпаковки.Остаток = 5;
			
			ЗаписьХарактеристики.Упаковки.Добавить(ЗаписьУпаковки);
		
		// Упаковка
		ЗаписьУпаковки = МенеджерОфлайнОборудования.ЗаписьУпаковкиПрайсЛиста();
			ЗаписьУпаковки.Код = "800";
			ЗаписьУпаковки.Наименование = "Коробка мал.";
			ЗаписьУпаковки.Коэффициент = 5;
			ЗаписьУпаковки.УникальныйИдентификатор = Новый УникальныйИдентификатор("f4cad1ba-0b59-4945-8050-07a548ad2030");
			
			ЗаписьУпаковки.Цена = 1500;
			ЗаписьУпаковки.Остаток = 10;
		
			ЗаписьХарактеристики.Упаковки.Добавить(ЗаписьУпаковки);
		
		ЗаписьТовара.Характеристики.Добавить(ЗаписьХарактеристики);
		
	ПрайсЛист.Товары.Добавить(ЗаписьТовара);
	
	///////////////
	// Агентская услуга 
	ЗаписьТовара = МенеджерОфлайнОборудования.ЗаписьТовараПрайсЛиста();
	
	ЗаписьТовара.Код = "600";
	
	ЗаписьТовара.УникальныйИдентификатор = Новый УникальныйИдентификатор("204ddd0f-db2c-4e5b-8b30-7a0f2f71875a");
	ЗаписьТовара.Наименование = "Платеж";
	ЗаписьТовара.СтавкаНДС = МенеджерОфлайнОборудования.СтавкаНДС18();
	ЗаписьТовара.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
	
	ЗаписьТовара.КодГруппы = "3";
	ЗаписьТовара.УникальныйИдентификаторГруппы = Новый УникальныйИдентификатор("20516af3-b275-498b-9b03-23ab14e8c958");
	
	ЗаписьТовара.КодДанныхАгента = "33";
	ЗаписьТовара.УникальныйИдентификаторДанныхАгента = Новый УникальныйИдентификатор("45872fc3-767d-49d2-926c-45dcd91adc27");
	
	ЗаписьТовара.КодДанныхПоставщика = "44";
	ЗаписьТовара.УникальныйИдентификаторДанныхПоставщика = Новый УникальныйИдентификатор("6982860e-7655-4648-9547-3259bd8d0914");
	
	ПрайсЛист.Товары.Добавить(ЗаписьТовара);
	
	//////////
	// Группы товаров
	
	//
	ЗаписьГруппы = МенеджерОфлайнОборудования.ЗаписьГруппыТоваровПрайсЛиста();
	
	ЗаписьГруппы.Код = "10";
	ЗаписьГруппы.Наименование = "Общая группа";
	ЗаписьГруппы.УникальныйИдентификатор = Новый УникальныйИдентификатор("253f7757-d94d-44ea-a237-086a6cf5b0e1");
	
	ПрайсЛист.ГруппыТоваров.Добавить(ЗаписьГруппы);
	
	
	//
	ЗаписьГруппы = МенеджерОфлайнОборудования.ЗаписьГруппыТоваровПрайсЛиста();
	
	ЗаписьГруппы.Код = "1";
	ЗаписьГруппы.Наименование = "Прочие товары";
	ЗаписьГруппы.УникальныйИдентификатор = Новый УникальныйИдентификатор("444da10c-de67-46c9-b0fc-0c86d89a96aa");
	ЗаписьГруппы.КодГруппы = "10";
	ЗаписьГруппы.УникальныйИдентификаторГруппы = Новый УникальныйИдентификатор("253f7757-d94d-44ea-a237-086a6cf5b0e1");
	
	ПрайсЛист.ГруппыТоваров.Добавить(ЗаписьГруппы);
	
	
	//
	ЗаписьГруппы = МенеджерОфлайнОборудования.ЗаписьГруппыТоваровПрайсЛиста();
	
	ЗаписьГруппы.Код = "2";
	ЗаписьГруппы.Наименование = "Алкоголь";
	ЗаписьГруппы.УникальныйИдентификатор = Новый УникальныйИдентификатор("46007263-6070-4c13-8a58-f5258c9c34b8");
	ЗаписьГруппы.КодГруппы = "10";
	ЗаписьГруппы.УникальныйИдентификаторГруппы = Новый УникальныйИдентификатор("253f7757-d94d-44ea-a237-086a6cf5b0e1");
	
	ПрайсЛист.ГруппыТоваров.Добавить(ЗаписьГруппы);
	
	//
	ЗаписьГруппы = МенеджерОфлайнОборудования.ЗаписьГруппыТоваровПрайсЛиста();
	
	ЗаписьГруппы.Код = "3";
	ЗаписьГруппы.Наименование = "Агентские услуги";
	ЗаписьГруппы.УникальныйИдентификатор = Новый УникальныйИдентификатор("20516af3-b275-498b-9b03-23ab14e8c958");
	ЗаписьГруппы.КодГруппы = "10";
	ЗаписьГруппы.УникальныйИдентификаторГруппы = Новый УникальныйИдентификатор("253f7757-d94d-44ea-a237-086a6cf5b0e1");
	
	ПрайсЛист.ГруппыТоваров.Добавить(ЗаписьГруппы);
	
	
	//////////
	// Единицы измерения
	
	ЗаписьЕИ = МенеджерОфлайнОборудования.ЗаписьЕдиницыИзмеренияПрайсЛиста();
	
	ЗаписьЕИ.Код = "1";
	ЗаписьЕИ.Наименование = "шт.";
	ЗаписьЕИ.УникальныйИдентификатор = Новый УникальныйИдентификатор("b63f92f6-d8bf-4921-812e-50c01515cc2f");
	ЗаписьЕИ.КодОКЕИ = "796";
	
	ПрайсЛист.ЕдиницыИзмерения.Добавить(ЗаписьЕИ);

	
	/////////
	// Данные агентов
	
	ЗаписьДанныхАгента = МенеджерОфлайнОборудования.ЗаписьДанныхАгентаПрайсЛиста();
	
	ЗаписьДанныхАгента.Код = "33";
	ЗаписьДанныхАгента.УникальныйИдентификатор = Новый УникальныйИдентификатор("45872fc3-767d-49d2-926c-45dcd91adc27");
	ЗаписьДанныхАгента.ПризнакАгента = Перечисления.ПризнакиАгента.ПлатежныйАгент;
	// Платежный агент
	ЗаписьДанныхАгента.ОперацияПлатежногоАгента = "Операция платежного агента";
	ЗаписьДанныхАгента.ТелефонПлатежногоАгента = "777 555 55 77";
	// Оператор перевода
	ЗаписьДанныхАгента.ТелефонОператораПеревода = "777 555 55 66";
	ЗаписьДанныхАгента.НаименованиеОператораПеревода = "Наименование оператора";
	ЗаписьДанныхАгента.АдресОператораПеревода = "Москва, ул. Ленина 1";
	ЗаписьДанныхАгента.ИННОператораПеревода = "5555555555";
	// Оператор по приему платежей
	ЗаписьДанныхАгента.ТелефонОператораПоПриемуПлатежей = "777 555 55 55";
	
	ПрайсЛист.ДанныеАгентов.Добавить(ЗаписьДанныхАгента);
	
	
	/////////
	// Данные поставщиков
	
	ЗаписьДанныхПоставщика = МенеджерОфлайнОборудования.ЗаписьДанныхПоставщикаПрайсЛиста();
	
	ЗаписьДанныхПоставщика.Код = "44";
	ЗаписьДанныхПоставщика.УникальныйИдентификатор = Новый УникальныйИдентификатор("6982860e-7655-4648-9547-3259bd8d0914");
	ЗаписьДанныхПоставщика.ТелефонПоставщика = "777 555 55 45";
	ЗаписьДанныхПоставщика.НаименованиеПоставщика = "Ладушки";
	ЗаписьДанныхПоставщика.ИННПоставщика = "0001110101";
	
	ПрайсЛист.ДанныеПоставщиков.Добавить(ЗаписьДанныхПоставщика);
	
КонецПроцедуры

//Демо процедура заполнения структуры товара при выгрузке методом GetGood web-сервиса EquipmentService
Процедура ЗаполнитьТовар(ИДУстройства, ПрайсЛист, Штрихкод) Экспорт
	
	///////////////
	// Товар (без характеристик, без упаковок)
	ЗаписьТовара = МенеджерОфлайнОборудования.ЗаписьТовараПрайсЛиста();
	
	ЗаписьТовара.Код = "100";
	
	// Штрихкод
	
	ЗаписьШтрихкода = МенеджерОфлайнОборудования.ЗаписьШтрихкодаПрайсЛиста();
	ЗаписьШтрихкода.Штрихкод = "2100020307795";
	ЗаписьТовара.Штрихкоды.Добавить(ЗаписьШтрихкода);
	
	ЗаписьТовара.Цена = 2480;
	ЗаписьТовара.Остаток = 5;
	ЗаписьТовара.УникальныйИдентификатор = Новый УникальныйИдентификатор("204ddd0f-db2c-4e5b-8b30-7a0f2f71875a");
	ЗаписьТовара.Наименование = "Вентилятор настольный";
	ЗаписьТовара.СтавкаНДС = МенеджерОфлайнОборудования.СтавкаНДС18();
	ЗаписьТовара.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	
	ЗаписьТовара.КодЕдиницыИзмерения = "1";
	ЗаписьТовара.УникальныйИдентификаторЕдиницыИзмерения = Новый УникальныйИдентификатор("b63f92f6-d8bf-4921-812e-50c01515cc2f");
		
	ЗаписьТовара.Артикул = "ВН-900";
	ЗаписьТовара.Описание = "3 скорости";
	ЗаписьТовара.ЭтоВесовойТовар = Ложь;
	
	ЗаписьТовара.НомерСекции = 1;
	
	ПрайсЛист.Товары.Добавить(ЗаписьТовара);
	
	
	//////////
	// Единицы измерения
	
	ЗаписьЕИ = МенеджерОфлайнОборудования.ЗаписьЕдиницыИзмеренияПрайсЛиста();
	
	ЗаписьЕИ.Код = "1";
	ЗаписьЕИ.Наименование = "шт.";
	ЗаписьЕИ.УникальныйИдентификатор = Новый УникальныйИдентификатор("b63f92f6-d8bf-4921-812e-50c01515cc2f");
	ЗаписьЕИ.КодОКЕИ = "796";
	
	ПрайсЛист.ЕдиницыИзмерения.Добавить(ЗаписьЕИ);

КонецПроцедуры

//Демо процедура заполнения ответа web-сервиса EquipmentService на вызов метода PostDocs
//В процедуру, через параметр "Документы", передается структура принимаемых документов.
Процедура ЗагрузитьДокумент(ИДУстройства, СтруктураОтвета, Документы) Экспорт
	
	СтруктураОтвета.Успешно = Истина;
	СтруктураОтвета.Описание = "Документы успешно загружены";
	
	СтруктураОтвета.Успешно = Ложь;
	СтруктураОтвета.Описание = "Документы не загружены!";
	
КонецПроцедуры

//Демо процедура заполнения массива типов документов, поддерживаемых конфигурацией
//Вызывается методом GetDocTypes web-сервиса EquipmentService.
Процедура ЗаполнитьЗаказы(ИДУстройства, Заказы) Экспорт
	
	НовыйЗаказ = МенеджерОфлайнОборудования.ЗаписьЗаказа();
	
	НовыйЗаказ.НомерЗаказа = 15;
	НовыйЗаказ.ДатаЗаказа = ТекущаяДата();
	НовыйЗаказ.ГородДоставки = "Москва";
	НовыйЗаказ.УлицаДоставки = "Кирова";
	НовыйЗаказ.НомерДомаДоставки = "9";
	НовыйЗаказ.НомерКвартирыДоставки = "5";
	НовыйЗаказ.НомерПодъездаДоставки = "6";
	НовыйЗаказ.НомерЭтажаДоставки = "2";
	НовыйЗаказ.НомерТелефонаКлиента = "4957244549";
	НовыйЗаказ.EmailКлиента = "adress_email@yandex.com";
	НовыйЗаказ.ДатаДоставки = ТекущаяДата();
	НовыйЗаказ.СтатусЗаказа = "Согласован";
	НовыйЗаказ.Комментарий = "Подъем на этаж";
	НовыйЗаказ.ИмяКлиента = "Петр";
	НовыйЗаказ.ФамилияКлиента = "Петров";
	НовыйЗаказ.УникальныйИдентификатор = Новый УникальныйИдентификатор("da85c628-560e-4a55-8c54-ee2b40a43995");
	
	НовыйТовар = МенеджерОфлайнОборудования.ЗаписьТовараЗаказа();
	НовыйТовар.Код 			= "100";
	НовыйТовар.Количество 	= 2;
	НовыйТовар.Цена 		= 2480;
	НовыйТовар.Сумма 		= 4960;
	НовыйТовар.УникальныйИдентификаторТовара = Новый УникальныйИдентификатор("204ddd0f-db2c-4e5b-8b30-7a0f2f71875a");
	
	НовыйЗаказ.Товары.Добавить(НовыйТовар);
	
	НовыйТовар = МенеджерОфлайнОборудования.ЗаписьТовараЗаказа();
	НовыйТовар.Код = "400";
	НовыйТовар.Количество = 3;
	НовыйТовар.Цена = 240;
	НовыйТовар.Сумма = 720;
	НовыйТовар.УникальныйИдентификаторТовара = Новый УникальныйИдентификатор("92970ed7-f747-4db8-8160-fb357f456b18");
	НовыйТовар.УникальныйИдентификаторУпаковки = Новый УникальныйИдентификатор("1e61fdfa-0dc3-43cf-a885-e9e0e33f83ae");
	
	НовыйЗаказ.Товары.Добавить(НовыйТовар);
	
	НоваяОплата = МенеджерОфлайнОборудования.ЗаписьОплатыЗаказа();
	НоваяОплата.СуммаНаличнойОплаты = 0;
	НоваяОплата.СуммаЭлектроннойОплаты = 2000;
	НоваяОплата.СуммаПредоплатой = 0;
	НоваяОплата.СуммаПостоплатой = 0;
	НоваяОплата.СуммаВстречнымПредоставлением = 0;
	НоваяОплата.КодВидаЭлектроннойОплаты = "1";
	НоваяОплата.УникальныйИдентификаторВидаЭлектроннойОплаты = Новый УникальныйИдентификатор("aa7c50b8-028c-4746-83a4-a72c29048e80");
	
	НовыйЗаказ.Оплаты.Добавить(НоваяОплата);
	
	Заказы.Добавить(НовыйЗаказ);
	
КонецПроцедуры

//Демо процедура заполнения структуры настроек при выгрузке методом GetSettings web-сервиса EquipmentService
//так же используется при выгрузке на ККМ Offline при использовании драйвера 1С:ККМ Offline
//Для заполнения используются подготовленные пустые структуры получаемые функциями из модуля МенеджерОборудованияСервисыКлиентСервер.
//
Процедура ЗаполнитьНастройкиККМ(ИДУстройства, НастройкиККМ) Экспорт
	
	НастройкиККМ.НаименованиеОрганизации = "Ромашка";
	НастройкиККМ.НаименованиеМагазина = "Одуванчик";
	
	НастройкиККМ.ИНН = "123456789012";
	НастройкиККМ.КПП = "987654321098";
	НастройкиККМ.АдресТочкиПродажи = "Москва, Дмитровское шоссе д.9";
	НастройкиККМ.МестоТочкиПродажи = "4 этаж";
	НастройкиККМ.ЭлектроннаяПочтаОтправителяЧека = "test@1c.ru";
	
	// Системы налогообложения
	НастройкиККМ.СистемыНалогообложения.Добавить(Перечисления.ТипыСистемНалогообложенияККТ.ОСН);
	НастройкиККМ.СистемыНалогообложения.Добавить(Перечисления.ТипыСистемНалогообложенияККТ.ЕСН);
	НастройкиККМ.СистемыНалогообложения.Добавить(Перечисления.ТипыСистемНалогообложенияККТ.Патент);
	
	
	// Виды электронной оплаты
	
	// Карта Мир
	ВидЭлектроннойОплаты = МенеджерОфлайнОборудования.ЗаписьВидЭлектроннойОплаты();
	ВидЭлектроннойОплаты.Код = "1";
	ВидЭлектроннойОплаты.Наименование = "Карта Мир";
	ВидЭлектроннойОплаты.ТипЭлектроннойОплаты = МенеджерОфлайнОборудования.ТипЭлектроннойОплатыПлатежнаяКарта();
	ВидЭлектроннойОплаты.УникальныйИдентификатор = "aa7c50b8-028c-4746-83a4-a72c29048e80";
	
	НастройкиККМ.ВидыЭлектроннойОплаты.Добавить(ВидЭлектроннойОплаты);
	
	// Карта Visa
	ВидЭлектроннойОплаты = МенеджерОфлайнОборудования.ЗаписьВидЭлектроннойОплаты();
	ВидЭлектроннойОплаты.Код = "2";
	ВидЭлектроннойОплаты.Наименование = "Карта Visa";
	ВидЭлектроннойОплаты.ТипЭлектроннойОплаты = МенеджерОфлайнОборудования.ТипЭлектроннойОплатыПлатежнаяКарта();
	ВидЭлектроннойОплаты.УникальныйИдентификатор = "e20797dc-ccd1-4cbe-b211-b780188e2eaa";
	
	НастройкиККМ.ВидыЭлектроннойОплаты.Добавить(ВидЭлектроннойОплаты);
	
КонецПроцедуры

// Демо процедура вызываемая при загрузке данных о продажах из оборудования. Тип офлайн оборудования: ККМ
// Вызывается при файловом или Web-сервис обмене (метод EquipmentService.PostDocs, DocType = "SalesReport").
//
// Параметры:
//   ОфлайнОборудование - СправочникСсылка.ПодключаемоеОборудование - ссылка на экземпляр оборудования.
//   ДанныеОПродажах - Структура - полученные данные из офлайн оборудования для загрузки в прикладную конфигурацию
//   Отказ - Булево - признак возникновения ошибки при загрузке в прикладной конфигурации,
//                    если Отказ не установлен Истина, то загружаемый пакет данных помечается как обработанный.
//   СообщениеОбОшибке - Строка - сообщение выводимое пользователю если Отказ = Истина
//
Процедура ПриЗагрузкеДанныхОПродажахИзККМ(ОфлайнОборудование, ДанныеОПродажах, Отказ, СообщениеОбОшибке) Экспорт
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Код",        Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Цена",       Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Скидка",     Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Сумма",      Новый ОписаниеТипов("Число"));

	Для Каждого ОтчетОПродажах Из ДанныеОПродажах Цикл
		
		Если НЕ ОтчетОПродажах.СтатусСмены = Перечисления.СтатусыКассовойСмены.Закрыта Тогда
			Продолжить;
		КонецЕсли;
		
		ОтчетОРозничныхПродажахОбъект = Документы._ДемоОтчетОПродажах.СоздатьДокумент();
		ОтчетОРозничныхПродажахОбъект.Дата        = ОтчетОПродажах.ДатаЗакрытияСмены;
		ОтчетОРозничныхПродажахОбъект.Комментарий = НСтр("ru = 'Номер смены:'") + ОтчетОПродажах.НомерСмены;
		ОтчетОРозничныхПродажахОбъект.ФормаОплаты = Перечисления.ТипыОплатыККТ.Наличные; 
		
		ТаблицаТоваров.Очистить();
		
		Для Каждого ЧекиПродажи Из ОтчетОПродажах.Чеки Цикл
			// Перебираем товары из каждого чека
			Для Каждого СтрокаТЧ Из ЧекиПродажи.Товары Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.Код        = СтрокаТЧ.Код;
				НоваяСтрока.Цена       = СтрокаТЧ.Цена;
				НоваяСтрока.Количество = СтрокаТЧ.Количество;
				НоваяСтрока.Сумма      = СтрокаТЧ.Сумма;
			КонецЦикла
			
		КонецЦикла;
	
		ТаблицаТоваров.Свернуть("Код, Цена, Скидка", "Количество, Сумма");
	
		Запрос = Новый Запрос(
	
		"ВЫБРАТЬ
		|	Товары.Код КАК Код,
		|	Товары.Цена КАК Цена,
		|	Товары.Количество КАК Количество,
		|	Товары.Скидка КАК Скидка,
		|	Товары.Сумма КАК Сумма
		|ПОМЕСТИТЬ Товары         
		|ИЗ &ТаблицаЗначений КАК Товары
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(_ДемоНоменклатура.Ссылка, ЗНАЧЕНИЕ(Справочник._ДемоНоменклатура.ПустаяСсылка))                 КАК Номенклатура,
		|	Товары.Количество КАК Количество,
		|	Товары.Цена       КАК Цена,
		|	Товары.Сумма      КАК Сумма,
		|	Товары.Скидка     КАК Скидка
		|ИЗ  Товары КАК Товары
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник._ДемоНоменклатура КАК _ДемоНоменклатура
		|	ПО Товары.Код = _ДемоНоменклатура.SKU");
		
		Запрос.УстановитьПараметр("ТаблицаЗначений", ТаблицаТоваров);
		ВыборкаПоТоварам = Запрос.Выполнить().Выбрать();
		Пока ВыборкаПоТоварам.Следующий() Цикл
			НоваяСтрока = ОтчетОРозничныхПродажахОбъект.Товары.Добавить();
			НоваяСтрока.Номенклатура         = ВыборкаПоТоварам.Номенклатура;
			НоваяСтрока.Количество           = ВыборкаПоТоварам.Количество;
			НоваяСтрока.Сумма                = ВыборкаПоТоварам.Сумма;
			НоваяСтрока.Цена                 = ВыборкаПоТоварам.Цена;
			НоваяСтрока.Скидка               = ВыборкаПоТоварам.Скидка;
		КонецЦикла;
		ОтчетОРозничныхПродажахОбъект.СуммаДокумента = ОтчетОРозничныхПродажахОбъект.Товары.Итог("Сумма");
		
		Попытка
			Если ОтчетОРозничныхПродажахОбъект.ПроверитьЗаполнение() Тогда
				ОтчетОРозничныхПродажахОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ОтчетОРозничныхПродажахОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		Исключение
			ОтчетОРозничныхПродажахОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
