#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ТаблицаПроверки.Очистить();;
	
	ПроверитьПодсистемыБПО();
	
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, Новый Структура("ТаблицаПроверки", ТаблицаПроверки));
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьПодсистемыБПО() Экспорт
	
	Данные = Новый Структура();
	Данные.Вставить("Замечания", Новый Массив());
	Данные.Вставить("ПодсистемыДемо", Новый Массив());
	Данные.Вставить("ПодсистемыБПО", Новый Массив());
	Данные.Вставить("ПодсистемыМеждународные", Новый Массив());
	Данные.Вставить("ПодсистемыЛокализация", Новый Массив());
	Данные.Вставить("ПодсистемыМобильная", Новый Массив());
	Данные.Вставить("ПодсистемыНеМобильная", Новый Массив());
	Данные.Вставить("ПодсистемыСтандартные", Новый Массив());
	ЗаполнитьПодсистемыРекурсивно(Данные.ПодсистемыДемо, Метаданные.Подсистемы._ДемоРаботаСОборудованием);
	ЗаполнитьПодсистемыРекурсивно(Данные.ПодсистемыБПО, Метаданные.Подсистемы.ПоддержкаОборудования);
	ЗаполнитьПодсистемыРекурсивно(Данные.ПодсистемыМеждународные, Метаданные.Подсистемы.СлужебныеПодсистемы.Подсистемы.ОбъектыМеждународные);
	ЗаполнитьПодсистемыРекурсивно(Данные.ПодсистемыЛокализация, Метаданные.Подсистемы.СлужебныеПодсистемы.Подсистемы.ОбъектыЛокализации);
	ЗаполнитьПодсистемыРекурсивно(Данные.ПодсистемыМобильная, Метаданные.Подсистемы.СлужебныеПодсистемы.Подсистемы.ОбъектыМобильная);
	ЗаполнитьПодсистемыРекурсивно(Данные.ПодсистемыНеМобильная, Метаданные.Подсистемы.СлужебныеПодсистемы.Подсистемы.ОбъектыИсключитьИзМобильной);
	ЗаполнитьПодсистемыРекурсивно(Данные.ПодсистемыСтандартные, Метаданные.Подсистемы.СтандартныеПодсистемы);
	
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ОбщиеМодули, "ОбщийМодуль");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ПараметрыСеанса, "ПараметрСеанса");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.Роли, "Роль");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ОбщиеРеквизиты, "ОбщийРеквизит");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ПланыОбмена, "ПланОбмена");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.КритерииОтбора, "КритерийОтбора");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ПодпискиНаСобытия, "ПодпискаНаСобытия");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.РегламентныеЗадания, "РегламентноеЗадание");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.Боты, "Бот");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ФункциональныеОпции, "ФункциональнаяОпция");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ПараметрыФункциональныхОпций, "ПараметрФункциональныхОпций");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ОпределяемыеТипы, "ОпределяемыйТип");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ХранилищаНастроек, "ХранилищеНастроек");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ОбщиеКоманды, "ОбщаяКоманда");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ГруппыКоманд, "ГруппаКоманд");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ОбщиеФормы, "ОбщаяФорма");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ОбщиеКартинки, "ОбщаяКартинка");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ПакетыXDTO, "ПакетXDTO");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.WebСервисы, "WebСервис");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.HTTPСервисы, "HTTPСервис");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.WSСсылки, "WSСсылка");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.СервисыИнтеграции, "СервисИнтеграции");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ЭлементыСтиля, "ЭлементСтиля");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.Стили, "Стиль");
	//ПроверитьОбъектыМетаданных(Данные, Метаданные.Языки, "Языки");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.Константы, "Константа");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.Справочники, "Справочник");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.Документы, "Документ");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.НумераторыДокументов, "НумераторДокументов");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.Последовательности, "Последовательность");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ЖурналыДокументов, "ЖурналДокументов");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.Перечисления, "Перечисление");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.Отчеты, "Отчет");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.Обработки, "Обработка");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ПланыВидовХарактеристик, "ПланВидовХарактеристик");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ПланыСчетов, "ПланСчетов");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ПланыВидовРасчета, "ПланВидовРасчета");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.РегистрыСведений, "РегистрСведений");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.РегистрыНакопления, "РегистрНакопления");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.РегистрыБухгалтерии, "РегистрБухгалтерии");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.РегистрыРасчета, "РегистрРасчета");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.БизнесПроцессы, "БизнесПроцесс");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.Задачи, "Задача");
	ПроверитьОбъектыМетаданных(Данные, Метаданные.ВнешниеИсточникиДанных, "ВнешнийИсточникДанных");
	
КонецПроцедуры

Процедура ДобавитьЗамечание(Тип, Имя, Замечание)
	
	Строка = ТаблицаПроверки.Добавить();
	Строка.ТипМетаданных = Тип;
	Строка.ИмяМетаданных = Имя;
	Строка.Замечание = Замечание;
	
КонецПроцедуры

Процедура ПроверитьОбъектыМетаданных(Данные, ОбъектыМетаданных, Тип)
	
	Для Каждого ОбъектМетаданных Из ОбъектыМетаданных Цикл
		Если ОбъектМетаданных.ПринадлежностьОбъекта = Метаданные.СвойстваОбъектов.ПринадлежностьОбъекта.Заимствованный Тогда
			Продолжить;
		КонецЕсли;
		
		Результат = РезультатВхожденияВПодсистемы(Данные, ОбъектМетаданных);
		Если Результат.ВходитВДемо И Не Результат.ПрефиксДемо И Не Результат.ВходитВБПО Тогда
			ДобавитьЗамечание(Тип, ОбъектМетаданных.Имя, "Входит в подсистему _Демо, не входит в подсистему БПО, но отсутсвует префикс _Демо");
		КонецЕсли;
		Если Результат.ПрефиксДемо И Не Результат.ВходитВДемо Тогда
			ДобавитьЗамечание(Тип, ОбъектМетаданных.Имя, "Имеет префикс _Демо но не входит в подсистему _Демо");
		КонецЕсли;
		Если Не Результат.ВходитВДемо И Не Результат.ВходитВБПО И Не Результат.ВходитВСтандартные Тогда
			ДобавитьЗамечание(Тип, ОбъектМетаданных.Имя, "Не входит в подсистему _Демо и не входит в подсистемы БПО и подсистему Стандартные");
		КонецЕсли;
		Если Не Результат.ВходитВМеждународные И Не Результат.ВходитВЛокализация Тогда
			ДобавитьЗамечание(Тип, ОбъектМетаданных.Имя, "Не входит в подсистему Международные или Локализация");
		КонецЕсли;
		Если Результат.ВходитВМеждународные И Результат.ВходитВЛокализация Тогда
			ДобавитьЗамечание(Тип, ОбъектМетаданных.Имя, "Входит в обе подсистемы Международные и Локализация");
		КонецЕсли;
		
		Если Не Результат.ВходитВМобильная И Не Результат.ВходитВНеМобильная Тогда
			ДобавитьЗамечание(Тип, ОбъектМетаданных.Имя, "Не входит в подсистему Мобильные или ИсключитьИзМобильной");
		КонецЕсли;
		Если Результат.ВходитВМобильная И Результат.ВходитВНеМобильная Тогда
			ДобавитьЗамечание(Тип, ОбъектМетаданных.Имя, "Входит в обе подсистемы Мобильные и ИсключитьИзМобильной");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция РезультатВхожденияВПодсистемы(Данные, ОбъектМетаданных)
	
	Результат = Новый Структура();
	Результат.Вставить("ВходитВДемо", ВходитВПодсистему(ОбъектМетаданных, Данные.ПодсистемыДемо));
	Результат.Вставить("ПрефиксДемо", ВРег(Лев(ОбъектМетаданных.Имя, 5)) = "_ДЕМО");
	Результат.Вставить("ВходитВБПО", ВходитВПодсистему(ОбъектМетаданных, Данные.ПодсистемыБПО));
	Результат.Вставить("ВходитВМеждународные", ВходитВПодсистему(ОбъектМетаданных, Данные.ПодсистемыМеждународные));
	Результат.Вставить("ВходитВЛокализация", ВходитВПодсистему(ОбъектМетаданных, Данные.ПодсистемыЛокализация));
	Результат.Вставить("ВходитВМобильная", ВходитВПодсистему(ОбъектМетаданных, Данные.ПодсистемыМобильная));
	Результат.Вставить("ВходитВНеМобильная", ВходитВПодсистему(ОбъектМетаданных, Данные.ПодсистемыНеМобильная));
	Результат.Вставить("ВходитВСтандартные", ВходитВПодсистему(ОбъектМетаданных, Данные.ПодсистемыСтандартные));
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПодсистемыРекурсивно(Подсистемы, МетаданныеПодсистема)
	
	Если ТипЗнч(Подсистемы) <> Тип("Массив") Тогда
		ВызватьИсключение НСтр("ru = 'Требуется массив в первом параметре процедуры.'");
	КонецЕсли;
	
	Подсистемы.Добавить(МетаданныеПодсистема);
	Для каждого ЭлементПодсистемы Из МетаданныеПодсистема.Подсистемы Цикл
		ЗаполнитьПодсистемыРекурсивно(Подсистемы, ЭлементПодсистемы);
	КонецЦикла;
	
КонецПроцедуры

Функция ВходитВПодсистему(ОбъектМетаданных, Подсистемы)
	
	Для каждого Подсистема Из Подсистемы Цикл
		
		Результат = Подсистема.Состав.Содержит(ОбъектМетаданных);
		Если Результат Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Иначе

#Область Инициализация

ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");

#КонецОбласти

#КонецЕсли