#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресСервера = "https://sandbox1.fes.nspk.ru"; 
	КлючДоступа = "64a4632c-7b33-43e7-9fab-5a9d63644f87";
	КлючКассы = "14b572a3-c85e-4145-be1d-eb96d68ebc51";
	ХешНомерКарты = "11f1721a4b40a8b42f3496ca85fb2caee1b3c9916d5ea34c61bf1092a4f8aad4";
	СсылкаНаПлатежныйСчет = "B03800000002786865500462181S8";  
	ИдентификаторКассы  = "800000000000000002";     
	
	ПроверятьКорневыеСертификаты = Истина;
	ЧекФискальныйПризнак = "0000000000";
	ЧекНомер = 1;
	
	Товар = ТаблицаТоваров.Добавить();
	Товар.НомерПозиции = 1;           
	Товар.ПозицияВозврата = Товар.НомерПозиции; 
	Товар.КодТовараТРУ = "325022129.11000010100000000000";
	Товар.Количество   = 1; 
	Товар.Цена         = 200;
	
	ПротоколОбменаФЭСНСПК = Перечисления.ПротоколОбменаФЭСНСПК.ВерсияV2;
	ЧекТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств;
	ЧекДатаВремя = ТекущаяДата();
	ЧекМестоРасчетов = "г.Москва, Дмитровское ш. д.9";
	
	НомерФискальногоНакопителя = "8710000100000001";          
	
	Если ОбщегоНазначенияБПО.ЭтоМобильнаяПлатформа() Тогда
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.КлючДоступа);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.КлючКассы);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ИдентификаторКассы);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ИдентификаторЗапроса);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.АдресСервера);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.СобственныеСредства);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.СуммаСертификатами);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ИдентификаторКорзины);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ЧекМестоРасчетов);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ЧекНомер);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ЧекДатаВремя);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ЧекТипРасчета);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ФискальныйПризнак);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ККТ);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.СсылкаНаПлатежныйСчет);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ИдентификаторКорзиныОперацииОплаты);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.НомерФискальногоНакопителя);     
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.QRКодЧека);    
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ПротоколОбменаФЭСНСПК);  
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ПроксиПорт);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ПроксиПользователь);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ПроксиПароль);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ПроксиСервер);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьКомпонентуИнтеграцииНСПК(Команда)
	
	ОповещениеМетода = Новый ОписаниеОповещения("УстановитьКомпонентуИнтеграцииНСПКЗавершение", ЭтотОбъект); 
	ЭлектронныеСертификатыНСПККлиент.УстановитьКомпонентуИнтеграцииНСПК(ОповещениеМетода);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКомпонентуИнтеграцииНСПКЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыполнения.Результат Тогда
		Сообщить(НСтр("ru='ОК'"));
	Иначе
		Сообщить(РезультатВыполнения.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НСПКВерсияВК(Команда)
	
	Если ВыполнениеНаСервере Тогда
		НСПКВерсияВКНаСервере();
	Иначе
		ОповещениеМетода = Новый ОписаниеОповещения("НСПКВерсияВКЗавершение", ЭтотОбъект); 
		ЭлектронныеСертификатыНСПККлиент.НачатьПолучениеВерсииВК(ОповещениеМетода);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НСПКВерсияВКЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатВыполнения) = Тип("Структура") Тогда   
		Если РезультатВыполнения.Свойство("Версия") Тогда
			Сообщить(РезультатВыполнения.Версия);
		ИначеЕсли РезультатВыполнения.Свойство("ОписаниеОшибки") Тогда 
			Сообщить(РезультатВыполнения.ОписаниеОшибки);   
		КонецЕсли;
	Иначе
		Сообщить(РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестовоеПодключение(Команда)
	
	ПараметрыОперации = ЗаполнитьПараметрыОперации();
	
	Если ВыполнениеНаСервере Тогда
		ТестовоеПодключениеНаСервере(ПараметрыОперации);
	Иначе
		ОповещениеМетода = Новый ОписаниеОповещения("ТестовоеПодключениеЗавершение", ЭтотОбъект, ПараметрыОперации); 
		ЭлектронныеСертификатыНСПККлиент.НачатьТестовоеПодключение(ОповещениеМетода, ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестовоеПодключениеЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыполнения.Результат Тогда
		Сообщить(НСтр("ru='ОК'"));
	Иначе
		ОписаниеОшибки = НСтр("ru='ОШИБКА: (%1) %2'");
		ОписаниеОшибки = СтрШаблон(ОписаниеОшибки, РезультатВыполнения.КодРезультата, РезультатВыполнения.ОписаниеОшибки); 
		Сообщить(ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	ОбработатьРезультатНаСервере(РезультатВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредварительноеОдобрениеИспользования(Команда)
	
	ПараметрыОперации = ЗаполнитьПараметрыОперации();
	
	СуммаЧека = 0;
	Для Каждого Товар Из ТаблицаТоваров Цикл
		СуммаЧека = СуммаЧека + Товар.Количество * Товар.Цена;
		Если Не ПустаяСтрока(Товар.КодТовараТРУ) Тогда
			ТоварнаяПозиция = ЭлектронныеСертификатыНСПККлиентСервер.ПараметрыТоварнойПозиции();
			ТоварнаяПозиция.НомерПозиции = Товар.НомерПозиции;        
			ТоварнаяПозиция.СертификатПоследниеЦифры = Товар.СертификатПоследниеЦифры;  
			//Товар.КодТовараТРУ = СокрЛП(Товар.КодТовараТРУ);
			//Пока СтрДлина(Товар.КодТовараТРУ) < 30 Цикл      
			//	Товар.КодТовараТРУ = Товар.КодТовараТРУ + "0";
			//КонецЦикла;
			ТоварнаяПозиция.КодТовараТРУ = Товар.КодТовараТРУ;
			ТоварнаяПозиция.Количество   = Товар.Количество; 
			ТоварнаяПозиция.Цена         = Товар.Цена;
			ПараметрыОперации.ТоварныеПозиции.Добавить(ТоварнаяПозиция);
		КонецЕсли;
	КонецЦикла;

	Если ВыполнениеНаСервере Тогда
		ПредварительноеОдобрениеИспользованияНаСервере(ПараметрыОперации);
	Иначе
		ОповещениеМетода = Новый ОписаниеОповещения("ОбработатьРезультатЗавершение", ЭтотОбъект, ПараметрыОперации); 
		ЭлектронныеСертификатыНСПККлиент.НачатьПредварительноеОдобрениеИспользования(ОповещениеМетода, ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредварительноеОдобрениеВозврата(Команда)
	
	ПараметрыОперации = ЗаполнитьПараметрыОперации();
	ПараметрыОперации.ИдентификаторКорзины  = ИдентификаторКорзины;
	
	Для Каждого Товар Из ТаблицаТоваров Цикл
		ТоварнаяПозиция = ЭлектронныеСертификатыНСПККлиентСервер.ПараметрыТоварнойПозиции();
		ТоварнаяПозиция.НомерПозиции = Товар.НомерПозиции;
		ТоварнаяПозиция.НомерПозицииВозврата = Товар.ПозицияВозврата;   
		ТоварнаяПозиция.СертификатПоследниеЦифры = Товар.СертификатПоследниеЦифры;
		ТоварнаяПозиция.КодТовараТРУ = Товар.КодТовараТРУ;
		ТоварнаяПозиция.Количество   = Товар.Количество; 
		ТоварнаяПозиция.Цена         = Товар.Цена;
		ПараметрыОперации.ТоварныеПозиции.Добавить(ТоварнаяПозиция);
	КонецЦикла;
	
	Если ВыполнениеНаСервере Тогда
		ПредварительноеОдобрениеВозвратаНаСервере(ПараметрыОперации);
	Иначе
		ОповещениеМетода = Новый ОписаниеОповещения("ОбработатьРезультатЗавершение", ЭтотОбъект, ПараметрыОперации); 
		ЭлектронныеСертификатыНСПККлиент.НачатьПредварительноеОдобрениеВозврата(ОповещениеМетода, ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередачаДанныхФискальногоЧека(Команда)
	
	ПараметрыОперации = ЗаполнитьПараметрыОперации();
	ПараметрыОперации.ИдентификаторКорзины = ИдентификаторКорзины;
	ПараметрыОперации.НомерФискальногоНакопителя = НомерФискальногоНакопителя;
	ПараметрыОперации.ФискальныйТипРасчета = ЧекТипРасчета;
	ПараметрыОперации.ФискальныйПризнакЧека = ЧекФискальныйПризнак;
	ПараметрыОперации.ФискальныйЧекНомер = ЧекНомер; 
	ПараметрыОперации.ФискальныйЧекДатаВремя =  ЧекДатаВремя;
	ПараметрыОперации.ФискальныйЧекСумма = СуммаСертификатами;
	ПараметрыОперации.ФискальныйМестоРасчетов = ЧекМестоРасчетов;
	
	Если ВыполнениеНаСервере Тогда
		ПередачаДанныхФискальногоЧекаНаСервере(ПараметрыОперации);
	Иначе
		ОповещениеМетода = Новый ОписаниеОповещения("ОбработатьРезультатЗавершение", ЭтотОбъект, ПараметрыОперации); 
		ЭлектронныеСертификатыНСПККлиент.НачатьПередачуДанныхФискальногоЧека(ОповещениеМетода, ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеСоставаКорзины(Команда)
	
	ПараметрыОперации = ЗаполнитьПараметрыОперации();
	ПараметрыОперации.ИдентификаторКорзины = ИдентификаторКорзины;
	
	Если ВыполнениеНаСервере Тогда
		ПолучениеСоставаКорзиныНаСервере(ПараметрыОперации);
	Иначе
		ОповещениеМетода = Новый ОписаниеОповещения("ОбработатьРезультатЗавершение", ЭтотОбъект, ПараметрыОперации); 
		ЭлектронныеСертификатыНСПККлиент.НачатьПолучениеСоставаКорзины(ОповещениеМетода, ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеИдентификатораКорзины(Команда)
	
	ПараметрыОперации = ЗаполнитьПараметрыОперации();
	ПараметрыОперации.НомерФискальногоНакопителя = НомерФискальногоНакопителя;
	ПараметрыОперации.ФискальныйПризнакЧека = ЧекФискальныйПризнак;
	ПараметрыОперации.ФискальныйЧекНомер = ЧекНомер;
	ПараметрыОперации.QRКодЧекаККТ = QRКодЧека;
	
	Если ВыполнениеНаСервере Тогда
		ПолучениеИдентификатораКорзиныНаСервере(ПараметрыОперации);
	Иначе
		ОповещениеМетода = Новый ОписаниеОповещения("ОбработатьРезультатЗавершение", ЭтотОбъект, ПараметрыОперации); 
		ЭлектронныеСертификатыНСПККлиент.НачатьПолучениеИдентификатораКорзины(ОповещениеМетода, ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеСпискаСертификатов(Команда)     
	
	ПараметрыОперации = ЗаполнитьПараметрыОперации();
	
	Если ВыполнениеНаСервере Тогда
		ПолучениеСпискаСертификатовНаСервере(ПараметрыОперации);
	Иначе
		ОповещениеМетода = Новый ОписаниеОповещения("ОбработатьРезультатЗавершение", ЭтотОбъект, ПараметрыОперации); 
		ЭлектронныеСертификатыНСПККлиент.НачатьПолучениеСпискаСертификатов(ОповещениеМетода, ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеСпискаИдентификаторовКорзинПокупокТСП(Команда)
	
	ПараметрыОперации = ЗаполнитьПараметрыОперации();
	
	Если ТаблицаТоваров.Количество() > 0 Тогда
		ПараметрыОперации.КодТовараТРУ = ТаблицаТоваров[0].КодТовараТРУ;
	КонецЕсли;
	
	ПараметрыОперации.ХешНомерКарты         = СокрЛП(ХешНомерКарты);    
	ПараметрыОперации.СсылкаНаПлатежныйСчет = СокрЛП(СсылкаНаПлатежныйСчет); 
	
	Если ВыполнениеНаСервере Тогда
		ПолучениеСпискаИдентификаторовКорзинПокупокТСПНаСервере(ПараметрыОперации);
	Иначе
		ОповещениеМетода = Новый ОписаниеОповещения("ОбработатьРезультатЗавершение", ЭтотОбъект, ПараметрыОперации); 
		ЭлектронныеСертификатыНСПККлиент.НачатьПолучениеСпискаИдентификаторовКорзинПокупокТСП(ОповещениеМетода, ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюЭТЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Элементы.Главная.Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'Операция выполнена успешно.'");
		Если РезультатВыполнения.Свойство("ХешНомерКарты") Тогда
			ХешНомерКарты = РезультатВыполнения.ХешНомерКарты;
		КонецЕсли;
		Если РезультатВыполнения.Свойство("СсылкаНаПлатежныйСчет") Тогда
			СсылкаНаПлатежныйСчет = РезультатВыполнения.СсылкаНаПлатежныйСчет;
		КонецЕсли;
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюККТЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Элементы.Главная.Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'Операция выполнена успешно.'");
		
		Если РезультатВыполнения.Свойство("НомерЧекаККТ") Тогда
			ЧекНомер = РезультатВыполнения.НомерЧекаККТ;
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("ФискальныйПризнак") Тогда
			ЧекФискальныйПризнак = РезультатВыполнения.ФискальныйПризнак;
		КонецЕсли;
		
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьХешКартыСТерминала(Команда)
	
	Элементы.Главная.Доступность = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюЭТЗавершение", ЭтотОбъект);
	ОборудованиеПлатежныеСистемыКлиент.НачатьПолучениеПараметровКарты(ОписаниеОповещения, УникальныйИдентификатор); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьЭлектроннымСертификатом(Команда)
	
	Элементы.Главная.Доступность = Ложь;
	
	ПараметрыОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();
	ПараметрыОперации.ТипТранзакции  = "PayElectronicCertificate";
	ПараметрыОперации.ИдентификаторКорзины = ИдентификаторКорзины;
	ПараметрыОперации.СуммаЭлектронногоСертификата = СуммаСертификатами;
	ПараметрыОперации.СуммаСобственныхСредств = СобственныеСредства;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюЭТЗавершение", ЭтотОбъект);
	ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеОперацииНаЭквайринговомТерминале(ОписаниеОповещения, УникальныйИдентификатор, Неопределено, ПараметрыОперации, Неопределено, Неопределено); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьЭлектроннымСертификатом(Команда)
	
	Элементы.Главная.Доступность = Ложь;
	
	ПараметрыОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();
	ПараметрыОперации.ТипТранзакции  = "ReturnElectronicCertificate";
	ПараметрыОперации.ИдентификаторКорзины = ИдентификаторКорзины;    
	ПараметрыОперации.ИдентификаторКорзиныОперацииОплаты = ИдентификаторКорзиныОперацииОплаты;
	ПараметрыОперации.СуммаЭлектронногоСертификата = СуммаСертификатами;
	ПараметрыОперации.СуммаСобственныхСредств = СобственныеСредства;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюЭТЗавершение", ЭтотОбъект);
	ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеОперацииНаЭквайринговомТерминале(ОписаниеОповещения, УникальныйИдентификатор, Неопределено, ПараметрыОперации, Неопределено, Неопределено); 
	
КонецПроцедуры

&НаКлиенте
Процедура ФискализацияЧека(Команда)
	
	Элементы.Главная.Доступность = Ложь;
	
	ПараметрыОперации = ПолучитьШаблонЧека();
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ВыполнитьОперациюККТЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ККТ, ПараметрыОперации);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ЗаполнитьПараметрыОперации();
	
	ПараметрыОперации = ЭлектронныеСертификатыНСПККлиентСервер.ПараметрыОперацииНСПК();
	ПараметрыОперации.АдресСервера = АдресСервера; 
	ПараметрыОперации.КлючДоступа = КлючДоступа;
	ПараметрыОперации.КлючКассы = КлючКассы;                
	
	ПараметрыОперации.ИнтернетПрокси.Сервер = ПроксиСервер;
	ПараметрыОперации.ИнтернетПрокси.Порт = ПроксиПорт;
	ПараметрыОперации.ИнтернетПрокси.Пользователь = ПроксиПользователь;
	ПараметрыОперации.ИнтернетПрокси.Пароль = ПроксиПароль;

	ИдентификаторЗапроса = Новый УникальныйИдентификатор();
	ПараметрыОперации.ИдентификаторЗапроса = ИдентификаторЗапроса;
	ПараметрыОперации.ИдентификаторКассы   = ИдентификаторКассы;         
	ПараметрыОперации.ПроверятьКорневыеСертификаты = ПроверятьКорневыеСертификаты;
	ПараметрыОперации.ПротоколОбмена = ПротоколОбменаФЭСНСПК;          
	
	ПараметрыОперации.ХешНомерКарты         = СокрЛП(ХешНомерКарты);    
	ПараметрыОперации.СсылкаНаПлатежныйСчет = СокрЛП(СсылкаНаПлатежныйСчет); 
	
	Возврат ПараметрыОперации;
	
КонецФункции

&НаСервере
Процедура ОбработатьРезультатНаСервере(РезультатВыполнения);
	
	Ответ.Очистить();
	
	Если РезультатВыполнения.Результат Тогда
		Сообщить(НСтр("ru='ОК'"));
		Если РезультатВыполнения.Свойство("ИдентификаторКорзины") И НЕ ПустаяСтрока(РезультатВыполнения.ИдентификаторКорзины) Тогда
			ИдентификаторКорзины = РезультатВыполнения.ИдентификаторКорзины;
		КонецЕсли;
		Если РезультатВыполнения.Свойство("СуммаСертификатами") Тогда
			СуммаСертификатами = РезультатВыполнения.СуммаСертификатами;
			СобственныеСредства = СуммаЧека - СуммаСертификатами;
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("ТоварныеПозиции") И РезультатВыполнения.ТоварныеПозиции.Количество() > 0 Тогда
			Для Каждого ТоварнаяПозиция Из РезультатВыполнения.ТоварныеПозиции Цикл
				Товар = Ответ.Добавить();       
				Если ТоварнаяПозиция.Свойство("НомерПозиции") Тогда
					Товар.НомерПозиции = ТоварнаяПозиция.НомерПозиции;
				КонецЕсли;
				Если ТоварнаяПозиция.Свойство("КодТовараТРУ") Тогда
					Товар.КодТовараТРУ = ТоварнаяПозиция.КодТовараТРУ;
				КонецЕсли;
				Если ТоварнаяПозиция.Свойство("Количество") Тогда
					Товар.Количество = ТоварнаяПозиция.Количество;
				КонецЕсли;            
				Если ТоварнаяПозиция.Свойство("БалансКоличество") Тогда
					Товар.Количество = ТоварнаяПозиция.БалансКоличество;
				КонецЕсли;            
				Если ТоварнаяПозиция.Свойство("Цена") Тогда
					Товар.Цена = ТоварнаяПозиция.Цена;
				КонецЕсли;
				Если ТоварнаяПозиция.Свойство("Сертификаты") И ТоварнаяПозиция.Сертификаты.Количество() > 0 Тогда
					Для Каждого Сертификат Из ТоварнаяПозиция.Сертификаты Цикл
						Позиция = Товар.Сертификаты.Добавить();
						ЗаполнитьЗначенияСвойств(Позиция, Сертификат);
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;                
		
		Если РезультатВыполнения.Свойство("ДоступныеСертификаты") И РезультатВыполнения.ДоступныеСертификаты.Количество() > 0 Тогда
			Для Каждого ДоступныйСертификат Из РезультатВыполнения.ДоступныеСертификаты Цикл
				Для Каждого КодТоваровТРУ  Из ДоступныйСертификат.КодыТоваровТРУ Цикл      
					Позиция = Ответ.Добавить();
					Позиция.КодТовараТРУ = КодТоваровТРУ.КодТовараТРУ;
					Позиция.Количество = КодТоваровТРУ.БалансКоличество;
					Позиция.Цена = КодТоваровТРУ.ЛимитДенежныхСредств;    
					Сертификат = Позиция.Сертификаты.Добавить();    
					Сертификат.Идентификатор = ДоступныйСертификат.Идентификатор;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;        
		
		ИдентификаторыКорзинПокупок.Очистить();
		
		Если РезультатВыполнения.Свойство("ИдентификаторыКорзинПокупок") И РезультатВыполнения.ИдентификаторыКорзинПокупок.Количество() > 0 Тогда 
			Для Каждого ИдентификаторыКорзинСтрока Из РезультатВыполнения.ИдентификаторыКорзинПокупок Цикл    
				Позиция = ИдентификаторыКорзинПокупок.Добавить();   
				ЗаполнитьЗначенияСвойств(Позиция, ИдентификаторыКорзинСтрока);
			КонецЦикла;
		КонецЕсли;        
		
	Иначе
		ОписаниеОшибки = НСтр("ru='ОШИБКА: (%1) %2'");
		ОписаниеОшибки = СтрШаблон(ОписаниеОшибки, РезультатВыполнения.КодРезультата, РезультатВыполнения.ОписаниеОшибки); 
		Сообщить(ОписаниеОшибки);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НСПКВерсияВКНаСервере()
	
	Сообщить(ЭлектронныеСертификатыНСПК.ВерсияВК());
	
КонецПроцедуры

&НаСервере
Процедура ТестовоеПодключениеНаСервере(ПараметрыОперации)
	
	РезультатВыполнения = ЭлектронныеСертификатыНСПК.ТестовоеПодключение(ПараметрыОперации);
	
	Если РезультатВыполнения.Результат Тогда
		Сообщить(НСтр("ru='ОК'"));
	Иначе
		ОписаниеОшибки = НСтр("ru='ОШИБКА: (%1) %2'");
		ОписаниеОшибки = СтрШаблон(ОписаниеОшибки, РезультатВыполнения.КодРезультата, РезультатВыполнения.ОписаниеОшибки); 
		Сообщить(ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПредварительноеОдобрениеИспользованияНаСервере(ПараметрыОперации)
	
	РезультатВыполнения = ЭлектронныеСертификатыНСПК.ПредварительноеОдобрениеИспользования(ПараметрыОперации);
	
	ОбработатьРезультатНаСервере(РезультатВыполнения);
	
КонецПроцедуры

&НаСервере
Процедура ПредварительноеОдобрениеВозвратаНаСервере(ПараметрыОперации)
	
	РезультатВыполнения = ЭлектронныеСертификатыНСПК.ПредварительноеОдобрениеВозврата(ПараметрыОперации);
	
	ОбработатьРезультатНаСервере(РезультатВыполнения);

КонецПроцедуры

&НаСервере
Процедура ПолучениеСоставаКорзиныНаСервере(ПараметрыОперации)
	
	РезультатВыполнения = ЭлектронныеСертификатыНСПК.ПолучениеСоставаКорзины(ПараметрыОперации);
	
	ОбработатьРезультатНаСервере(РезультатВыполнения);
	
КонецПроцедуры

&НаСервере
Процедура ПолучениеИдентификатораКорзиныНаСервере(ПараметрыОперации)
	
	РезультатВыполнения = ЭлектронныеСертификатыНСПК.ПолучениеИдентификатораКорзины(ПараметрыОперации);
	
	ОбработатьРезультатНаСервере(РезультатВыполнения);
	
КонецПроцедуры

&НаСервере
Процедура ПередачаДанныхФискальногоЧекаНаСервере(ПараметрыОперации)
	
	РезультатВыполнения = ЭлектронныеСертификатыНСПК.ПередачаДанныхФискальногоЧека(ПараметрыОперации);
	
	ОбработатьРезультатНаСервере(РезультатВыполнения);
	
КонецПроцедуры

&НаСервере
Процедура ПолучениеСпискаСертификатовНаСервере(ПараметрыОперации)
	
	РезультатВыполнения = ЭлектронныеСертификатыНСПК.ПолучениеСпискаСертификатов(ПараметрыОперации);
	
	ОбработатьРезультатНаСервере(РезультатВыполнения);
	
КонецПроцедуры

&НаСервере
Процедура ПолучениеСпискаИдентификаторовКорзинПокупокТСПНаСервере(ПараметрыОперации)
	
	РезультатВыполнения = ЭлектронныеСертификатыНСПК.ПолучениеСпискаИдентификаторовКорзинПокупокТСП(ПараметрыОперации);
	
	ОбработатьРезультатНаСервере(РезультатВыполнения);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьШаблонЧека()
	
	// Общие параметры чека
	ОбщиеПараметры = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииЧекаКоррекции();
	
	// Параметры установлены по умолчанию.
	ОбщиеПараметры.ТипРасчета = ЧекТипРасчета;
	ОбщиеПараметры.Электронно = Ложь;
	
	ОбщиеПараметры.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
	
	ОбщиеПараметры.ОрганизацияНазвание = "ООО ""1C-СОФТ""";
	ОбщиеПараметры.ОрганизацияИНН = "7709860400";
	ОбщиеПараметры.ОрганизацияКПП = "770901001";
	ОбщиеПараметры.АдресРасчетов  = ЧекМестоРасчетов;
	ОбщиеПараметры.МестоРасчетов  = ЧекМестоРасчетов;
	
	Для Каждого Товар Из ТаблицаТоваров Цикл
		
		СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
		СтрокаПозицииЧека.Наименование = "Товарная позиция";
		СтрокаПозицииЧека.Количество   = Товар.Количество;
		СтрокаПозицииЧека.Цена         = Товар.Цена;
		СтрокаПозицииЧека.Сумма        = Товар.Количество * Товар.Цена;
		СтрокаПозицииЧека.СтавкаНДС    = Неопределено;  // Без НДС
		СтрокаПозицииЧека.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
		СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
		
		Если Не ПустаяСтрока(Товар.КодТовараТРУ) Тогда
			// Нефискальная строка
			СтрокаТекста = "ТРУ (КОД):" + Товар.КодТовараТРУ; 
			ТекстоваяСтрокаЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека(СтрокаТекста);
			ОбщиеПараметры.ПозицииЧека.Добавить(ТекстоваяСтрокаЧека);
		КонецЕсли;
	КонецЦикла;
	
	ОбщиеПараметры.ИдентификаторОплатыПлатежнойСистемы = ИдентификаторКорзины;
	ОбщиеПараметры.ТипПлатежнойСистемы = ПредопределенноеЗначение("Перечисление.ТипыПлатежнойСистемыККТ.СертификатНСПК");
	ОбщиеПараметры.QRКод.ЗначениеКода = ИдентификаторКорзины;
	
	ДетализацияОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыДетализацииСтрокиОплаты();
	ДетализацияОплаты.НаименованиеТипаОплаты = "СЕРТИФИКАТОМ";
	ДетализацияОплаты.Сумма = СуммаСертификатами;
	ОбщиеПараметры.ДетализацияОплаты.Добавить(ДетализацияОплаты);
	
	ДетализацияОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыДетализацииСтрокиОплаты();
	ДетализацияОплаты.НаименованиеТипаОплаты = "КАРТА МИР";
	ДетализацияОплаты.Сумма = СобственныеСредства;
	ОбщиеПараметры.ДетализацияОплаты.Добавить(ДетализацияОплаты);
	
	СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	СтрокаОплаты.Сумма = СуммаСертификатами + СобственныеСредства; 
	СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно");
	ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);

	Возврат ОбщиеПараметры;
	
КонецФункции

#КонецОбласти
