
&НаСервере
Функция ПроверкаДняНедели(Дата)
	Если ДеньНедели(Дата) > 4 Тогда
		Возврат 1;
	КонецЕсли;
	
	Возврат 0;
КонецФункции

&НаСервере
Процедура ПросмотретьОтчетНаСервере()
	Объект.ТЧ.Очистить();
	ОбщаяКасса=0;
	СуммаДесертов=0;
	СуммаХлеба=0;
	СуммаДизеля=0;
	СуммаРасходов=0;
	СуммаПеребора=0;
	СуммаПроцентов=0;
	
	Отчет = Документы.ДневнойОтчет.Выбрать(Объект.ДатаНачало,Объект.ДатаКонец+86400);
	
	Пока Отчет.Следующий() Цикл
		ТекущийОтчет = Отчет.ПолучитьОбъект();
		Если ТекущийОтчет.Заведение = Объект.Заведение Тогда
			//Сообщить("Отчет за " + Строка(ТекущийОтчет.ДатаСмены));
			ВозвратСредиНедели = 0;
			Для Каждого Выборка Из ТекущийОтчет.ОсновнаяИнформация Цикл 
				Если Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.ОбщаяКасса Тогда
					ОбщаяКасса=Выборка.Сумма;
				
				ИначеЕсли Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.Десерты Тогда
					СуммаДесертов=Выборка.Сумма;	
				
				ИначеЕсли Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.Хлеб Тогда
					СуммаХлеба=Выборка.Сумма;	
				ИначеЕсли Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.Анжела Тогда
					Если ПроверкаДняНедели(ТекущийОтчет.ДатаСмены) = 1 Тогда
						ВозвратСредиНедели=Выборка.Сумма;	
					КонецЕсли;
				ИначеЕсли Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.ОставленоНаЗакупку Тогда
					ОставленоНаЗакупку=Выборка.Сумма;		
					
				КонецЕсли;
			КонецЦикла;
			ТекРасходы = 0;
			Для Каждого Выборка Из ТекущийОтчет.Расходы Цикл
				ТекРасходы = ТекРасходы + Выборка.Сумма; 
				СуммаРасходов=СуммаРасходов+Выборка.Сумма;
			КонецЦикла;
			
			Запись = Объект.ТЧ.Добавить();
			Запись.ДатаОтчета = ТекущийОтчет.ДатаСмены;
			Запись.СуммаКассы = ОбщаяКасса;
			Запись.СуммаХлеб = СуммаХлеба;
			Запись.СуммаДесерты = СуммаДесертов;
			Запись.Сумма = ТекРасходы;
			Запись.Процент = (ОбщаяКасса-СуммаХлеба-СуммаДесертов)*0.2;
			Запись.Перебор = -(Запись.Процент-ТекРасходы); 
			Если ДеньНедели(ТекущийОтчет.ДатаСмены)>4 Тогда
				Запись.ВозвратСредиНедели = ВозвратСредиНедели;
			КонецЕсли;
			
			
			Если ДеньНедели(ТекущийОтчет.ДатаСмены)=7 Тогда
				СуммДолгаЗакупщика = 0;
				//закупщик
				Для Каждого Строка Из ТекущийОтчет.ЗадолжнотиЗакупщика Цикл
					Если Строка.Неоплачено > 0 Тогда
						СуммДолгаЗакупщика = СуммДолгаЗакупщика + Строка.Неоплачено;	
					КонецЕсли;
				КонецЦикла;
				//долги
				СуммаНеоплаченыхПН = 0;
				Для Каждого Строка Из ТекущийОтчет.ДолговыеНакладные Цикл
					Если Строка.Оплачен = Ложь И Строка.Ошибка = Ложь Тогда
						СуммаНеоплаченыхПН = СуммаНеоплаченыхПН + Строка.Сумма;	
					КонецЕсли;
				КонецЦикла;
				//
				//Для Каждого Строка Из ТекущийОтчет.Накладные Цикл
				//	Если Строка.Оплачено = Ложь И Строка.Закупщик = Ложь Тогда
				//		СуммаНеоплаченыхПН = СуммаНеоплаченыхПН + Строка.СуммаПН;	
				//	КонецЕсли;
				//КонецЦикла;
				Объект.СуммаДолгаЗакупщику = СуммДолгаЗакупщика;
				Объект.СуммаНезакрытыхПН = СуммаНеоплаченыхПН; 
				Объект.ОставленоНаЗакупку = ОставленоНаЗакупку;
				//оставелно
					
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	СуммаЗакупкиПонедельника = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДневнойОтчетНакладные.Ссылка.ДатаСмены КАК ДатаСмены,
		|	ДневнойОтчетНакладные.Ссылка.Заведение КАК Заведение,
		|	ДневнойОтчетНакладные.Поставщик КАК Поставщик,
		|	ДневнойОтчетНакладные.СуммаПН КАК СуммаПН
		|ИЗ
		|	Документ.ДневнойОтчет.Накладные КАК ДневнойОтчетНакладные
		|ГДЕ
		|	ДневнойОтчетНакладные.Ссылка.ДатаСмены = &ДатаСмены
		|	И ДневнойОтчетНакладные.Ссылка.Заведение = &Заведение";
	
	Запрос.УстановитьПараметр("ДатаСмены", НачалоДня(Объект.ДатаКонец));
	Запрос.УстановитьПараметр("Заведение", Объект.Заведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Поставщик.Склад = Перечисления.Склады.Кухня Тогда
			СуммаЗакупкиПонедельника = СуммаЗакупкиПонедельника + Выборка.СуммаПН;	
		КонецЕсли;
		
	КонецЦикла;
	 	//	
	//СуммаПроцентов=(ОбщаяКасса-СуммаХлеба-СуммаДесертов)*0.2;
	//СуммаПеребора=СуммаПроцентов-(СуммаРасходов+СуммаДизеля);

КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьОтчет(Команда)
	ПросмотретьОтчетНаСервере();
КонецПроцедуры
