
&НаКлиенте
Процедура Прочитать(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПрочитатьЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьПолучениеКлючевыхПараметров(ОписаниеОповещения,Оборудование);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(ИмяПараметра)
	
	Атрибуты = МенеджерОборудованияКлиент.АтрибутыПараметра(Оборудование, ИмяПараметра);
	НоваяСтрока = ПараметрыОборудования.Добавить();
	Если ЗначениеЗаполнено(Атрибуты) Тогда
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Атрибуты);
	КонецЕсли;
	НоваяСтрока.Наименование = ИмяПараметра;
	НоваяСтрока.Значение     = МенеджерОборудованияКлиент.ЗначениеПараметра(Оборудование, ИмяПараметра);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПараметрыОборудования.Очистить();
	Если Результат Тогда
		ДобавитьСтроку("LogEnabled");
		ДобавитьСтроку("LogPath");
		ДобавитьСтроку("PrintDoc");
		ДобавитьСтроку("PrintSlip");
		ДобавитьСтроку("OfdServer");
		ДобавитьСтроку("OfdPort");
	КонецЕсли;
	
КонецПроцедуры

