Функция ЦехПоИдЗаказа(Ид_заказа, Заведение) Экспорт 
	                          
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказыКухни.Заведение КАК Заведение,
		|	ЗаказыКухни.Цех КАК Цех,
		|	ЗаказыКухни.НомерСчета КАК НомерСчета
		|ИЗ
		|	РегистрСведений.ЗаказыКухни КАК ЗаказыКухни
		|ГДЕ
		|	ЗаказыКухни.Заведение = &Заведение
		|	И ЗаказыКухни.НомерСчета = &НомерСчета";
	
	Запрос.УстановитьПараметр("Заведение", Заведение);
	Запрос.УстановитьПараметр("НомерСчета", Ид_заказа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий(); 
	
	Возврат Выборка.Цех;
	
КонецФункции

