#Область ОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события "ПриИзменении" поля Количество ТЧ Товары.
//
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ПриИзмененииТоварыКоличество();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля Номенклатура ТЧ Товары.
//
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Цена = ПолучитьЦенуНаСервере(ТекущаяСтрока.Номенклатура);
	ТекущаяСтрока.ЕдиницаИзмерения = ПолучитьЕдиницуИзмеренияНаСервере(ТекущаяСтрока.Номенклатура);
	
	Если Не ПолучитьСвойствоВесовойНаСервере(ТекущаяСтрока.Номенклатура) Тогда
		Текущаястрока.Количество = 1;
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена;
	КонецЕсли;
	
	СтрокаДисплеяПокупателя = ТекущаяСтрока.Номенклатура;
	
КонецПроцедуры  

// Процедура - обработчик события "ПриИзменении" ТЧ Товары.
//
&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	ПересчитатьДокументНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедуры пересчитывает сумму по строке.
//
&НаКлиенте
Процедура ПриИзмененииТоварыКоличество()
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные; 
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	
КонецПроцедуры

// Процедуры пересчитывает сумму по строке.
//
&НаКлиенте
Процедура ПересчитатьДокументНаКлиенте()
	
	Объект.СуммаДокумента = ПолучитьСуммуДокумента();
	
КонецПроцедуры

// Процедура получает общую сумму документа.
//
&НаСервере
Функция ПолучитьСуммуДокумента()
	
	Сумма = Объект.Товары.Итог("Сумма");
	Возврат Сумма;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьЦенуНаСервере(Номенклатура)
	
	Возврат Номенклатура.Цена;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЕдиницуИзмеренияНаСервере(Номенклатура)
	
	Возврат Номенклатура.ЕдиницаИзмерения;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСвойствоВесовойНаСервере(Номенклатура)
	
	Возврат Номенклатура.Весовой;
	
КонецФункции

#КонецОбласти