
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Установка значений по умолчанию
	Если КоличестоЕлементов = 0 Тогда
		КоличестоЕлементов = 200;
	КонецЕсли;
	
	Если КоличествоГрупп = 0 Тогда
		КоличествоГрупп = 7;
	КонецЕсли;
	
	Если КоличествоЕлементовВГруппе = 0 Тогда
		КоличествоЕлементовВГруппе = Окр(КоличестоЕлементов / КоличествоГрупп);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанные(Команда)
	Если КоличестоЕлементов <= 0 Тогда
		ПоказатьПредупреждение(, "Количество элементов должно быть больше 0!");
		Возврат;
	КонецЕсли;
	
	Если КоличествоГрупп <= 0 Тогда
		ПоказатьПредупреждение(, "Количество групп должно быть больше 0!");
		Возврат;
	КонецЕсли;
	
	Если КоличествоЕлементовВГруппе <= 0 Тогда
		ПоказатьПредупреждение(, "Количество элементов в группе должно быть больше 0!");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеНаСервере()
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.ЗаполнитьДанные(КоличестоЕлементов, КоличествоГрупп, КоличествоЕлементовВГруппе);
КонецПроцедуры