

&НаКлиенте
Процедура ТЧНоменклатураПриИзменении(Элемент)
	ТекСтрока = Элементы.ТЧ.ТекущаяСтрока;
	ОбновитьДанныеТовара(ТекСтрока);
КонецПроцедуры



&НаКлиенте
Процедура ТЧФактическийОстатокПриИзменении(Элемент)
	ТекСтрока = Элементы.ТЧ.ТекущаяСтрока;
	ОбновитьДанныеТовара(ТекСтрока);
КонецПроцедуры

&НаСервере
Процедура ПроверкаЗаполненияТовара()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиТоваровОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
		|ГДЕ
		|	ОстаткиТоваровОстатки.КоличествоОстаток > &КоличествоОстаток";
	
	Запрос.УстановитьПараметр("КоличествоОстаток", 0);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Отбор = Новый Структура("Номенклатура", Выборка.Номенклатура);
		НайденныеСтроки = Объект.ТЧ.НайтиСтроки(Отбор);

		// Проверяем, есть ли строки
		Если НайденныеСтроки.Количество() = 0 Тогда
		    НоваяСтрока = Объект.ТЧ.Добавить();
			НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		КонецЕсли;
		
	КонецЦикла;
	ОбновитьДанныеТаблицы();
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаОстатков(Команда)
	ПроверкаЗаполненияТовара();
КонецПроцедуры


&НаСервере
Процедура ОбновитьДанныеТаблицы()
	Для Каждого Выборка Из Объект.ТЧ Цикл
		ТекСтрока = Выборка.ПолучитьИдентификатор();
		ОбновитьДанныеТовара(ТекСтрока);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеТовара(Индификатор)
	//
	//ЗначениеСтроки = Объект.ТЧ.НайтиПоИдентификатору(Индификатор);
	//ЗначениеСтроки.ШтрихКод = ЗначениеСтроки.Номенклатура.ШтрихКод; 
	//ЗначениеСтроки.ЕдиницаИзминерения = ЗначениеСтроки.Номенклатура.ЕдиницаИзмирения;
	//
	//ЗначениеСтроки.ТекущийОстаток = ПолучениеИнформации.ПолучитьОстаток(ЗначениеСтроки.Номенклатура);
	//
	//ЗначениеСтроки.ЦенаТовара = ПолучениеИнформации.ПолучитьЦену(ЗначениеСтроки.Номенклатура);
	//ЗначениеСтроки.СуммаТовара = ЗначениеСтроки.ФактическийОстаток * ЗначениеСтроки.ЦенаТовара;
	//
	//ЗначениеСтроки.КоличествоНедостачи = ЗначениеСтроки.ТекущийОстаток - ЗначениеСтроки.ФактическийОстаток;
	//ЗначениеСтроки.СуммаНедостачи = ЗначениеСтроки.КоличествоНедостачи * ЗначениеСтроки.ЦенаТовара;

КонецПроцедуры