#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьДокументВводОстатков(ТЗ_ДанныеОстатков, Склад, ДатаДокумента) Экспорт 
	
	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(Склад, "СправочникСсылка.Склады") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(ТЗ_ДанныеОстатков, "ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТЗ_ДанныеОстатков.Количество()=0 Тогда 
		Возврат;  
	КонецЕсли;
	
	Док = Документы.ВводОстатокТовараНаСкладе.СоздатьДокумент();
	Док.Дата = ДатаДокумента;
	Док.Склад = Склад;
	Для Каждого Данные Из ТЗ_ДанныеОстатков Цикл
		НоваяСтрока = Док.ТЧ.Добавить();
		НоваяСтрока.Номенклатура = Данные.Номенклатура;
		НоваяСтрока.ФактическийОстаток = Данные.Остаток;
	КонецЦикла;
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Документ переоценки " + Док.Номер + " был успешено проведен!";
		Сообщение.Сообщить();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалост провести документ переоценки по причине " + ОписаниеОшибки();
		Сообщение.Сообщить();     
	КонецПопытки; 

КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти