
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиТоваров Приход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ Из ТЧ Цикл
	 	Если ТекСтрокаТЧ.КоличествоНедостачи = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ОстаткиТоваров.Добавить();
		Если ТекСтрокаТЧ.КоличествоНедостачи > 0 Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	    Иначе 
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		КонецЕсли;
		
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТЧ.Номенклатура;
		Движение.Количество = ТекСтрокаТЧ.КоличествоНедостачи;
		Движение.Сумма = ТекСтрокаТЧ.СуммаНедостачи;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
