Функция ПолучитьСистемногоПоставщика(Заведение) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СистемныеПоставщики.Заведение КАК Заведение,
		|	СистемныеПоставщики.Поставщик КАК Поставщик
		|ИЗ
		|	Справочник.СистемныеПоставщики КАК СистемныеПоставщики
		|ГДЕ
		|	СистемныеПоставщики.Заведение = &Заведение";
	
	Запрос.УстановитьПараметр("Заведение", Заведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Поставщик;

КонецФункции // ПолучитьСистемногоПоставщика()