
&НаКлиенте
Перем ДополнительныеПараметры;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	РабочееМесто = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();
	ПолучитьОборудованиеРМНаСервере();
	ТекущийПЛУ = 1;
	
	ШтрихкодEAN8 = "46120441";
	ШтрихкодEAN13 = "2900001462105";
	ШтрихкодCODE39 = "2PMP-468-PJM";
	ШтрихкодQR = "http://www.1c.ru";
	
	ПечатьШтрихкодаEAN8 = Истина;
	ПечатьШтрихкодаEAN13 = Истина;
	ПечатьШтрихкодаCODE39 = Истина;
	ПечатьШтрихкодаQR = Истина;
	
	Отправляет1СEmail = Ложь;
	Отправляет1СSMS   = Ложь;
	ККТ_Электронно    = Ложь;  
	
	НефискальнаяКвитанция = Ложь;
	ОбновлениеДисплея  = Истина;  
	ГотовностьКРаботе  = Истина;    
	НаличнаяОплата = Ложь;    
	ПроверятьОСУ = Ложь; 
	
	ЭТСумма  = 10.12;
	СуммаИнкассации = 10.12;

	ККТ_Количество = 1;
	ККТ_Печать = Истина;    
	ККТ_СинхронизацииВремени = Истина;    
	ККТ_ПланируемыйСтатусТовара = Перечисления.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварРеализован;
	ККТ_МераКоличества = Перечисления.МераКоличестваПредметаРасчетаККТ.Штука;  
	
	СтатусОперации = Перечисления.СтатусОперацииНаДисплее.НеУстановлен;
	СтатусРабочегоМеста = Перечисления.СтатусРабочегоМестаНаДисплее.НеУстановлен; 
	
	ДП_Операция = "СписокТоваров";
	
	ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств;
	ФискальноеУстройствоТип = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	СистемаНалогообложения  = Перечисления.ТипыСистемНалогообложенияККТ.ОСН;       
	ЭТИспользоватьБиометрию = Ложь;
	
	ТипЭквайринговойОперации = "AuthorizeSales";
	ОжидатьПолучениеОтветаОИСМ = Истина;  
	ЗапросКМФормируетсяЛокально = Ложь; 
	
	ПараметрыФискализацииЧека = ПолучитьШаблонЧека();
	СуммаПродажи = 0;
	Для каждого СтрокаЧека Из ПараметрыФискализацииЧека.ПозицииЧека Цикл
		Если СтрокаЧека.Свойство("Сумма") Тогда
			СуммаПродажи = СуммаПродажи + СтрокаЧека.Сумма;
		КонецЕсли;
	КонецЦикла;
	ПО_СуммаПродажи = СуммаПродажи;
	ПО_СуммаБезнал = 90;
	
	ПО_СуммаВыдачи = 100;
	Если ОбщегоНазначенияБПО.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализация = ОбщегоНазначенияБПО.ОбщийМодуль("РаспределеннаяФискализация");
		ПО_РаспределеннаяФискализация = МодульРаспределеннаяФискализация.ДоступноРаспределеннаяФискализация();
	Иначе
		ПО_РаспределеннаяФискализация = Ложь;
		Элементы.ГруппаФискализацияВОчереди.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияБПО.ИспользуетсяТерминалыСбораДанных() Тогда
		Элементы.ГруппаТСД.Видимость = Ложь;
		Элементы.РаботаСТСД.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияБПО.ИспользуетсяПринтерыЭтикеток() Тогда
		Элементы.ГруппаПЭ.Видимость = Ложь;
		Элементы.РаботаСПЭ.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияБПО.ИспользуетсяСчитывательRFID() Тогда
		Элементы.ГруппаRFID.Видимость = Ложь;
		Элементы.РаботаRFID.Видимость = Ложь;
	КонецЕсли;
	
	ДП_КоличествоКнопок = 5;
	
#Если ВебКлиент Тогда
	Элементы.ПечатьПакетно.Видимость = Ложь;
#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = МенеджерОборудованияМаркировкаКлиент.СобытиеПроверкаКМ() Тогда
		
	
	ИначеЕсли Источник = "ПодключаемоеОборудование" Тогда
		// Отладочное
		Лог = "Получено внешнее событие
		      |Источник = " + Источник + "
		      |Событие = "  + ИмяСобытия;
		ОбновитьОтображениеДанных();
		
		Если ИмяСобытия = "Weighting" Тогда    
			
			ТекстСообщения = СтрШаблон("Вес %1 (%2) %3", 
				Параметр.Вес, 
				?(Параметр.Стабилизация, "Стабилен", "Нестабилен"),
				?(Параметр.ОшибкаРазмещения, "Ошибка размещения", ""));
			Если Параметр.ОшибкаРазмещения Тогда
				Для Каждого ЗонаПересечения Из Параметр.ЗонаПересечения Цикл
					ТекстСообщения = ТекстСообщения + "," + ЗонаПересечения;
				КонецЦикла;
			КонецЕсли;
			Сообщить(ТекстСообщения);
		
		ИначеЕсли ИмяСобытия = "ScanData" Тогда
			
			ПолученШтрихкод(Параметр[0]);
			
		ИначеЕсли ИмяСобытия = "Pressed" Тогда
			
			Сообщить(Параметр);
			
		ИначеЕсли ИмяСобытия = "ScanDataBase64" Тогда
			
			ПолученШтрихкод(Параметр[0], Истина);
			
		ИначеЕсли ИмяСобытия = "TracksData" Тогда
			
			Если Параметр[1] = Неопределено Тогда
				ПолученКодКарты(Параметр[0], Параметр[0]);
			Иначе
				ПолученКодКарты(Параметр[0], Параметр[1][1]);
			КонецЕсли;
			
		ИначеЕсли ИмяСобытия = "RFID" Тогда
			
			Для Каждого Элемент Из Параметр Цикл
				МеткаRFID = МеткиRFID.Добавить();
				ЗаполнитьЗначенияСвойств(МеткаRFID, Элемент);
			КонецЦикла;
				
		КонецЕсли;
	КонецЕсли;     
	
	Если ИмяСобытия = "ФискализированЧек" Тогда
		Если Параметр.Свойство("ТипОперации") Тогда
			Если Параметр.ТипОперации = ПредопределенноеЗначение("Перечисление.ТипыПакетнойОперацииВОчередиЧеков.ПродажаСВыдачейНаличных") Тогда
				ПО_ПродажаСВыдачейНаличныхЗавершение(Параметр, Неопределено);
			ИначеЕсли Параметр.ТипОперации = ПредопределенноеЗначение("Перечисление.ТипыПакетнойОперацииВОчередиЧеков.ПокупкаСЗачислением") Тогда
				ПО_ПокупкаСЗачислениемЗавершение(Параметр, Неопределено);
			ИначеЕсли Параметр.ТипОперации = ПредопределенноеЗначение("Перечисление.ТипыПакетнойОперацииВОчередиЧеков.ФискализацияЧекаСОплатойКартой") Тогда
				ПО_ФискализацияЧекаСОплатойКартойЗавершение(Параметр, Неопределено);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолученШтрихкод(Штрихкод, ШтрихкодВBase64 = Ложь)
	
	Если ОборудованиеПлатежныеСистемыКлиентСервер.ЭтоРеквизитыКартыQR(Штрихкод) Тогда
		ЭТРеквизитыКартыQR = Штрихкод;
		Возврат Истина;
	Иначе
		 ЭТРеквизитыКартыQR = НСтр("ru='Штрихкод не является Consumer-Presented QR.'");
	КонецЕсли; 
	
	МаркировкаGTIN = "";
	МаркировкаEAN = "";
	МаркировкаСерийныйНомер = "";
	МаркировкаКодПроверки = "";
	
	Лог = Формат(ОбщегоНазначенияБПОКлиент.ДатаСеанса(),"ДЛФ=T") + " Имя команды: ПолученШтрихкод" + Символы.ПС;
	ОтветОтУстройства = Лог + ОтветОтУстройства;
	
	Если ШтрихкодВBase64 Тогда
		ШтрихкодBase64 = Штрихкод;
		ДанныеСканера = МенеджерОборудованияКлиентСервер.Base64ВШтрихкод(Штрихкод);
	Иначе
		ШтрихкодBase64 = МенеджерОборудованияКлиентСервер.ШтрихкодВBase64(Штрихкод);
		ДанныеСканера = Штрихкод; 
	КонецЕсли;
	
	ККТ_КодКонтрольнойМарки = ШтрихкодBase64;
	
	МодульМенеджерОборудованияМаркировкаКлиентСервер = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("МенеджерОборудованияМаркировкаКлиентСервер");
	ДанныеМаркировки = МодульМенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(ШтрихкодBase64, Истина);
	
	Если ДанныеМаркировки.Разобран Тогда
		МаркировкаGTIN = ДанныеМаркировки.GTIN; 
		МаркировкаСерийныйНомер = ДанныеМаркировки.СерийныйНомер; 
		МаркировкаEAN = ДанныеМаркировки.EAN;     
		МаркировкаТипИдентификатора = ДанныеМаркировки.ТипИдентификатораТовара;
		МаркировкаРеквизитКодаТовараBASE64 = ДанныеМаркировки.РеквизитКодаТовара;
		МаркировкаРеквизитКодаТовараHEX = Строка(ДанныеМаркировки.РеквизитКодаТовараHEX);
	Иначе
		МаркировкаGTIN = Неопределено;
		МаркировкаСерийныйНомер = Неопределено;
		МаркировкаEAN = Неопределено;
		МаркировкаТипИдентификатора = Неопределено;
		МаркировкаРеквизитКодаТовараBASE64 = Неопределено;
		МаркировкаРеквизитКодаТовараHEX = Неопределено;
		Если Не ПустаяСтрока(ДанныеМаркировки.ОписаниеОшибки) Тогда
			Сообщить(ДанныеМаркировки.ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
	ТипШтрихкода  = МенеджерОборудованияКлиентСервер.ОпределитьТипШтрихкода(ДанныеСканера);
	
	ОбновитьОтображениеДанных();
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ПолученКодКарты(КодКарты, ДанныеДорожек)

	// Пишем лог
	Лог = Формат(ОбщегоНазначенияБПОКлиент.ДатаСеанса(), "ДЛФ=T") + " Имя команды: ПолученКодКарты" + Символы.ПС;
	Лог = Лог + "Код карты: " + КодКарты + Символы.ПС;
	Если ТипЗнч(ДанныеДорожек) = Тип("Массив") Тогда
		Для НомерДорожки = 1 По ДанныеДорожек.Количество() Цикл
			НоваяСтрока = ТаблицаЗагрузкиИзТСД.Добавить();
			Лог = Лог + "ДанныеДорожки(" + НомерДорожки + "): " + ДанныеДорожек[НомерДорожки - 1] + Символы.ПС;
		КонецЦикла;
		// Выводим считанные данные
		Дорожка1 = ?(ДанныеДорожек.Количество() > 0, ДанныеДорожек[0], "");
		Дорожка2 = ?(ДанныеДорожек.Количество() > 1, ДанныеДорожек[1], "");
		Дорожка3 = ?(ДанныеДорожек.Количество() > 2, ДанныеДорожек[2], "");
		
	ИначеЕсли ТипЗнч(ДанныеДорожек) = Тип("Строка") Тогда
		Дорожка1 = ДанныеДорожек;
		Лог = Лог + "ДанныеДорожек: " + ДанныеДорожек + Символы.ПС;
	КонецЕсли;
	
	Лог = Лог + "========================================" + Символы.ПС;
	ОтветОтУстройства = Лог + ОтветОтУстройства;
	
	ОбновитьОтображениеДанных();

	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура ДанныеСканераПриИзменении(Элемент)
	
	ТипШтрихкода  = МенеджерОборудованияКлиентСервер.ОпределитьТипШтрихкода(ДанныеСканера);
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДополнительныеПараметры = МенеджерОборудованияКлиентСервер.ДополнительныеПараметрыОперации(Истина);
	ПО_ОставлятьПодключенными = ДополнительныеПараметры.ОставитьПодключенным; 
	ККТ_ПланируемыйСтатусТовараПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	МенеджерОборудованияКлиент.НачатьОтключениеВсегоОборудования();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииНаСервере

&НаСервере
Процедура ПолучитьОборудованиеРМНаСервере()

	Отбор = Новый Структура("РабочееМесто", РабочееМесто);
	ОборудованиеРМ = Справочники.ПодключаемоеОборудование.Выбрать(,, Отбор);
	Пока ОборудованиеРМ.Следующий() Цикл
		Если НЕ ОборудованиеРМ.УстройствоИспользуется Или ОборудованиеРМ.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		_ТипОборудования = ОборудованиеРМ.ТипОборудования;
		Если _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СканерШтрихкода Тогда
			СканерШК = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ Тогда
			ККТ = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных Тогда
			ТСД = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ДисплейПокупателя Тогда
			Дисплей = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СчитывательМагнитныхКарт Тогда
			СчитывательМК = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СчитывательRFID Тогда
			СчитывательRFID = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭлектронныеВесы Тогда
			Весы = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал Тогда
			ЭТ = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток Тогда
			ВесыСПечатьюЭтикеток = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков Тогда
			ПринтерЧеков = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ПринтерЭтикеток Тогда
			ПринтерЭтикеток = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ОблачнаяККТ Тогда
			ОблачнаяККТ = ОборудованиеРМ.Ссылка;
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОчиститьКэш()
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокиМакетаСлипЧека()
   
  Возврат Обработки._ДемоТестированиеПодключаемогоОборудования.ПолучитьМакет("МакетЧеков").ПолучитьТекст();

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьТекущееТО(ИмяТипа)  
	
	Если ИмяТипа = "ККТ" Тогда
		Оборудование = ККТ;
	ИначеЕсли ИмяТипа = "ТСД" Тогда
		Оборудование = ТСД;
	ИначеЕсли ИмяТипа = "Дисплей" Тогда
		Оборудование = Дисплей;
	ИначеЕсли ИмяТипа = "Весы" Тогда
		Оборудование = Весы;
	ИначеЕсли ИмяТипа = "ЭТ" Тогда
		Оборудование = ЭТ;
	ИначеЕсли ИмяТипа = "Сканер" Тогда
		Оборудование = СканерШК;
	ИначеЕсли ИмяТипа = "RFID" Тогда
		Оборудование = СчитывательRFID;
	ИначеЕсли ИмяТипа = "СМК" Тогда
		Оборудование = СчитывательМК;
	ИначеЕсли ИмяТипа = "ВесыСПечатьюЭтикеток" Тогда
		Оборудование = ВесыСПечатьюЭтикеток;
	ИначеЕсли ИмяТипа = "ПринтерЧеков" Тогда
		Оборудование = ПринтерЧеков;
	ИначеЕсли ИмяТипа = "ПЭ" Тогда
		Оборудование = ПринтерЭтикеток;
	ИначеЕсли ИмяТипа = "ОК" Тогда
		Оборудование = ОблачнаяККТ;
	ИначеЕсли ИмяТипа = "Несертифицированное" Тогда
		Оборудование = НесертифицированноеОборудование;
		
	КонецЕсли;   
	
	Возврат Оборудование;     
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура РабочееМестоПриИзменении(Элемент)

	// Заполняем оборудование рабочего места.
	ПолучитьОборудованиеРМНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьУстройствоВыполнить_Завершение(РезультатВыполнения, Параметры) Экспорт
	
	// Пишем лог
	Лог = Формат(ОбщегоНазначенияБПОКлиент.ДатаСеанса(),"ДЛФ=T") + " Имя команды: Подключить - Завершение" + Символы.ПС;
	ОписаниеОшибки = ?(РезультатВыполнения.Результат, "Команда выполнена успешно!", РезультатВыполнения.ОписаниеОшибки);
	
	// Пишем лог
	Лог = Лог + Формат(ОбщегоНазначенияБПОКлиент.ДатаСеанса(),"ДЛФ=T") + " " + ОписаниеОшибки + Символы.ПС +
	      "========================================" + Символы.ПС;
	ОтветОтУстройства = Лог + ОтветОтУстройства;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьУстройствоВыполнить(Команда)

	// Получаем имя типу оборудования.
	ИмяТипа = СтрЗаменить(ТекущийЭлемент.Имя, "Подключить", "");
	// Получаем оборудование по типу.
	Оборудование = ПолучитьТекущееТО(ИмяТипа);
	Если Оборудование.Пустая() Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьУстройствоВыполнить_Завершение", ЭтотОбъект);                                 
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоИдентификатору(ОповещенияПриПодключении, УникальныйИдентификатор, Оборудование);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьУстройствоВыполнить_Завершение(РезультатВыполнения, Параметры) Экспорт
	
	// Пишем лог
	Лог = Формат(ОбщегоНазначенияБПОКлиент.ДатаСеанса(),"ДЛФ=T") + " Имя команды: Отключить - Завершение" + Символы.ПС;
	ОписаниеОшибки = ?(РезультатВыполнения.Результат, "Команда выполнена успешно!", РезультатВыполнения.ОписаниеОшибки);
	
	Лог = Лог + Формат(ОбщегоНазначенияБПОКлиент.ДатаСеанса(),"ДЛФ=T") + " " + ОписаниеОшибки + Символы.ПС +
	      "========================================" + Символы.ПС;
	ОтветОтУстройства = Лог + ОтветОтУстройства;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьУстройствоВыполнить(Команда)
	
	// Получаем имя типу оборудования.
	ИмяТипа = СтрЗаменить(ТекущийЭлемент.Имя,"Отключить","");
	// Получаем оборудование по типу.
	Оборудование = ПолучитьТекущееТО(ИмяТипа);
	Если Оборудование.Пустая() Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОповещенияПриПодключении = Новый ОписаниеОповещения("ОтключитьУстройствоВыполнить_Завершение", ЭтотОбъект);                                 
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоИдентификатору(ОповещенияПриПодключении, УникальныйИдентификатор, Оборудование);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьУстройствоВыполнить(Команда)
	
	// Получаем имя типу оборудования.
	ИмяТипа = СтрЗаменить(ТекущийЭлемент.Имя,"Настроить","");
	// Получаем оборудование по типу.
	Оборудование = ПолучитьТекущееТО(ИмяТипа);
	Если Оборудование.Пустая() Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ИмяТипа = "ОК" Тогда
		МодульОблачныеКассы = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОблачныеКассыКлиент");
		МодульОблачныеКассы.НастройкаПодключения(Оборудование);
	Иначе
		МенеджерОборудованияКлиент.ВыполнитьНастройкуОборудования(Оборудование);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКэшВыполнить()
	
	ОчиститьКэш();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьВсеПодключенноеОборудованиеВыполнить()
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудования(Неопределено, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПО_ОставлятьПодключеннымиПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ДополнительныеПараметры.ОставитьПодключенным = ПО_ОставлятьПодключенными; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормыККМ

&НаКлиенте
Функция ПолучитьФискальноеУстройство()
	
	Если ФискальноеУстройствоТип = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ПринтерЧеков") Тогда
		ФискальноеУстройство = ПринтерЧеков
	ИначеЕсли ФискальноеУстройствоТип = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ОблачнаяККТ") Тогда
		ФискальноеУстройство = ОблачнаяККТ
	Иначе
		ФискальноеУстройство = ККТ
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	Иначе
		Возврат ФискальноеУстройство;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьШаблонЧекаПечатиШтрихкодов()
	
	Текст = ФУТекст;
	
	Если ПечатьШтрихкодаEAN8 Тогда
		Текст = Текст + Символы.ПС + "|ШтрихКод|EAN8|" + ШтрихкодEAN8;
	КонецЕсли;
	
	Если ПечатьШтрихкодаEAN13 Тогда
		Текст = Текст + Символы.ПС + "|ШтрихКод|EAN13|" + ШтрихкодEAN13;
	КонецЕсли;
	
	Если ПечатьШтрихкодаCODE39 Тогда
		Текст = Текст + Символы.ПС + "|ШтрихКод|CODE39|" + ШтрихкодCODE39;
	КонецЕсли;
	
	Если ПечатьШтрихкодаQR Тогда
		Текст = Текст + Символы.ПС + "|ШтрихКод|QR|" + ШтрихкодQR;
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

&НаСервере
Функция ПолучитьШаблонЧека()
	
	// Общие параметры чека
	ОбщиеПараметры = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииЧекаКоррекции();
	
	// Параметры установлены по умолчанию.
	ОбщиеПараметры.ТипРасчета = ТипРасчета;
	ОбщиеПараметры.Электронно = ККТ_Электронно;
	
	ОбщиеПараметры.ПокупательEmail = "test@1c.ru";
	ОбщиеПараметры.ПокупательНомер = Неопределено;
	// Параметры необходимые для чека ЕНВД на принтере чеков
	
	ОбщиеПараметры.Кассир     = "Иванов И.И";
	//ОбщиеПараметры.КассирИНН  = "7725547259";
	ОбщиеПараметры.Интернет = ККТ_Интернет; 
	ОбщиеПараметры.ЧасоваяЗона = ККТ_ЧасоваяЗона;
	
	ОбщиеПараметры.СистемаНалогообложения = СистемаНалогообложения;
	ОбщиеПараметры.ОрганизацияНазвание = "ООО ""1C-СОФТ""";
	ОбщиеПараметры.ОрганизацияИНН = "7709860400";
	ОбщиеПараметры.ОрганизацияКПП = "770901001";
	ОбщиеПараметры.НомерКассы     = "00001";
	ОбщиеПараметры.НомерЧека      = "1";
	ОбщиеПараметры.НомерСмены     = "1";
	ОбщиеПараметры.Отправляет1СSMS   = Отправляет1СSMS;   // SMS отправляет средствами 1C.
	ОбщиеПараметры.Отправляет1СEmail = Отправляет1СEmail; // Email отправляет средствами 1C. 
	ОбщиеПараметры.АдресРасчетов  = "г.Москва, Дмитровское ш. д.9";
	ОбщиеПараметры.МестоРасчетов  = "Торговый островок на 1 этаже";
	ОбщиеПараметры.СворачиватьОдинаковыеСтрокПриПечати = СворачиватьОдинаковыеСтрокПриПечати;
	
	ОбщиеПараметры.ОперационныйРеквизит.ДатаВремяОперации  = ТекущаяДатаСеанса();
	ОбщиеПараметры.ОперационныйРеквизит.ИдентификаторОперации = 0;
	ОбщиеПараметры.ОперационныйРеквизит.ДанныеОперации = "DATA";
	
	ОбщиеПараметры.ОтраслевойРеквизит.ИдентификаторФОИВ  = "001";
	ОбщиеПараметры.ОтраслевойРеквизит.ДатаДокументаОснования = ТекущаяДатаСеанса();
	ОбщиеПараметры.ОтраслевойРеквизит.НомерДокументаОснования = "2343243";
	ОбщиеПараметры.ОтраслевойРеквизит.ЗначениеРеквизита = "Ид1=Знач1&Ид2=Знач2&Ид3=Знач3";
	
	Если Не ПустаяСтрока(Клиент) Тогда
		ОбщиеПараметры.СведенияОПокупателе.Покупатель = Клиент.Наименование;
		ОбщиеПараметры.СведенияОПокупателе.ПокупательИНН = Клиент.ИНН;
		ОбщиеПараметры.СубъектПерсональныхДанных = Клиент;
		ОбщиеПараметры.ЕстьПерсональныеДанные = Истина;
		ОбщиеПараметры.Покупательemail = Клиент.ЭлектроннаяПочта;
		ОбщиеПараметры.ПокупательНомер = Клиент.Телефон;
		ОбщиеПараметры.ТипПерсональныхДанных = Перечисления.ТипыПерсональныхДанныхККТ.ПаспортныеДанные;
	КонецЕсли;
		
	// Нефискальная строка
	ТекстоваяСтрокаЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека("Для подключение оборудования к автоматизированным системам на платформе «1С:Предприятие» используется ""1С:Библиотека подключаемого оборудования"". Библиотека предоставляет набор высокоуровневых механизмов для унифицированной работы с подключаемым оборудованием. Применение данной библиотеки позволяет ускорить реализацию поддержки широкого спектра моделей подключаемого оборудования в разрабатываемых конфигурациях, а также добавить готовые функциональные блоки в уже работающие прикладные решения.");
	ТекстоваяСтрокаЧека.ПереносСтроки = Истина;
	ОбщиеПараметры.ПозицииЧека.Добавить(ТекстоваяСтрокаЧека);

	Если ОбщественноеПитание Тогда
		// Фискальная строка 1  ШК - 02400001323807
		СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
		СтрокаПозицииЧека.Наименование = "Вода общественное питание";
		СтрокаПозицииЧека.Количество   = 1; 
		СтрокаПозицииЧека.Цена         = 100;
		СтрокаПозицииЧека.Сумма        = Окр(СтрокаПозицииЧека.Цена * СтрокаПозицииЧека.Количество, 2);
		СтрокаПозицииЧека.НомерСекции  = 1;
		СтрокаПозицииЧека.СтавкаНДС    = 10;
		СтрокаПозицииЧека.СуммаНДС = РасчитатьНДС(СтрокаПозицииЧека.Сумма, СтрокаПозицииЧека.СтавкаНДС);       
		СтрокаПозицииЧека.КодЕдиницыИзмерения = "796";
		СтрокаПозицииЧека.ОбщественноеПитание = Истина;
		СтрокаПозицииЧека.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
		СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ТоварМаркируемыйСИИмеющийКМ;
		Если Не ПустаяСтрока(ККТ_КодКонтрольнойМарки) Тогда
			КодКонтрольнойМарки = ККТ_КодКонтрольнойМарки;  
			СтрокаПозицииЧека.КонтрольнаяМарка = КодКонтрольнойМарки;
		КонецЕсли;
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
		
	ИначеЕсли ПроверятьОСУ  Тогда
		
		// Фискальная строка 1  ШК - 02400001323807
		СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
		СтрокаПозицииЧека.Наименование = "Товар ОСУ весовой";
		СтрокаПозицииЧека.Количество   = 3.23; // КГ                      
		СтрокаПозицииЧека.КоличествоВесовогоТовара = 2; // Куски
		СтрокаПозицииЧека.Цена         = 100;
		СтрокаПозицииЧека.Сумма        = Окр(СтрокаПозицииЧека.Цена * СтрокаПозицииЧека.Количество, 2);
		СтрокаПозицииЧека.НомерСекции  = 1;
		СтрокаПозицииЧека.СтавкаНДС    = 10;
		СтрокаПозицииЧека.СуммаНДС = РасчитатьНДС(СтрокаПозицииЧека.Сумма, СтрокаПозицииЧека.СтавкаНДС);       
		СтрокаПозицииЧека.ОбъемноСортовойУчет = Истина;
		СтрокаПозицииЧека.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
		СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ТоварМаркируемыйСИИмеющийКМ;
		Если Не ПустаяСтрока(ККТ_КодКонтрольнойМарки) Тогда
			КодКонтрольнойМарки = ККТ_КодКонтрольнойМарки;  
			СтрокаПозицииЧека.КонтрольнаяМарка = КодКонтрольнойМарки;
		КонецЕсли;
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
		
		// Фискальная строка 2   ШК - 02400001323807
		СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
		СтрокаПозицииЧека.Наименование = "Товар ОСУ штучный";
		СтрокаПозицииЧека.Количество   = 2; // шт                      
		СтрокаПозицииЧека.Цена         = 100;
		СтрокаПозицииЧека.Сумма        = Окр(СтрокаПозицииЧека.Цена * СтрокаПозицииЧека.Количество, 2);
		СтрокаПозицииЧека.НомерСекции  = 1;
		СтрокаПозицииЧека.СтавкаНДС    = 10;
		СтрокаПозицииЧека.СуммаНДС = РасчитатьНДС(СтрокаПозицииЧека.Сумма, СтрокаПозицииЧека.СтавкаНДС);       
		СтрокаПозицииЧека.ОбъемноСортовойУчет = Истина;
		СтрокаПозицииЧека.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
		СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ТоварМаркируемыйСИИмеющийКМ;
		Если Не ПустаяСтрока(ККТ_КодКонтрольнойМарки) Тогда
			КодКонтрольнойМарки = ККТ_КодКонтрольнойМарки;  
			СтрокаПозицииЧека.КонтрольнаяМарка = КодКонтрольнойМарки;
		КонецЕсли;
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
		
	Иначе
			
		// Фискальная строка 4
		СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
		СтрокаПозицииЧека.Наименование = "Ветеринарный препарат маркировка НДС22%";
		СтрокаПозицииЧека.Количество   = ККТ_Количество;
		СтрокаПозицииЧека.Цена         = 30;
		СтрокаПозицииЧека.Сумма        = Окр(СтрокаПозицииЧека.Цена * СтрокаПозицииЧека.Количество, 2);
		СтрокаПозицииЧека.СуммаСкидок  = 0;
		СтрокаПозицииЧека.НомерСекции  = 3;        
		Если Ндс22122 Тогда
			СтрокаПозицииЧека.СтавкаНДС = 22;
		Иначе
			СтрокаПозицииЧека.СтавкаНДС  = 20;
		КонецЕсли;
		СтрокаПозицииЧека.СуммаНДС = РасчитатьНДС(СтрокаПозицииЧека.Сумма, СтрокаПозицииЧека.СтавкаНДС);       
		СтрокаПозицииЧека.СуммаАкциза  = 0;
		СтрокаПозицииЧека.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;  
		СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
		СтрокаПозицииЧека.ДатаПроизводства = ТекущаяДата();
		
		Если Не ПустаяСтрока(ККТ_КодКонтрольнойМарки) Тогда
			КодКонтрольнойМарки = ККТ_КодКонтрольнойМарки;  
			СтрокаПозицииЧека.ШтрихкодBase64  = КодКонтрольнойМарки;
			СтрокаПозицииЧека.КонтрольнаяМарка = КодКонтрольнойМарки;  
			СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ТоварМаркируемыйСИИмеющийКМ;   
		КонецЕсли;
			
		ШтучныйТовар = ККТ_ПланируемыйСтатусТовара = Перечисления.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварРеализован
			Или ККТ_ПланируемыйСтатусТовара = Перечисления.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварВозвращен;
		Если Не ШтучныйТовар Тогда
			СтрокаПозицииЧека.ДробноеКоличество.Числитель = ККТ_ДробноеКоличествоЧислитель; 
			СтрокаПозицииЧека.ДробноеКоличество.Знаменатель = ККТ_ДробноеКоличествоЗнаменатель;
		КонецЕсли;
	
		Если  ККТ_МераКоличества = Перечисления.МераКоличестваПредметаРасчетаККТ.Килограмм Тогда
			СтрокаПозицииЧека.КодЕдиницыИзмерения = "166";
		Иначе
			СтрокаПозицииЧека.КодЕдиницыИзмерения = "796";
		КонецЕсли;
		
		СтрокаПозицииЧека.ЗапросПроверкиКода.ИдентификаторЗапроса = "2ce10bdb-6510-4d37-be04-dd473b98c728";  
		СтрокаПозицииЧека.ЗапросПроверкиКода.ВременнаяМетка = "1692691702065";   
		СтрокаПозицииЧека.ЗапросПроверкиКода.ИдентификаторЭкземпляра = "4c182ce0-a325-42a9-ab9e-b5e562cc8721";
		СтрокаПозицииЧека.ЗапросПроверкиКода.ВерсияБазы = "52cadcfe-a28f-4877-8b2f-da0481ddf1fa";
		
		СтрокаПозицииЧека.ВетеринарныйПрепарат = Истина; // Признак товара, ветеринарный лекарственный препарат.
		СтрокаПозицииЧека.РецептНомер = "АБV492781";
		СтрокаПозицииЧека.РецептДата = ТекущаяДата(); 
		
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);   
	
		// Фискальная строка 4
		СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
		СтрокаПозицииЧека.Наименование = "Маркированный товар 2";
		СтрокаПозицииЧека.Количество   = ККТ_Количество;
		СтрокаПозицииЧека.Цена         = 30;
		СтрокаПозицииЧека.Сумма        = Окр(СтрокаПозицииЧека.Цена * СтрокаПозицииЧека.Количество, 2);
		СтрокаПозицииЧека.СуммаСкидок  = 0;
		СтрокаПозицииЧека.НомерСекции  = 3;
		Если Ндс22122 Тогда
			СтрокаПозицииЧека.СтавкаНДС = 122;
		Иначе
			СтрокаПозицииЧека.СтавкаНДС = 120;
		КонецЕсли;
		СтрокаПозицииЧека.СуммаНДС = РасчитатьНДС(СтрокаПозицииЧека.Сумма, СтрокаПозицииЧека.СтавкаНДС);       
		СтрокаПозицииЧека.СуммаАкциза  = 0;
		СтрокаПозицииЧека.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
		СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;   
		СтрокаПозицииЧека.ДатаПроизводства = ТекущаяДата();
		
		Если Не ПустаяСтрока(ККТ_КодКонтрольнойМарки) Тогда
			КодКонтрольнойМарки = ККТ_КодКонтрольнойМарки;  
			СтрокаПозицииЧека.ШтрихкодBase64  = КодКонтрольнойМарки;
			СтрокаПозицииЧека.КонтрольнаяМарка = КодКонтрольнойМарки;  
			СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ТоварМаркируемыйСИИмеющийКМ;   
		КонецЕсли;
		
		ШтучныйТовар = ККТ_ПланируемыйСтатусТовара = Перечисления.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварРеализован
			Или ККТ_ПланируемыйСтатусТовара = Перечисления.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварВозвращен;
		Если Не ШтучныйТовар Тогда
			СтрокаПозицииЧека.ДробноеКоличество.Числитель = 1; 
			СтрокаПозицииЧека.ДробноеКоличество.Знаменатель = 6;    
		КонецЕсли;                                                  
		
		Если  ККТ_МераКоличества = Перечисления.МераКоличестваПредметаРасчетаККТ.Килограмм Тогда
			СтрокаПозицииЧека.КодЕдиницыИзмерения = "166";
		Иначе
		СтрокаПозицииЧека.КодЕдиницыИзмерения = "796";
		КонецЕсли;
		
		СтрокаПозицииЧека.ЗапросПроверкиКода.ИдентификаторЗапроса = "2ce10bdb-6510-4d37-be04-dd473b98c728";  
		СтрокаПозицииЧека.ЗапросПроверкиКода.ВременнаяМетка = "1692691702065";   
		СтрокаПозицииЧека.ЗапросПроверкиКода.ИдентификаторЭкземпляра = "4c182ce0-a325-42a9-ab9e-b5e562cc8721";
		СтрокаПозицииЧека.ЗапросПроверкиКода.ВерсияБазы = "52cadcfe-a28f-4877-8b2f-da0481ddf1fa";
		
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);   
		
	КонецЕсли;
	
	// Фискальная строка 3
	СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	СтрокаПозицииЧека.Наименование = "Товар 3 Меховая шуба для проверки меха по сценарию ЦРПТ";
	СтрокаПозицииЧека.Количество   = 1;
	СтрокаПозицииЧека.Цена         = 100;
	СтрокаПозицииЧека.Сумма        = Окр(СтрокаПозицииЧека.Цена * СтрокаПозицииЧека.Количество, 2);
	СтрокаПозицииЧека.СуммаСкидок  = 0;
	СтрокаПозицииЧека.НомерСекции  = 1;
	СтрокаПозицииЧека.КодЕдиницыИзмерения = "796";
	СтрокаПозицииЧека.Штрихкод = "RU-430301-AAA0020659"; 
	Если Ндс22122 Тогда
		СтрокаПозицииЧека.СтавкаНДС = 122;
	Иначе
		СтрокаПозицииЧека.СтавкаНДС  = 120;
	КонецЕсли;
	СтрокаПозицииЧека.СуммаНДС = РасчитатьНДС(СтрокаПозицииЧека.Сумма, СтрокаПозицииЧека.СтавкаНДС);      
	СтрокаПозицииЧека.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ТоварМаркируемыйСИНеИмеющийКМ;
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
	// Фискальная строка 4
	СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	СтрокаПозицииЧека.Наименование = "Товар 4 Простой обычный товар весовой";
	СтрокаПозицииЧека.Количество   = 0.60;
	СтрокаПозицииЧека.Цена         = 150;
	СтрокаПозицииЧека.Сумма        = Окр(СтрокаПозицииЧека.Цена * СтрокаПозицииЧека.Количество, 2);
	СтрокаПозицииЧека.НомерСекции  = 3;
	СтрокаПозицииЧека.СтавкаНДС = 20;  
	СтрокаПозицииЧека.СуммаНДС = РасчитатьНДС(СтрокаПозицииЧека.Сумма, СтрокаПозицииЧека.СтавкаНДС);
	СтрокаПозицииЧека.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	СтрокаПозицииЧека.КодЕдиницыИзмерения = "166";            
	
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
	СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека("Другая товарная позиция c очень длинным наименование для проверки");
	СтрокаПозицииЧека.ПереносСтроки = Истина;
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
	СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека("Строка по центру");
	СтрокаПозицииЧека.Выравнивание  = "Центр";
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
	СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыШтрихкодВСтрокеЧека("EAN13", "2900001462105");
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
	ОбщиеПараметры.ИдентификаторОплатыПлатежнойСистемы = "ИдентификаторОплатыПлатежнойСистемы";
	ОбщиеПараметры.ТипПлатежнойСистемы = ПредопределенноеЗначение("Перечисление.ТипыПлатежнойСистемыККТ.СистемаБыстрыхПлатежей");
	ОбщиеПараметры.QRКод.ЗначениеКода = "https://qr.nspk.ru/AD10003UOKK4J3J09SO9M1CSQ2U23BQC?type=02&bank=540000000001&sum=10010&cur=RUB&crc=86EE";
	
	ДетализацияОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыДетализацииСтрокиОплаты();
	ДетализацияОплаты.НаименованиеТипаОплаты = "СЕРТИФИКАТОМ";
	ДетализацияОплаты.Сумма = 800;
	ОбщиеПараметры.ДетализацияОплаты.Добавить(ДетализацияОплаты);
	
	ДетализацияОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыДетализацииСтрокиОплаты();
	ДетализацияОплаты.НаименованиеТипаОплаты = "КАРТА МИР";
	ДетализацияОплаты.Сумма = 200;
	ОбщиеПараметры.ДетализацияОплаты.Добавить(ДетализацияОплаты);
	
	Если НесколькоВидовОплат Тогда
		СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты(1000);
		СтрокаОплаты.ТипОплаты = Перечисления.ТипыОплатыККТ.Наличные;
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
		
		СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты(200);
		СтрокаОплаты.ТипОплаты = Перечисления.ТипыОплатыККТ.Электронно;
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	Иначе
		СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты(1000); 
		СтрокаОплаты.ТипОплаты = Перечисления.ТипыОплатыККТ.Наличные;
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	КонецЕсли;                      
	
	Если НесколькоВидовОплат Тогда
		СведенияОБезналичнойОплате = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСведенияОБезналичнойОплате();
		СведенияОБезналичнойОплате.Сумма = 200;
		СведенияОБезналичнойОплате.ПризнакСпособаОплаты = 1;
		СведенияОБезналичнойОплате.Идентификаторы = "date=1626454200&rrn=YJJJHHNNNNNN&tid=12345678&ps=22&acq=12345678912&auth=Z2Y22D";
		СведенияОБезналичнойОплате.ДополнительныеCведения = "uuid=1876876087657655";
		ОбщиеПараметры.СведенияОБезналичнойОплате.Добавить(СведенияОБезналичнойОплате);
	КонецЕсли;                      
	
	ОбщиеПараметры.ДанныеКоррекции.ТипКоррекции      = 0;
	ОбщиеПараметры.ДанныеКоррекции.ОписаниеКоррекции = "Чек ККМ";
	ОбщиеПараметры.ДанныеКоррекции.ДатаКоррекции     = ТекущаяДата();
	ОбщиеПараметры.ДанныеКоррекции.НомерПредписания  = "101";

	Если НефискальнаяКвитанция Тогда
		
		НефискальныйДокумент = Новый Массив();
		
		СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека("Накопление по карте: 234543443");
		НефискальныйДокумент.Добавить(СтрокаПозицииЧека);
	
		СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека("Другая товарная позиция c очень длинным наименование для проверки");
		СтрокаПозицииЧека.ПереносСтроки = Истина;
		НефискальныйДокумент.Добавить(СтрокаПозицииЧека);
	
		СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека("Другая f");
		СтрокаПозицииЧека.Выравнивание  = "Центр";
		НефискальныйДокумент.Добавить(СтрокаПозицииЧека);
	
		СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыШтрихкодВСтрокеЧека("EAN13", "2900001462105");
		НефискальныйДокумент.Добавить(СтрокаПозицииЧека);
	
		ОбщиеПараметры.НефискальныеДокументы.Добавить(НефискальныйДокумент);
		
	КонецЕсли;
	
	Возврат ОбщиеПараметры;
	
КонецФункции

&НаКлиенте
Функция ПараметрыВыполненияОперации();
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
	ПараметрыОперации.Кассир = НСтр("ru='Иванов П.П.'");
	ПараметрыОперации.КассирИНН = "526317984689";
	ПараметрыОперации.АдресРасчетов = "Дмитровское ш. д.9";
	ПараметрыОперации.МестоРасчетов = "1 Этаж";
	ПараметрыОперации.Печать = ККТ_Печать;                      
	ПараметрыОперации.СинхронизацииВремени = ККТ_СинхронизацииВремени;

	Если ФискальноеУстройствоТип = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ОблачнаяККТ") Тогда
		ПараметрыОперации.ОблачнаяККТ = Истина;
	КонецЕсли;
	Возврат ПараметрыОперации;
	
КонецФункции

&НаКлиенте
Процедура ФУ_КомандаВыполнитьЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ОчиститьСообщения();
	Элементы.ФискальноеУстройство.Доступность = Истина;
	
	НомерСмены  = Неопределено; 
	НомерЧека   = Неопределено;
	СтатусСмены = Неопределено;
	ФискальныйПризнак = Неопределено;
	СайтПроверкиОФД   = Неопределено;
	
	Если РезультатВыполнения.Результат Тогда
		
		ТекстСообщения = НСтр("ru='Операция завершена.'");
		
		ККТ_Параметры.Очистить();
		
		Если РезультатВыполнения.Свойство("НомерЧекаККТ") Тогда
			НомерЧека = РезультатВыполнения.НомерЧекаККТ;
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("НомерСменыККТ") Тогда
			НомерСмены = РезультатВыполнения.НомерСменыККТ;
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("ШиринаСтроки") Тогда
			Сообщить("ШиринаСтроки:" + РезультатВыполнения.ШиринаСтроки);    
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("СтатусСмены") Тогда
			СтатусСмены = РезультатВыполнения.СтатусСмены;
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("ФискальныйПризнак") Тогда
			ФискальныйПризнак = РезультатВыполнения.ФискальныйПризнак;
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("АдресСайтаПроверки") Тогда
			СайтПроверкиОФД = РезультатВыполнения.АдресСайтаПроверки;
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("ИдентификаторСессии") Тогда
			ИдентификаторСессии = РезультатВыполнения.ИдентификаторСессии;
		КонецЕсли;     
		
		Если РезультатВыполнения.Свойство("ПараметрыККТ") Тогда
			ВывестиСвойства(РезультатВыполнения.ПараметрыККТ)
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("ФискальныеДанные") Тогда
			ВывестиСвойства(РезультатВыполнения.ФискальныеДанные)
		КонецЕсли;                 
		
		Если РезультатВыполнения.Свойство("ФискальныеДанныеСтруктура") Тогда
			ВывестиСвойства(РезультатВыполнения.ФискальныеДанныеСтруктура)
		КонецЕсли;                 
		
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
		// Пишем лог
		ОтветОтУстройства = ОтветОтУстройства + ТекстСообщения + Символы.ПС;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_КомандаВыполнитьЗавершениеКМ(РезультатВыполнения, Параметры) Экспорт
	
	//ОчиститьСообщения();
	Элементы.ФискальноеУстройство.Доступность = Истина;
	ККТ_КодМаркировкиПроверенФискальнымНакопителем = Ложь;
	ККТ_РезультатПроверкиФискальнымНакопителемПоложительный = Ложь;
	ККТ_РезультатПроверки = Ложь;
	ККТ_КодМаркировки_Текст = "";
	
	Если РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru='Операция завершена.'");
		
		Если РезультатВыполнения.Свойство("КодМаркировкиПроверен") Тогда
			ККТ_КодМаркировкиПроверенФискальнымНакопителем = РезультатВыполнения.КодМаркировкиПроверен;
		КонецЕсли;
		Если РезультатВыполнения.Свойство("РезультатПроверки") Тогда
			ККТ_РезультатПроверкиФискальнымНакопителемПоложительный = РезультатВыполнения.РезультатПроверки;
		КонецЕсли;
		Если РезультатВыполнения.Свойство("РезультатПроверкиОИСМ") Тогда
			ККТ_РезультатПроверки = РезультатВыполнения.РезультатПроверкиОИСМ;
		КонецЕсли;
		Если РезультатВыполнения.Свойство("КодОбработкиЗапроса") Тогда
			ККТ_КодОбработкиЗапроса = РезультатВыполнения.КодОбработкиЗапроса;
		КонецЕсли;
		Если РезультатВыполнения.Свойство("СтатусТовара") Тогда
			ККТ_ОтветОИСМОСтатусеТовара = РезультатВыполнения.СтатусТовара;
		КонецЕсли;
		Если РезультатВыполнения.Свойство("РезультатПроверкиСведенийОТоваре") Тогда
			ККТ_КодМаркировки_Текст = РезультатВыполнения.РезультатПроверкиСведенийОТовареПФ + РезультатВыполнения.РезультатПроверкиСведенийОТоваре;
		КонецЕсли;
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
		// Пишем лог
		ОтветОтУстройства = ОтветОтУстройства + ТекстСообщения + Символы.ПС;
	КонецЕсли;
	
	//----------------------------
	
	Если РезультатВыполнения.Свойство("РезультатыОпераций") Тогда
		РезультатОперации = РезультатВыполнения.РезультатыОпераций[0];
		ТекстСообщения = РезультатОперации.ОписаниеОшибки;
	Иначе
		РезультатОперации = РезультатВыполнения;
	КонецЕсли;
	
	Если РезультатОперации.Результат Тогда
		ТекстСообщения = НСтр("ru='Операция завершена.'");
	Иначе
		ТекстСообщения = РезультатОперации.ОписаниеОшибки;
		// Пишем лог
		ОтветОтУстройства = ОтветОтУстройства + ТекстСообщения + Символы.ПС;
	КонецЕсли;
	
	
	Если РезультатОперации.Свойство("КодМаркировкиПроверен") Тогда
		ККТ_КодМаркировкиПроверенФискальнымНакопителем = РезультатОперации.КодМаркировкиПроверен;
	КонецЕсли;
	Если РезультатОперации.Свойство("РезультатПроверки") Тогда
		ККТ_РезультатПроверкиФискальнымНакопителемПоложительный = РезультатОперации.РезультатПроверки;
	КонецЕсли;
	Если РезультатОперации.Свойство("РезультатПроверкиОИСМ") Тогда
		ККТ_РезультатПроверки = РезультатОперации.РезультатПроверкиОИСМ;
	КонецЕсли;
	Если РезультатОперации.Свойство("КодОбработкиЗапроса") Тогда
		ККТ_КодОбработкиЗапроса = РезультатОперации.КодОбработкиЗапроса;
	КонецЕсли;
	Если РезультатОперации.Свойство("СтатусТовара") Тогда
		ККТ_ОтветОИСМОСтатусеТовара = РезультатОперации.СтатусТовара;
	КонецЕсли;
	
	Если РезультатОперации.Результат Тогда
		
		ККТ_РезультатПроверкиТаблица.Очистить();
		Строка = ККТ_РезультатПроверкиТаблица.Добавить();
		Строка.Название = "Результат";
		Строка.Значение = РезультатОперации.Результат;
		
		Строка = ККТ_РезультатПроверкиТаблица.Добавить();
		Строка.Название = "ОписаниеОшибки";
		Строка.Значение = РезультатОперации.ОписаниеОшибки;
		
		Если РезультатОперации.Свойство("Валидация") Тогда
			Строка = ККТ_РезультатПроверкиТаблица.Добавить();
			Строка.Название = "Валидация";
			Строка.Значение = РезультатОперации.Валидация;
		КонецЕсли;
		
		Если РезультатОперации.Свойство("ПродажаРазрешена") Тогда
			Строка = ККТ_РезультатПроверкиТаблица.Добавить();
			Строка.Название = "ПродажаРазрешена";
			Строка.Значение = РезультатОперации.ПродажаРазрешена;
		КонецЕсли;
		
		Если РезультатОперации.Свойство("ПроверкаКМ") Тогда
			Строка = ККТ_РезультатПроверкиТаблица.Добавить();
			Строка.Название = "ПроверкаКМ";   // РезультатПроверкиКМ
			Строка.Значение = РезультатОперации.ПроверкаКМ;
		КонецЕсли;
		
		Если РезультатОперации.Свойство("ПодтверждениеВыполнено") Тогда
			Строка = ККТ_РезультатПроверкиТаблица.Добавить();
			Строка.Название = "ПодтверждениеВыполнено";
			Строка.Значение = РезультатОперации.ПодтверждениеВыполнено;
		КонецЕсли;
		
		Если РезультатОперации.Свойство("РезультатПроверкиСведенийОТоваре") Тогда
			Строка = ККТ_РезультатПроверкиТаблица.Добавить();
			Строка.Название = "РезультатПроверкиСведенийОТоваре";
			Строка.Значение = РезультатОперации.РезультатПроверкиСведенийОТоваре;
		КонецЕсли;
		
		Если РезультатОперации.Свойство("РезультатПроверкиСведенийОТовареПФ") Тогда
			Строка = ККТ_РезультатПроверкиТаблица.Добавить();
			Строка.Название = "РезультатПроверкиСведенийОТовареПФ";
			Строка.Значение = РезультатОперации.РезультатПроверкиСведенийОТовареПФ;
		КонецЕсли;
		
		Если РезультатОперации.Свойство("СтатусТовара") Тогда
			Строка = ККТ_РезультатПроверкиТаблица.Добавить();
			Строка.Название = "СтатусТовара";
			Строка.Значение = РезультатОперации.СтатусТовара;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ДекорацияОжидание.Видимость = Ложь;
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры

&НаКлиенте
Процедура ФУ_ОткрытьСмену(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;

	Элементы.ФискальноеУстройство.Доступность = Ложь;     
	
	ПараметрыОперации = ПараметрыВыполненияОперации();    
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьОткрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ЗакрытьСмену(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	ПараметрыОперации = ПараметрыВыполненияОперации();
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьЗакрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ВнестиСумму(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыИнкассации();
	ПараметрыОперации.ТипИнкассации = 1;
	ПараметрыОперации.Сумма = СуммаИнкассации;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьИнкассациюНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ИзъятьСумму(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыИнкассации();
	ПараметрыОперации.ТипИнкассации = 0;
	ПараметрыОперации.Сумма = СуммаИнкассации;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьИнкассациюНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ПечатьТекста(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	СтрокиПечати = ПолучитьСтрокиМакетаСлипЧека();
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПечатиТекста(СтрокиПечати);
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект, Параметры);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПечатьТекста(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации, ДополнительныеПараметры); 
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ОтчетОТекущемСостоянииРасчетов(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	ПараметрыОперации = ПараметрыВыполненияОперации();
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФормированиеОтчетаОТекущемСостоянииРасчетов(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ОтчетБезГашения(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	ПараметрыОперации = ПараметрыВыполненияОперации();
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФормированиеОтчетаБезГашения(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ОперацияФН_Продолжить(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения <> Неопределено И Тип(РезультатВыполнения) = Тип("Структура") Тогда
		ФискальноеУстройство = ПолучитьФискальноеУстройство();
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьОперациюФНДляФискальногоУстройства(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, РезультатВыполнения, ДополнительныеПараметры); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ОперацияФН(Команда)
	
#Если ВебКлиент Тогда
	ПоказатьПредупреждение(, НСтр("ru='Данный функционал доступен только в режиме тонкого и толстого клиента.'"));
	Возврат;
#КонецЕсли
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Обработчик = Новый ОписаниеОповещения("ФУ_ОперацияФН_Продолжить", ЭтотОбъект);
	
	ПараметрыОткрытия = ОборудованиеЧекопечатающиеУстройстваКлиент.ПараметрыФормаНастройкиРегистрацииККТ();
	ПараметрыОткрытия.ФискальноеУстройство = ФискальноеУстройство;
	ОборудованиеЧекопечатающиеУстройстваКлиент.ОткрытьФормуНастройкиРегистрацииККТ(Обработчик, ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_НапечататьЧекПоШаблону(Команда)
	
	ДанныеСканера = "";
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	ПараметрыОперации = ПолучитьШаблонЧека();
	
	Если ФискальноеУстройствоТип = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ОблачнаяККТ") Тогда
		ПараметрыОперации.ОблачнаяККТ = Истина;
		ПараметрыОперации.ДокументОснование = ПО_ЧекДокументОснование();
	КонецЕсли;
	
	ФУ_ПровестиФорматноЛогическийКонтрольНаСервере(ПараметрыОперации, ФискальноеУстройство);
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ФУ_ПровестиФорматноЛогическийКонтрольНаСервере(ПараметрыОперации, ФискальноеУстройство)
	
	Если ОбщегоНазначенияБПО.ИспользуетсяФорматноЛогическийКонтроль() Тогда
		МодульФорматноЛогическийКонтроль = ОбщегоНазначенияБПО.ОбщийМодуль("ФорматноЛогическийКонтроль");
		МодульФорматноЛогическийКонтроль.ПровестиФорматноЛогическийКонтроль(ПараметрыОперации, ФискальноеУстройство); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ПечатьЧекаКоррекции(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	ПараметрыОперации = ПолучитьШаблонЧека();
	ПараметрыОперации.НеприменениеККТ = Истина;
	
	Если ФискальноеУстройствоТип = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ОблачнаяККТ") Тогда
		ПараметрыОперации.ОблачнаяККТ = Истина;
		ПараметрыОперации.ДокументОснование = ПО_ЧекДокументОснование(); 
		
	КонецЕсли;
	ФУ_ПровестиФорматноЛогическийКонтрольНаСервере(ПараметрыОперации, ФискальноеУстройство);
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФормированиеЧекаКоррекцииНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ПечатьКопиюЧека(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПечатьКопииЧека();  
	ПараметрыОперации.ФискальныйПризнак = ФискальныйПризнак;     
	ПараметрыОперации.Аппаратно = Истина;
	ПараметрыОперации.НомерЧека = НомерЧека;   
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПечатьКопииЧека(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ПолучитьПараметры(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолучениеПараметровФискальногоУстройства(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, Неопределено, ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ФУ_ПолучитьТекущееСостояние(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолучениеТекущегоСостоянияФискальногоУстройства(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, Неопределено, ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ФУ_ОткрытьДенежныйЯщик(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьОткрытиеДенежногоЯщика(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, Неопределено, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ПолучитьШиринуСтроки(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолучениеШириныСтрокиПечатающегоУстройства(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, Неопределено, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ПечатьТекстаИШтрихкода(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	СтрокиПечати = ПолучитьШаблонЧекаПечатиШтрихкодов();
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПечатиТекста(СтрокиПечати);
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект, Параметры);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПечатьТекста(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации, ДополнительныеПараметры); 
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ПечатьQRКода(Команда)
	
	QRКод = "https://qr.nspk.ru/AD1000623N4ORCMA9FDQU6N1269ORTHV?type=02&bank=100000000015&sum=100&cur=RUB&crc=F707";
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	ОтветОтУстройства = QRКод + Символы.ПС;
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПечатиQRКодаНаФискальномУстройстве();
	ПараметрыОперации.ТипПлатежнойСистемы = ПредопределенноеЗначение("Перечисление.ТипыПлатежнойСистемыККТ.СистемаБыстрыхПлатежей");
	ПараметрыОперации.QRКод.ЗначениеКода = QRКод;
	ПараметрыОперации.СуммаОперации = 100;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект, Параметры);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПечатьQRКодаНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации, ДополнительныеПараметры); 

КонецПроцедуры

&НаКлиенте
Процедура ФУ_АннулироватьЧек(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииАннулированияЧека();
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьАннулированиеЧекаНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации);

КонецПроцедуры

&НаКлиенте
Процедура ФУ_ОткрытьСессиюРегистрацииКМ(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьОткрытиеСессииРегистрацииКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, Неопределено, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ЗакрытьСессиюРегистрацииКМ(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьЗакрытииСессииРегистрацииКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, Неопределено, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ПодготовитьКМ(Команда)
	
	КодКонтрольнойМаркиСтрока = СтрЗаменить(ККТ_КодКонтрольнойМаркиСтрока, "\u001d", ОбщегоНазначенияБПОКлиентСервер.РазделительGS1());
	ККТ_КодКонтрольнойМарки = ОбщегоНазначенияБПОКлиентСервер.ШтрихкодВBase64(КодКонтрольнойМаркиСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ТехническийКМ(Команда)
	
	GTIN = "02900001462105";
	СерийныйНомер = "523452";
	
	ККТ_КодКонтрольнойМарки = МенеджерОборудованияМаркировкаКлиентСервер.СформироватьТехническийКодДляНечитаемогоDataMatrixВBase64(GTIN, СерийныйНомер); 
	
	МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(ККТ_КодКонтрольнойМарки, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ПолучитьРезультатыЗапросаКМ(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершениеКМ", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолученияРезультатовЗапросаКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, Неопределено, ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ФУ_ЗапросКМ(Команда)
	
	ШтучныйТовар = ККТ_ПланируемыйСтатусТовара = ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварРеализован")
		Или ККТ_ПланируемыйСтатусТовара = ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварВозвращен");
		
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	ККТ_УникальныйИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор); 
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыЗапросКМ();
	ПараметрыОперации.ИдентификаторЗапроса = ККТ_УникальныйИдентификаторЗапроса;
	ПараметрыОперации.ОжидатьПолучениеОтветаОИСМ = ОжидатьПолучениеОтветаОИСМ;      
	ПараметрыОперации.ОтправлятьНаСерверОИСМ = НЕ ЗапросКМФормируетсяЛокально;
	
		ПараметрыОперации.Количество = ККТ_Количество;  
	Если Не ШтучныйТовар Тогда
		ПараметрыОперации.ДробноеКоличество.Числитель   = ККТ_ДробноеКоличествоЧислитель;     
		ПараметрыОперации.ДробноеКоличество.Знаменатель = ККТ_ДробноеКоличествоЗнаменатель;     
		ПараметрыОперации.МераКоличестваПредметаРасчета = ККТ_МераКоличества;
	КонецЕсли;
	ПараметрыОперации.ПланируемыйСтатусТовара = ККТ_ПланируемыйСтатусТовара;
	ПараметрыОперации.КонтрольнаяМарка = ККТ_КодКонтрольнойМарки;
	
	
	ПараметрыОперации.ДополнительныеПараметры = "Какой-то идентификатор";
	ПараметрыОперации.ЗапросПроверкиКМСредствамиККТ = НЕ ЗапросКМФормируетсяЛокально;
	ПараметрыОперации.ВремяЗапросаРазрешения = "1706171074043";
	ПараметрыОперации.Наименование = "Груша";
	ПараметрыОперации.ИгнорироватьРезультатПроверкиКМ = ФУ_ИгнорироватьРезультатПроверкиКМ;
	ПараметрыОперации.ОжидатьПолучениеОтветаОИСМ = ОжидатьПолучениеОтветаОИСМ;      
#Если ВебКлиент Тогда
	СлучайноеЧисло = СлучайноеЧислоНаСервере(0, 10);
#Иначе
	СлучайноеЧисло = СлучайноеЧисло(0, 10);
#КонецЕсли
	Если СлучайноеЧисло > 8 Тогда
		ПараметрыОперации.ЗапросРазрешенияПродажиКМ = Ложь;
	Иначе
		ПараметрыОперации.ЗапросРазрешенияПродажиКМ = Истина;
		Если СлучайноеЧисло > 6 Тогда
		ИначеЕсли СлучайноеЧисло > 4 Тогда
			ПараметрыОперации.КодОтветаРазрешения = 203;
			ФУ_ЗаполнитьРезультатЗапросаРазрешения(ПараметрыОперации);
		ИначеЕсли СлучайноеЧисло > 2 Тогда
			ПараметрыОперации.КодОтветаРазрешения = 401;
			ФУ_ЗаполнитьРезультатЗапросаРазрешения(ПараметрыОперации);
		Иначе
			ПараметрыОперации.КодОтветаРазрешения = 400;
			ФУ_ЗаполнитьРезультатЗапросаРазрешения(ПараметрыОперации);
		КонецЕсли;
	КонецЕсли;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершениеКМ", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьЗапросКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ПодтверждениеКМ(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПодтверждениеКМ();
	ПараметрыОперации.ИдентификаторЗапроса = ККТ_УникальныйИдентификаторЗапроса;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершениеКМ", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПодтверждениеКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации, ДополнительныеПараметры);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ФУ_ЗаполнитьРезультатЗапросаРазрешения(ПараметрыОперации)
	
	Текст = "{
		|""code"": 0,
		|""description"": ""ok"",
		|""codes"": [
		|	{
		|		""cis"":""01048657365749062155esJWe93dGVz"",
		|		""valid"": true,
		|		""printView"": ""01048657365749062155esJWe"",
		|		""gtin"": ""04865736574906"",
		|		""groupIds"": [
		|			15
		|		],
		|		""verified"": true,
		|		""found"": true,
		|		""realizable"": false,
		|		""utilised"": true,
		|		""isBlocked"": false,
		|		""expireDate"": ""2024-08-16T00:00:00.000Z"",
		|		""productionDate"": ""2023-08-16T00:00:00.000Z"",
		|		""errorCode"": 0,
		|		""isTracking"": false,
		|		""sold"": true,
		|		""packageType"": ""UNIT"",
		|		""producerInn"": ""7731376812"",
		|		""grayZone"": false,
		|		""soldUnitCount"": 49000,
		|		""innerUnitCount"": 50000
		|	}
		|],
		|""reqId"": ""2ce10bdb-6510-4d37-be04-dd473b98c728"",
		|""reqTimestamp"": "+ОбщегоНазначенияБПОКлиентСервер.ДатуВTimestamp(ТекущаяДата()) + "
		|}";
	ПараметрыОперации.РезультатЗапросаРазрешения = Текст;

КонецПроцедуры

&НаКлиенте
Процедура ФУ_ПроверитьКМ(Команда)
	
	Элементы.ДекорацияОжидание.Видимость = Истина;
	
	ШтучныйТовар = ККТ_ПланируемыйСтатусТовара = ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварРеализован")
		Или ККТ_ПланируемыйСтатусТовара = ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварВозвращен");
		
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	ККТ_УникальныйИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор); 
	
	Марки = Новый Массив();
	Если ПустаяСтрока(ККТ_КодКонтрольнойМарки) Тогда
		Марки.Добавить(ОбщегоНазначенияБПОКлиентСервер.ШтрихкодВBase64("(01)04062058711785(21)_BX8=Id(J5x,6"));
		Марки.Добавить(ОбщегоНазначенияБПОКлиентСервер.ШтрихкодВBase64("(01)04062058711785(21)*TH0hYU<FVV1-"));
		Марки.Добавить(ОбщегоНазначенияБПОКлиентСервер.ШтрихкодВBase64("(01)04062058711785(21)0 0 0 &L0'ruoUNpevv"));
		Марки.Добавить(ОбщегоНазначенияБПОКлиентСервер.ШтрихкодВBase64("(01)04062058711785(21)9j9WJEaXW+gLT"));
	Иначе
		Марки.Добавить(ККТ_КодКонтрольнойМарки);
	КонецЕсли;
	
	// Создание структуры параметров
	ПараметрыПакетнойОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПроверкиКМ();
	ПараметрыПакетнойОперации.ОтображатьФорму = ФУ_ФормаБПО;
#Если ВебКлиент Тогда
	СлучайныеЧисла = СлучайныеЧислаНаСервере(0, 10, Марки.Количество());
#Иначе
	СлучайныеЧисла = СлучайныеЧисла(0, 10, Марки.Количество());
#КонецЕсли
	Для Индекс = 0 По Марки.ВГраница() Цикл
		ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыЗапросКМ();
		ПараметрыОперации.ДополнительныеПараметры = "Какой-то идентификатор";
		ПараметрыОперации.ЗапросПроверкиКМСредствамиККТ = НЕ ЗапросКМФормируетсяЛокально;
		ПараметрыОперации.ВремяЗапросаРазрешения = "1706171074043";
		ПараметрыОперации.Наименование = "Груша";
		ПараметрыОперации.ИгнорироватьРезультатПроверкиКМ = ФУ_ИгнорироватьРезультатПроверкиКМ;
		ПараметрыОперации.ОжидатьПолучениеОтветаОИСМ = ОжидатьПолучениеОтветаОИСМ;      
		СлучайноеЧисло = СлучайныеЧисла[Индекс];
		Если СлучайноеЧисло > 8 Тогда
			ПараметрыОперации.ЗапросРазрешенияПродажиКМ = Ложь;
		Иначе
			ПараметрыОперации.ЗапросРазрешенияПродажиКМ = Истина;
			Если СлучайноеЧисло > 6 Тогда
			ИначеЕсли СлучайноеЧисло > 4 Тогда
				ПараметрыОперации.КодОтветаРазрешения = 203;
				ФУ_ЗаполнитьРезультатЗапросаРазрешения(ПараметрыОперации);
			ИначеЕсли СлучайноеЧисло > 2 Тогда
				ПараметрыОперации.КодОтветаРазрешения = 401;
				ФУ_ЗаполнитьРезультатЗапросаРазрешения(ПараметрыОперации);
			Иначе
				ПараметрыОперации.КодОтветаРазрешения = 400;
				ФУ_ЗаполнитьРезультатЗапросаРазрешения(ПараметрыОперации);
			КонецЕсли;
		КонецЕсли;
		
		Если Не ШтучныйТовар Тогда
			ПараметрыОперации.Количество = ККТ_Количество;  
			ПараметрыОперации.ДробноеКоличество.Числитель   = ККТ_ДробноеКоличествоЧислитель;     
			ПараметрыОперации.ДробноеКоличество.Знаменатель = ККТ_ДробноеКоличествоЗнаменатель;     
			ПараметрыОперации.МераКоличестваПредметаРасчета = ККТ_МераКоличества;
		КонецЕсли;
		ПараметрыОперации.ПланируемыйСтатусТовара = ККТ_ПланируемыйСтатусТовара;
		ПараметрыОперации.КонтрольнаяМарка = Марки[Индекс];
		
		ПараметрыОперации.ПродажаРазрешена = (СлучайноеЧисло % 2) = 0;
		Если Не ПараметрыОперации.ПродажаРазрешена Тогда
			ПараметрыОперации.ПричинаЗапрета = "Запрщена продажа по какой то причине";
		КонецЕсли;
		ДопСведения = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ДополнительноеСведениеЗапросаКМ();
		ДопСведения.Заголовок = "Срок годности";
		ДопСведения.Значение = ДобавитьМесяц(ТекущаяДата(), -2);
		ПараметрыОперации.ДополнительныеСведения.Добавить(ДопСведения);
		ДопСведения = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ДополнительноеСведениеЗапросаКМ();
		ДопСведения.Заголовок = "ИНН поставщика";
		ДопСведения.Значение = "123456789094";
		ПараметрыОперации.ДополнительныеСведения.Добавить(ДопСведения);
		
		
		ПараметрыПакетнойОперации.ЗапросыКМ.Добавить(ПараметрыОперации);
	КонецЦикла;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершениеКМ", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПроверкуКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыПакетнойОперации, ДополнительныеПараметры);
	Если Не ФУ_ФормаБПО Тогда
		ПодключитьОбработчикОжидания("Подключаемый_СтатусПроверкаКМ", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ФУ_ЗаписатьВЖурналОперацийКМНаСервере()
	// Вставить содержимое обработчика.
	
	ПараметрыЗаписи = МенеджерОборудованияМаркировка.ПараметрыЗаписиОперацииПроверкиКМ();
	ПараметрыЗаписи.Наименование = "Яблоки Голден";
	ПараметрыЗаписи.КонтрольнаяМарка = ОбщегоНазначенияБПОКлиентСервер.ШтрихкодВBase64("(01)04062058711785(21)9j9WJEaXW+gLT");
	
	ГенераторСч = Новый ГенераторСлучайныхЧисел();
	СЧ = ГенераторСч.СлучайноеЧисло(0, 10);
	Если СЧ > 8 Тогда
		ПараметрыЗаписи.КодОтветаРазрешения = 200;
		ФУ_ЗаполнитьРезультатЗапросаРазрешения(ПараметрыЗаписи);
	ИначеЕсли СЧ > 6 Тогда
		ПараметрыЗаписи.КодОтветаРазрешения = 203;
		ФУ_ЗаполнитьРезультатЗапросаРазрешения(ПараметрыЗаписи);
	ИначеЕсли СЧ > 3 Тогда
		ПараметрыЗаписи.КодОтветаРазрешения = 401;
		ФУ_ЗаполнитьРезультатЗапросаРазрешения(ПараметрыЗаписи);
	Иначе
		ПараметрыЗаписи.КодОтветаРазрешения = 200;
		ФУ_ЗаполнитьРезультатЗапросаРазрешения(ПараметрыЗаписи);
	КонецЕсли;
	
	МенеджерОборудованияМаркировка.ДобавитьЗаписьВЖурналОперацийПроверкиКМ(ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ЗаписатьВЖурналОперацийКМ(Команда)
	ФУ_ЗаписатьВЖурналОперацийКМНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ФУ_ПроверитьДобавлениеДанныхПолученныхРанееНаСервере()
	
	ПараметрыЗаписи = МенеджерОборудованияМаркировка.ПараметрыЗаписиОперацииПроверкиКМ();
	ПараметрыЗаписи.Наименование = "Груши спелые";
	ПараметрыЗаписи.КонтрольнаяМарка = ОбщегоНазначенияБПОКлиентСервер.ШтрихкодВBase64("(01)04062058711785(21)9j9WJEaXW+gLT");
	
	ГенераторСч = Новый ГенераторСлучайныхЧисел();
	СЧ = ГенераторСч.СлучайноеЧисло(0, 10);
	Если СЧ > 8 Тогда
		ПараметрыЗаписи.КодОтветаРазрешения = 200;
		ФУ_ЗаполнитьРезультатЗапросаРазрешения(ПараметрыЗаписи);
	ИначеЕсли СЧ > 6 Тогда
		ПараметрыЗаписи.КодОтветаРазрешения = 203;
		ФУ_ЗаполнитьРезультатЗапросаРазрешения(ПараметрыЗаписи);
	ИначеЕсли СЧ > 3 Тогда
		ПараметрыЗаписи.КодОтветаРазрешения = 401;
		ФУ_ЗаполнитьРезультатЗапросаРазрешения(ПараметрыЗаписи);
	Иначе
		ПараметрыЗаписи.КодОтветаРазрешения = 200;
		ФУ_ЗаполнитьРезультатЗапросаРазрешения(ПараметрыЗаписи);
	КонецЕсли;
	
	ПараметрыЗаписи.ИдентификаторЗапросаРазрешения = Строка(Новый УникальныйИдентификатор());
	ПараметрыЗаписи.АдресСервераЗапросаРазрешения = "адрес запроса разрешения";
	ПараметрыЗаписи.ТекстЗапросаРазрешения = "текст запроса разрешения";
	МенеджерОборудованияМаркировка.ДобавитьЗаписьВЖурналОперацийПроверкиКМ(ПараметрыЗаписи);
	
	ПараметрыЗаписи.АдресСервераЗапросаРазрешения = "";
	ПараметрыЗаписи.ТекстЗапросаРазрешения = "";
	ПараметрыЗаписи.РезультатЗапросаРазрешения = "";
	ПараметрыЗаписи.ВремяЗапросаРазрешения = ТекущаяДата();
	МенеджерОборудованияМаркировка.ДобавитьЗаписьВЖурналОперацийПроверкиКМ(ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ПроверитьДобавлениеДанныхПолученныхРанее(Команда)
	
	ФУ_ПроверитьДобавлениеДанныхПолученныхРанееНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СтатусПроверкаКМ()
	
	Результат = МенеджерОборудованияМаркировкаКлиент.СостояниеПроверкиКМ();
	Если Результат.ОбработкаЗавершена Тогда
		Состояние("_Демо. Проверка КМ", 100, "Завершено");
		Возврат;
	КонецЕсли;
	
	Состояние("_Демо. Проверка КМ", Результат.ВыполненоОпераций / Результат.ВсегоОпераций * 100, Результат.Состояние);
	ПодключитьОбработчикОжидания("Подключаемый_СтатусПроверкаКМ", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ПечатьXMLПакет(Команда)
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	
	ПараметрыОперации = Новый Структура("ДанныеЧекаXML", ККТ_XML);
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФискализациюЧекаНаФискальномУстройствеПакетом(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации, ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ККТ_ПланируемыйСтатусТовараПриИзменении(Элемент)
	
	ШтучныйТовар = ККТ_ПланируемыйСтатусТовара = ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварРеализован")
			Или ККТ_ПланируемыйСтатусТовара = ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварВозвращен");
			
	Элементы.ККТ_МераКоличества.Доступность = НЕ ШтучныйТовар;
	Элементы.ККТ_Количество.Доступность = НЕ ШтучныйТовар;
	Элементы.ККТ_ДробноеКоличествоЧислитель.Доступность = НЕ ШтучныйТовар;
	Элементы.ККТ_ДробноеКоличествоЗнаменатель.Доступность = НЕ  ШтучныйТовар;
	
	Если ШтучныйТовар Тогда
		ККТ_МераКоличества = ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Штука");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ЗапросКМИПодтвердить(Команда)
	
	ШтучныйТовар = ККТ_ПланируемыйСтатусТовара = ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварРеализован")
		Или ККТ_ПланируемыйСтатусТовара = ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварВозвращен");
		
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФискальноеУстройство.Доступность = Ложь;
	ККТ_УникальныйИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор); 
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыЗапросКМ();
	ПараметрыОперации.ИдентификаторЗапроса = ККТ_УникальныйИдентификаторЗапроса;
	ПараметрыОперации.ОжидатьПолучениеОтветаОИСМ = ОжидатьПолучениеОтветаОИСМ;      
	ПараметрыОперации.ОтправлятьНаСерверОИСМ = НЕ ЗапросКМФормируетсяЛокально;
	ПараметрыОперации.Количество = ККТ_Количество;  
	
	Если Не ШтучныйТовар Тогда
		ПараметрыОперации.ДробноеКоличество.Числитель   = ККТ_ДробноеКоличествоЧислитель;     
		ПараметрыОперации.ДробноеКоличество.Знаменатель = ККТ_ДробноеКоличествоЗнаменатель;     
		ПараметрыОперации.МераКоличестваПредметаРасчета = ККТ_МераКоличества;
	КонецЕсли;
	ПараметрыОперации.ПланируемыйСтатусТовара = ККТ_ПланируемыйСтатусТовара;
	ПараметрыОперации.КонтрольнаяМарка = ККТ_КодКонтрольнойМарки;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершениеКМ", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьЗапросКМБезОжиданияОтвета(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ФУ_ЗаписатьЕГАИСВЖурналПроверкиКМ(Команда)

	ФУ_ЗаписатьЕГАИСВЖурналОперацийКМНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормыRFID

&НаКлиенте
Процедура RFID_ОперацияЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(НСтр("ru='Операция выполнена успешно:'") + РезультатВыполнения.ИдентификаторУстройства);
	Иначе
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(РезультатВыполнения.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура RFID_ОткрытьСессию(Команда)
	
	Если Не ЗначениеЗаполнено(СчитывательRFID) Тогда
		ТекстСообщения = НСтр("ru='Не выбран считыватель RFID.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("RFID_ОперацияЗавершение", ЭтотОбъект);
	МодульОборудованиеСчитывательRFIDКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеСчитывательRFIDКлиент");
	МодульОборудованиеСчитывательRFIDКлиент.НачатьОткрытиеСессииСчитывателяRFID(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, СчитывательRFID);
	
КонецПроцедуры

&НаКлиенте
Процедура RFID_ЗакрытьСессию(Команда)
	
	Если Не ЗначениеЗаполнено(СчитывательRFID) Тогда
		ТекстСообщения = НСтр("ru='Не выбран считыватель RFID.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("RFID_ОперацияЗавершение", ЭтотОбъект);
	МодульОборудованиеСчитывательRFIDКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеСчитывательRFIDКлиент");
	МодульОборудованиеСчитывательRFIDКлиент.НачатьЗакрытиеСессииСчитывателяRFID(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, СчитывательRFID);

КонецПроцедуры

&НаКлиенте
Процедура RFID_ЗаписатьВМеткуEPC(Команда)
	
	Если Не ЗначениеЗаполнено(СчитывательRFID) Тогда
		ТекстСообщения = НСтр("ru='Не выбран считыватель RFID.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ТекущаяСрока = Элементы.МеткиRFID.ТекущиеДанные;
	Если ТекущаяСрока <> Неопределено Тогда
		МодульОборудованиеСчитывательRFIDКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеСчитывательRFIDКлиент");
		ПараметрыЗаписи = МодульОборудованиеСчитывательRFIDКлиент.ПараметрыЗаписиМеткиRFID();
		ПараметрыЗаписи.TID = ТекущаяСрока.TID;
		ПараметрыЗаписи.EPC = ТекущаяСрока.EPC;
		ПараметрыЗаписи.БанкПамяти = "EPC";
		ПараметрыЗаписи.Данные = МенеджерОборудованияКлиентСервер.СформироватьДанныеSGTIN96(ТекущаяСрока.GTIN, ТекущаяСрока.СерийныйНомер);
		ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("RFID_ОперацияЗавершение", ЭтотОбъект);
		МодульОборудованиеСчитывательRFIDКлиент.НачатьЗаписьДанныхВМеткуRFID(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, СчитывательRFID, ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура RFID_ЗаписатьВМеткуGTINSerial(Команда)
	
	Если Не ЗначениеЗаполнено(СчитывательRFID) Тогда
		ТекстСообщения = НСтр("ru='Не выбран считыватель RFID.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ТекущаяСрока = Элементы.МеткиRFID.ТекущиеДанные;
	Если ТекущаяСрока <> Неопределено Тогда
		МодульОборудованиеСчитывательRFIDКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеСчитывательRFIDКлиент");
		ПараметрыЗаписи = МодульОборудованиеСчитывательRFIDКлиент.ПараметрыЗаписиМеткиRFID();
		ПараметрыЗаписи.TID = СокрЛП(ТекущаяСрока.TID);
		ПараметрыЗаписи.EPC = СокрЛП(ТекущаяСрока.EPC);
		ПараметрыЗаписи.БанкПамяти = "EPC";
		ПараметрыЗаписи.Данные = МенеджерОборудованияКлиентСервер.СформироватьДанныеSGTIN96(СокрЛП(ТекущаяСрока.GTIN), СокрЛП(ТекущаяСрока.СерийныйНомер));
		ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("RFID_ОперацияЗавершение", ЭтотОбъект);
		МодульОборудованиеСчитывательRFIDКлиент.НачатьЗаписьДанныхВМеткуRFID(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, СчитывательRFID, ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура RFID_ЗаписатьВМеткуUserMemory(Команда)
	
	Если Не ЗначениеЗаполнено(СчитывательRFID) Тогда
		ТекстСообщения = НСтр("ru='Не выбран считыватель RFID.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ТекущаяСрока = Элементы.МеткиRFID.ТекущиеДанные;
	Если ТекущаяСрока <> Неопределено Тогда
		МодульОборудованиеСчитывательRFIDКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеСчитывательRFIDКлиент");
		ПараметрыЗаписи = МодульОборудованиеСчитывательRFIDКлиент.ПараметрыЗаписиМеткиRFID();
		ПараметрыЗаписи.TID = ТекущаяСрока.TID;
		ПараметрыЗаписи.EPC = ТекущаяСрока.EPC;
		ПараметрыЗаписи.БанкПамяти = "USER";
		ПараметрыЗаписи.Данные = МенеджерОборудованияКлиентСервер.ПреобразоватьСтрокуВHEX(ТекущаяСрока.UserMemory);
		ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("RFID_ОперацияЗавершение", ЭтотОбъект);
		МодульОборудованиеСчитывательRFIDКлиент.НачатьЗаписьДанныхВМеткуRFID(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, СчитывательRFID, ПараметрыЗаписи);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура RFID_ГенерироватьСерийныйНомер(Команда)
	
	ТекущаяСрока = Элементы.МеткиRFID.ТекущиеДанные;
	Если ТекущаяСрока <> Неопределено Тогда
		TID = ТекущаяСрока.TID;
		EPC = ТекущаяСрока.EPC;
		
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПолучитьСерийныйНомерПоTID(TID, EPC);
		Если РезультатВыполнения.Результат Тогда
			ТекущаяСрока.СерийныйНомер = Формат(РезультатВыполнения.СерийныйНомер, "ЧВН=; ЧГ=");
		Иначе
			ОбщегоНазначенияБПОКлиент.СообщитьПользователю(РезультатВыполнения.ОписаниеОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура RFID_ГенерироватьВнешнееСобытие(Команда)
	
	Если Не ЗначениеЗаполнено(СчитывательRFID) Тогда
		ТекстСообщения = НСтр("ru='Не выбрано устройсво.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;                   
	
	ПараметрыОперации = Новый Структура();
	ПараметрыОперации.Вставить("ДанныеСобытия", "");
	ПараметрыОперации.Вставить("Base64", Ложь);
	
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("RFID_ОперацияЗавершение", ЭтотОбъект);
	МодульОборудованиеСчитывательRFIDКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеСчитывательRFIDКлиент");
	МодульОборудованиеСчитывательRFIDКлиент.ГенерироватьВнешнееСобытие(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, СчитывательRFID, ПараметрыОперации);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормыТСД

&НаКлиенте
Процедура ТСД_ОперацияЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат И РезультатВыполнения.Свойство("ТаблицаТоваров") Тогда
		ТаблицаЗагрузкиИзТСД.Очистить();
		Для Каждого Позиция Из РезультатВыполнения.ТаблицаТоваров Цикл
			НоваяСтрока = ТаблицаЗагрузкиИзТСД.Добавить();
			НоваяСтрока.Штрихкод   = Позиция.Штрихкод;
			НоваяСтрока.ШтрихкодBase64   = Позиция.ШтрихкодBase64;
			НоваяСтрока.Количество = Позиция.Количество;
			НоваяСтрока.ШтрихкодУпаковки = Позиция.ШтрихкодУпаковки;
			НоваяСтрока.ШтрихкодУпаковкиBase64 = Позиция.ШтрихкодУпаковкиBase64;
			НоваяСтрока.МаркаАлкогольнойПродукции = ?(Позиция.Свойство("ШтрихкодМаркиАлкогольнойПродукции"), Позиция.ШтрихкодМаркиАлкогольнойПродукции, "");
			НоваяСтрока.СерийныйНомерАлкогольнойПродукции = ?(Позиция.Свойство("СерийныйНомерАлкогольнойПродукции"), Позиция.СерийныйНомерАлкогольнойПродукции, "");
		КонецЦикла;
	КонецЕсли;
	
	ТекстСообщения = ?(РезультатВыполнения.Результат, НСтр("ru='Операция выполнена успешна.'"), РезультатВыполнения.ОписаниеОшибки);
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
	Элементы.РаботаСТСД.Доступность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ТСД_ОчиститьТаблицу(Команда)
	
	ТаблицаЗагрузкиИзТСД.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТСД_ЗагрузитьБезПодключения(Команда)
	
	Элементы.РаботаСТСД.Доступность = Ложь;
	
	ТаблицаЗагрузкиИзТСД.Очистить();
	ОповещенияПриЗавершение = Новый ОписаниеОповещения("ТСД_ОперацияЗавершение", ЭтотОбъект);
	МодульОборудованиеТерминалыСбораДанныхКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеТерминалыСбораДанныхКлиент");
	МодульОборудованиеТерминалыСбораДанныхКлиент.НачатьЗагрузкуДанныеИзТСД(ОповещенияПриЗавершение, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ТСД_ВыгрузитьБезПодключенияВыполнить(Команда)
	
	Элементы.РаботаСТСД.Доступность = Ложь;
	
	МодульОборудованиеТерминалыСбораДанныхКлиентСервер = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеТерминалыСбораДанныхКлиентСервер");
	ПараметрыОперации = МодульОборудованиеТерминалыСбораДанныхКлиентСервер.ПараметрыВыгрузкиВТСД();
	
	Для Каждого текСтрока Из ТаблицаЗагрузкиИзТСД Цикл
		ТоварнаяПозиция = МодульОборудованиеТерминалыСбораДанныхКлиентСервер.ПараметрыСтрокиВыгрузкиВТСД();
		ТоварнаяПозиция.Штрихкод                   = текСтрока.Штрихкод;
		ТоварнаяПозиция.Номенклатура               = текСтрока.Номенклатура;
		ТоварнаяПозиция.ЕдиницаИзмерения           = текСтрока.ЕдиницаИзмерения;
		ТоварнаяПозиция.ХарактеристикаНоменклатуры = текСтрока.ХарактеристикаНоменклатуры;
		ТоварнаяПозиция.СерияНоменклатуры          = текСтрока.СерияНоменклатуры;
		ТоварнаяПозиция.Качество                   = текСтрока.Качество;
		ТоварнаяПозиция.Цена                       = текСтрока.Цена;
		ТоварнаяПозиция.Количество                 = текСтрока.Количество;
		ТоварнаяПозиция.ШтрихкодУпаковки           = текСтрока.ШтрихкодУпаковки;
		
		ПараметрыОперации.ТаблицаТоваров.Добавить(ТоварнаяПозиция);
	КонецЦикла;
	
	ОповещенияПриЗавершение = Новый ОписаниеОповещения("ТСД_ОперацияЗавершение", ЭтотОбъект);
	МодульОборудованиеТерминалыСбораДанныхКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеТерминалыСбораДанныхКлиент");
	МодульОборудованиеТерминалыСбораДанныхКлиент.НачатьВыгрузкуДанныеВТСД(ОповещенияПриЗавершение, УникальныйИдентификатор,, ПараметрыОперации);

КонецПроцедуры

&НаКлиенте
Процедура ТСД_ОчиститьТовары(Команда)
	
	Элементы.РаботаСТСД.Доступность = Ложь;
	
	ОповещенияПриЗавершении = Новый ОписаниеОповещения("ТСД_ОперацияЗавершение", ЭтотОбъект);
	МодульОборудованиеТерминалыСбораДанныхКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеТерминалыСбораДанныхКлиент");
	МодульОборудованиеТерминалыСбораДанныхКлиент.НачатьОчисткуДанныеВТСД(ОповещенияПриЗавершении, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ТСД_ЗаполнитьБазуДемоДанными(Команда)
	
	ТСД_ЗаполнитьДемоДанные(50);
	
КонецПроцедуры

&НаКлиенте
Процедура ТСД_ЗаполнитьБазуДемоДанными1000(Команда)
	
	ТСД_ЗаполнитьДемоДанные(1000);
	
КонецПроцедуры

&НаКлиенте
Процедура ТСД_ЗаполнитьДемоДанные(Количество)
	
	// Формирование тестовых данных.
	Для Итератор = 1 По Количество Цикл
		Строка = ТаблицаЗагрузкиИзТСД.Добавить();
		Строка.Штрихкод = ТекущийПЛУ;
		Строка.ШтрихкодУпаковки = "100000000";
		Строка.Номенклатура = "Наименование товара " + Строка(ТекущийПЛУ);	
		Строка.ЕдиницаИзмерения = "Штука";
		Строка.ХарактеристикаНоменклатуры = "Цвет" + Строка(ТекущийПЛУ);
		Строка.СерияНоменклатуры  = "Серия" + Строка(ТекущийПЛУ); 
		Строка.Качество  = "Качество"; 
		Строка.Цена = ТекущийПЛУ + 11.20;
		Строка.Количество = ТекущийПЛУ;
		ТекущийПЛУ = ТекущийПЛУ + 1;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормыДисплеиПокупателя

&НаКлиенте
Процедура ДП_ВыполнитьЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ТекстСообщения = ?(РезультатВыполнения.Результат, НСтр("ru='Операция завершена.'"), РезультатВыполнения.ОписаниеОшибки);
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДП_ВывестиТекстВыполнить()
	
	Если Не ЗначениеЗаполнено(Дисплей) Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ОборудованиеДисплеиПокупателяКлиент.ПараметрыОперацииДисплейПокупателя(ДПТекст);
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("ДП_ВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеДисплеиПокупателяКлиент.НачатьВыводИнформацииНаДисплейПокупателя(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, Дисплей, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ДП_ОчиститьТекстВыполнить()
	
	Если Не ЗначениеЗаполнено(Дисплей) Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("ДП_ВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеДисплеиПокупателяКлиент.НачатьОчисткуДисплеяПокупателя(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, Дисплей); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДП_ВыводQRКод(Команда)
	
	Если Не ЗначениеЗаполнено(Дисплей) Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ОборудованиеДисплеиПокупателяКлиент.ПараметрыОперацииДисплейПокупателя();   
	ПараметрыОперации.СтрокиТекста   = ДПТекст;
	ПараметрыОперации.ЗначениеQRКода = ДПQRКод;
	ПараметрыОперации.КартинкаQRКода = КартинкаBase64;

	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("ДП_ВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеДисплеиПокупателяКлиент.НачатьВыводQRКодаНаДисплейПокупателя(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, Дисплей, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ДП_СтатусНаДисплей(Команда)   
	
	Если Не ЗначениеЗаполнено(Дисплей) Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ОборудованиеДисплеиПокупателяКлиент.ПараметрыОперацииДисплейПокупателя();   
	ПараметрыОперации.СтатусОперации = СтатусОперации;  
	
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("ДП_ВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеДисплеиПокупателяКлиент.НачатьВыводСтатусаОперацииНаДисплейПокупателя(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, Дисплей, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ДП_ИнформацияНаДисплейПокупателя(Команда)
	
	ОтображениеИнформацииНаДисплейПокупателя();
	
КонецПроцедуры

&НаКлиенте
Процедура ДП_ЗаполнитьТовары2(Команда)

	ОбновлениеДисплея = Ложь; 

	Строка = ТаблицаТоваров.Добавить();
	Строка.Наименование = "Хлеб «Каждый день» Дарницкий, 650 г";
	Строка.Цена =  39.2;    
	Строка.Количество = 1;
	Строка.Сумма = Строка.Цена * Строка.Количество;

	Строка = ТаблицаТоваров.Добавить();
	Строка.Наименование = "Булочка «Каждый день» сдобная с повидлом 80 г";
	Строка.Цена =  30.9;    
	Строка.Количество = 1;
	Строка.Сумма = Строка.Цена * Строка.Количество;
	
	Строка = ТаблицаТоваров.Добавить();
	Строка.Наименование = "Сахар белый кристаллический 1 кг";
	Строка.Цена =  59.5;    
	Строка.Количество = 2;
	Строка.Сумма = Строка.Цена * Строка.Количество;
	
	Строка = ТаблицаТоваров.Добавить();
	Строка.Наименование = "Мука Makfa пшеничная высший сорт 2 кг";
	Строка.Цена =  101;    
	Строка.Количество = 1;
	Строка.Сумма = Строка.Цена * Строка.Количество;

	Строка = ТаблицаТоваров.Добавить();
	Строка.Наименование = "Томатная паста Кубань Продукт Final 25%";
	Строка.Цена =  258;    
	Строка.Количество = 1;
	Строка.Сумма = Строка.Цена * Строка.Количество;
	
 	Строка = ТаблицаТоваров.Добавить();
	Строка.Наименование = "Газированный напиток Добрый Кола сильногазированный 1,5 л";
	Строка.Цена =  90;    
	Строка.Количество = 1;
	Строка.Сумма = Строка.Цена * Строка.Количество;
	
	Строка = ТаблицаТоваров.Добавить();
	Строка.Наименование = "Наггетсы куриные Мираторг классические 300 г";
	Строка.Цена =  140;    
	Строка.Количество = 2;
	Строка.Сумма = Строка.Цена * Строка.Количество;
	
	Строка = ТаблицаТоваров.Добавить();
	Строка.Наименование = "Хотстеры Горячая штучка 250 г";
	Строка.Цена =  100;    
	Строка.Количество = 2;
	Строка.Сумма = Строка.Цена * Строка.Количество;
	
	Строка = ТаблицаТоваров.Добавить();
	Строка.Наименование = "Пельмени Цезарь Классика 800 г";
	Строка.Цена =  290;    
	Строка.Количество = 1;
	Строка.Сумма = Строка.Цена * Строка.Количество;
	
	Строка = ТаблицаТоваров.Добавить();
	Строка.Наименование = "Майонез Слобода Оливковый, 800 мл";
	Строка.Цена =  120;    
	Строка.Количество = 1;
	Строка.Сумма = Строка.Цена * Строка.Количество;
	
	ОбновлениеДисплея = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ДП_ЗаполнитьТовары3(Команда)

	Строка = ТаблицаТоваров.Добавить();
	Строка.Наименование = "Хлеб «Каждый день» Дарницкий, 650 г";
	Строка.Цена =  39.2;    
	Строка.Количество = 1;
	Строка.Сумма = Строка.Цена * Строка.Количество;

	ОтображениеИнформацииНаДисплейПокупателя();     
	
КонецПроцедуры

&НаКлиенте
Процедура ДП_ЗаполнитьТовары(Команда)    
	
	ОбновлениеДисплея = Ложь;
	
	Количество = 1;
	ГСЧ = Новый ГенераторСлучайныхЧисел(1);
	
	Для Итератор = 1 По 10 Цикл
		Строка = ТаблицаТоваров.Добавить();
		Строка.Наименование = "Наименование товара " + Строка(ТекущийПЛУ);	
		Строка.Цена =  ГСЧ.СлучайноеЧисло(0, 1000);    
		Строка.Количество = Количество;
		Строка.Сумма = Строка.Цена * Строка.Количество;
		Количество = Количество + 1;
	КонецЦикла;           
	
	ОбновлениеДисплея = Истина;
	
КонецПроцедуры   

&НаКлиенте
Процедура ТаблицаТоваровПриИзменении(Элемент)
	
	Если ОбновлениеДисплея Тогда
		ОтображениеИнформацииНаДисплейПокупателя();     
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеИнформацииНаДисплейПокупателя()     
	
	ФорматЧисла = "ЧРД=.;ЧЦ=12;ЧДЦ=2;ЧН=0.00;ЧГ=0";
	
	Если Не ЗначениеЗаполнено(Дисплей) Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	// СервисныйРежим
	// СписокТоваров
	// ФискальныйЧек
	// ОплатаСБП
	
	ПараметрыОперации = ОборудованиеДисплеиПокупателяКлиент.ПараметрыОперацииДисплейПокупателя();    
	ПараметрыОперации.НазваниеОрганизации = "ООО ""МОЙ МАГАЗИН""";      
	ПараметрыОперации.СтрокиТекста = ДПТекст;

	ПараметрыОперации.КартинкаBase64 = КартинкаBase64;
	
	ПараметрыОперации.Операция = ДП_Операция;    
	ПараметрыОперации.ГотовностьКРаботе = ГотовностьКРаботе;  
	ПараметрыОперации.НаличнаяОплата = НаличнаяОплата; 
	
	Для Индекс = 1 По ДП_КоличествоКнопок Цикл
		Кнопка = ОборудованиеДисплеиПокупателяКлиент.КнопкаДисплеяПокупателя("Вариант" + Индекс, Строка(Индекс));
		ПараметрыОперации.Кнопки.Добавить(Кнопка);
	КонецЦикла;

	ПараметрыОперации.СтатусОперации = СтатусОперации;   
	ПараметрыОперации.ТипПлатежнойСистемы = ТипПлатежнойСистемы;   
	Если СтатусОперации = 3 И ТипПлатежнойСистемы = ПредопределенноеЗначение("Перечисление.ТипыПлатежнойСистемыККТ.СертификатНСПК") Тогда
		ПараметрыОперации.ДополнительныйТекст = "Предьявити карту ""МИР"" для операции";
	КонецЕсли;
	
	ПараметрыОперации.Сумма = 1000.4;   
	ПараметрыОперации.Сдача = 200.12;
	
	Если ДП_Операция = "ФискальныйЧек" Тогда
		ПараметрыОперации.ЗначениеQRКода = "t=20170310T100500&s=1213.46&fn=8710000100256778&i=5219&fp=68885226&n=1";
	Иначе
		ПараметрыОперации.ЗначениеQRКода = "https://qr.nspk.ru/AD10003UOKK4J3J09SO9M1CSQ2U23BQC?type=02&bank=540000000001&sum=10010&cur=RUB&crc=86EE";
	КонецЕсли;            
	
	Колонка = ОборудованиеДисплеиПокупателяКлиент.ПараметрыКолонкиТабличнойЧастиДисплеяПокупателя("Номер", "№", 10, ГоризонтальноеПоложение.Центр);
	ПараметрыОперации.КолонкиТабличнойЧасти.Добавить(Колонка);
	
	Колонка = ОборудованиеДисплеиПокупателяКлиент.ПараметрыКолонкиТабличнойЧастиДисплеяПокупателя("Наименование", , 55, ГоризонтальноеПоложение.Лево);
	ПараметрыОперации.КолонкиТабличнойЧасти.Добавить(Колонка);                                                     
	
	Колонка = ОборудованиеДисплеиПокупателяКлиент.ПараметрыКолонкиТабличнойЧастиДисплеяПокупателя("Цена", ,15, ГоризонтальноеПоложение.Право);
	ПараметрыОперации.КолонкиТабличнойЧасти.Добавить(Колонка);
	
	Колонка = ОборудованиеДисплеиПокупателяКлиент.ПараметрыКолонкиТабличнойЧастиДисплеяПокупателя("Количество", "Кол-во", 10, ГоризонтальноеПоложение.Право);
	ПараметрыОперации.КолонкиТабличнойЧасти.Добавить(Колонка);
	
	Колонка = ОборудованиеДисплеиПокупателяКлиент.ПараметрыКолонкиТабличнойЧастиДисплеяПокупателя("Сумма", ,15, ГоризонтальноеПоложение.Право);
	ПараметрыОперации.КолонкиТабличнойЧасти.Добавить(Колонка);
	
	Номер = 1;  
	ПодвалСумма = 0;
	Для Каждого Товар Из ТаблицаТоваров Цикл
		ТоварнаяПозиция = Новый Соответствие();
		ТоварнаяПозиция.Вставить("Номер", Номер);
		ТоварнаяПозиция.Вставить("Наименование", Товар.Наименование);
		ТоварнаяПозиция.Вставить("Цена", Формат(Товар.Цена, ФорматЧисла));
		ТоварнаяПозиция.Вставить("Количество", Формат(Товар.Количество, ФорматЧисла));
		ТоварнаяПозиция.Вставить("Сумма", Формат(Товар.Сумма, ФорматЧисла));
		ПараметрыОперации.ТабличнаяЧасть.Добавить(ТоварнаяПозиция);          
		Номер = Номер + 1;                                                      
		ПодвалСумма = ПодвалСумма + Товар.Сумма;
	КонецЦикла;
	ПараметрыОперации.ПодвалСумма = ПодвалСумма;
	
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("ДП_ВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеДисплеиПокупателяКлиент.НачатьОтображениеИнформацииНаДисплейПокупателя(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, Неопределено, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ДП_СтатусРабочегоМеста(Команда)
	
	Если Не ЗначениеЗаполнено(Дисплей) Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ОборудованиеДисплеиПокупателяКлиент.ПараметрыОперацииДисплейПокупателя();   
	ПараметрыОперации.СтатусРабочегоМеста = СтатусРабочегоМеста;  
	
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("ДП_ВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеДисплеиПокупателяКлиент.НачатьВыводСтатусаРабочегоМестаНаДисплейПокупателя(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, Дисплей, ПараметрыОперации);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормыЭлектронныеВесы

&НаКлиенте
Процедура ЭВ_ПолучитьВесВыполнитьЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Элементы.РаботаВесовоеОборудование.Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru='Операция завершена.'");
		Если РезультатВыполнения.Свойство("Вес") Тогда
			Если РезультатВыполнения.Вес = 0 Тогда
				ТекстСообщения = НСтр("ru = 'Электронные весы вернули нулевой вес.'");
				Вес = 0;
			Иначе
				Вес = РезультатВыполнения.Вес;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭВ_ТарироватьВыполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Весы) Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Элементы.РаботаВесовоеОборудование.Доступность = Ложь;
	
	ПараметрыОперации = ОборудованиеВесовоеОборудованиеКлиентСервер.ПараметрыОперацииЭлектронныеВесы(Вес);
	
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("ЭВ_ПолучитьВесВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеВесовоеОборудованиеКлиент.НачатьУстановкуВесаТарыЭлектронныхВесов(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, Весы, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭВ_ПолучитьВесВыполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Весы) Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Элементы.РаботаВесовоеОборудование.Доступность = Ложь;
	
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("ЭВ_ПолучитьВесВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеВесовоеОборудованиеКлиент.НачатьПолученияВесаСЭлектронныхВесов(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, Весы, Неопределено);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормыВесыСПечатьюЭтикеток

&НаКлиенте
Процедура ОперацияБезПодключенияЗавершение(Результат, Параметры) Экспорт
	
	Элементы.РаботаВесовоеОборудование.Доступность = Истина;
	
	ОчиститьСообщения();
	
	Если Результат.Результат Тогда
		Лог = "Операция завершилась успешно." + Символы.ПС;
	Иначе
		Лог = Результат.ОписаниеОшибки + Символы.ПС;
	КонецЕсли;
	
	ОтветОтУстройства = Лог + ОтветОтУстройства;
	
КонецПроцедуры

&НаКлиенте
Процедура ВесыOffline_Выгрузить(Команда)
	
	Если Не ЗначениеЗаполнено(ВесыСПечатьюЭтикеток) Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Элементы.РаботаВесовоеОборудование.Доступность = Ложь;
	
	ПараметрыОперации = ОборудованиеВесовоеОборудованиеКлиентСервер.ПараметрыОперацииВесыСПечатьюЭтикеток();
	Для Каждого СтрокаТЧ Из ТаблицаТоваровВесовСПечатьюЭтикеток Цикл
		ТоварнаяПозиция = ОборудованиеВесовоеОборудованиеКлиентСервер.ПараметрыСтрокиВыгрузкиВВесыСПечатьюЭтикеток();
		ТоварнаяПозиция.PLU = СтрокаТЧ.PLU;
		ТоварнаяПозиция.Код = СтрокаТЧ.Код;
		ТоварнаяПозиция.Штрихкод = СтрокаТЧ.Штрихкод;
		ТоварнаяПозиция.Наименование = СтрокаТЧ.Наименование;
		ТоварнаяПозиция.НаименованиеПолное = СтрокаТЧ.НаименованиеПолное;
		ТоварнаяПозиция.ОписаниеТовара     = СтрокаТЧ.ОписаниеТовара;
		ТоварнаяПозиция.ВесовойТовар = Истина;
		ТоварнаяПозиция.СрокХранения = СтрокаТЧ.СрокХранения;
		ТоварнаяПозиция.Цена = СтрокаТЧ.Цена;              
		ТоварнаяПозиция.ФорматЭтикетки = СтрокаТЧ.ФорматЭтикетки;              
		ТоварнаяПозиция.КнопкаТовара = СтрокаТЧ.КнопкаТовара;        
		ТоварнаяПозиция.ДополнительныеЦены.Цена1 = СтрокаТЧ.Цена;
		ПараметрыОперации.ТаблицаТоваров.Добавить(ТоварнаяПозиция)
	КонецЦикла;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОперацияБезПодключенияЗавершение", ЭтотОбъект);
	ОборудованиеВесовоеОборудованиеКлиент.НачатьВыгрузкуДанныеВВесыСПечатьюЭтикеток(ОповещениеПриЗавершении, УникальныйИдентификатор, ВесыСПечатьюЭтикеток, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ВесыOffline_ВыгрузитьXML(Команда)
	
	Если Не ЗначениеЗаполнено(ВесыСПечатьюЭтикеток) Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Элементы.РаботаВесовоеОборудование.Доступность  = Ложь;    
	
	ПараметрыОперации = Новый Структура("ПакетXML", Весы_XML);
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОперацияБезПодключенияЗавершение", ЭтотОбъект);
	ОборудованиеВесовоеОборудованиеКлиент.НачатьВыгрузкуДанныеВВесыСПечатьюЭтикетокПакетом(ОповещениеПриЗавершении, УникальныйИдентификатор, ВесыСПечатьюЭтикеток, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ВесыOffline_ВыгрузитьИзображения(Команда)
	
	Если Не ЗначениеЗаполнено(ВесыСПечатьюЭтикеток) Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Элементы.РаботаВесовоеОборудование.Доступность = Ложь;
	
	ПараметрыОперации = ОборудованиеВесовоеОборудованиеКлиентСервер.ПараметрыОперацииВыгрузкиИзображенийВесыСПечатьюЭтикеток();       
	
	Для Каждого СтрокаТЧ Из ТаблицаТоваровВесовСПечатьюЭтикеток Цикл
		ИзображениеПозиция = ОборудованиеВесовоеОборудованиеКлиентСервер.ПараметрыСтрокиВыгрузкиИзображенийВВесыСПечатьюЭтикеток();
		ИзображениеПозиция.PLU = СтрокаТЧ.PLU;
		ИзображениеПозиция.Код = СтрокаТЧ.Код;        
		ИзображениеПозиция.Изображение = СтрокаТЧ.КартинкаBase64;
		ПараметрыОперации.ТаблицаИзображений.Добавить(ИзображениеПозиция)
	КонецЦикла;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОперацияБезПодключенияЗавершение", ЭтотОбъект);
	ОборудованиеВесовоеОборудованиеКлиент.НачатьВыгрузкуИзображенийТоваровВВесыСПечатьюЭтикеток(ОповещениеПриЗавершении, УникальныйИдентификатор, ВесыСПечатьюЭтикеток, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ВесыOffline_ОчиститьБазу(Команда)
	
	Если Не ЗначениеЗаполнено(ВесыСПечатьюЭтикеток) Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Элементы.РаботаВесовоеОборудование.Доступность = Ложь;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОперацияБезПодключенияЗавершение", ЭтотОбъект);
	ОборудованиеВесовоеОборудованиеКлиент.НачатьОчисткуТоваровВВесахСПечатьюЭтикеток(ОповещениеПриЗавершении, УникальныйИдентификатор, ВесыСПечатьюЭтикеток);
	
КонецПроцедуры

&НаКлиенте
Процедура ВесыOffline_ЗаполнитьБазуДемоДанными(Команда)
	
	ВесыOffline_ЗаполнитьДемоДанные(50);
	
КонецПроцедуры

&НаКлиенте
Процедура ВесыOffline_ЗаполнитьБазуДемоДанными1000(Команда)
	
	ВесыOffline_ЗаполнитьДемоДанные(1000);
	
КонецПроцедуры

&НаКлиенте
Процедура ВесыOffline_ЗаполнитьДемоДанные(Количество)
	
	// Формирование тестовых данных.
	Для Итератор = 1 По Количество Цикл
		Строка = ТаблицаТоваровВесовСПечатьюЭтикеток.Добавить();
		Строка.PLU = ТекущийПЛУ;
		Строка.Наименование = "Наименование товара " + Строка(ТекущийПЛУ);
		Строка.Цена = ТекущийПЛУ + 11.01;
		Строка.Код = ТекущийПЛУ;
		Строка.СрокХранения = 4;
		Строка.ОписаниеТовара = "Описание товара " + Строка(ТекущийПЛУ);
		Строка.ФорматЭтикетки = 1;
		Строка.КнопкаТовара = ТекущийПЛУ;                                                  
		ТекущийПЛУ = ТекущийПЛУ + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВесыOffline_ОчиститьДемоДанные(Команда)
	
	ТаблицаТоваровВесовСПечатьюЭтикеток.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормыЭТ

&НаКлиенте
Процедура ЭТ_ВыполнитьОперациюЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Элементы.РаботаСЭТ.Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'Операция выполнена успешно.'");
		ЭТНомерСсылкиОперации = ?(РезультатВыполнения.Свойство("СсылочныйНомер"), РезультатВыполнения.СсылочныйНомер, "");
		ЭТНомерКарты = ?(РезультатВыполнения.Свойство("НомерКарты"), РезультатВыполнения.НомерКарты, "");
		ЭТНомерЧекаЭТ = ?(РезультатВыполнения.Свойство("НомерЧекаЭТ"), РезультатВыполнения.НомерЧекаЭТ, "");
		ЭТКодАвторизации = ?(РезультатВыполнения.Свойство("КодАвторизации"), РезультатВыполнения.КодАвторизации, "");     
		ЭТСсылкаНаПлатежныйСчет = ?(РезультатВыполнения.Свойство("СсылкаНаПлатежныйСчет"), РезультатВыполнения.СсылкаНаПлатежныйСчет, "");    
		
		Если РезультатВыполнения.Свойство("ХешНомерКарты") Тогда
			ЭТХешНомерКарты = РезультатВыполнения.ХешНомерКарты;
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("КодЗавершения") Тогда
			ЭТКодЗавершения = РезультатВыполнения.КодЗавершения;
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("ВидОплатыНаТерминале") Тогда
			ЭТВидОплатыНаТерминале = РезультатВыполнения.ВидОплатыНаТерминале;
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("ХешНомерКарты") Тогда
			ЭТХешНомерКарты = РезультатВыполнения.ХешНомерКарты;
		КонецЕсли;
		Если РезультатВыполнения.Свойство("НомерКарты") Тогда
			ЭТНомерКарты = РезультатВыполнения.НомерКарты;
		КонецЕсли;      

		Если РезультатВыполнения.Свойство("Операции") Тогда  
			Для Каждого Операция Из РезультатВыполнения.Операции Цикл
				Запись = ОперацииЭкваринга.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Операция);
			КонецЦикла;
		КонецЕсли;      
		
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭТ_ВыполнитьСверкуИтогов(Команда)
	
	Если Не ЗначениеЗаполнено(ЭТ) Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	
	ОчиститьСообщения();
	Элементы.РаботаСЭТ.Доступность = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЭТ_ВыполнитьОперациюЗавершение", ЭтотОбъект);
	ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале(ОписаниеОповещения, УникальныйИдентификатор, ЭТ, , , ФискальноеУстройство);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭТ_ВыполнитьОперацию(Команда)

	Если ЭТ.Пустая() Тогда
		ТекстСообщения = "ЭТ не выбран.";
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ФискальноеУстройство = ПолучитьФискальноеУстройство();
	
	ОчиститьСообщения();
	Элементы.РаботаСЭТ.Доступность = Ложь;
	
	ПараметрыОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();  
	Если Не ПустаяСтрока(ЭТРеквизитыКартыQR) Тогда
		ПараметрыОперации.РеквизитыКартыQR = ЭТРеквизитыКартыQR; 
	КонецЕсли;
	ПараметрыОперации.ТипТранзакции  = ТипЭквайринговойОперации;
	ПараметрыОперации.НомерМерчанта  = ЭТНомерМерчанта;
	ПараметрыОперации.СуммаОперации  = ЭТСумма;
	ПараметрыОперации.СуммаНаличных  = ЭТСуммаНаличных;         
	ПараметрыОперации.СуммаОригинальнойОперации = ЭТСуммаОригинальнойОперации;
	ПараметрыОперации.НомерЧека      = ЭТНомерЧека;
	ПараметрыОперации.НомерЧекаЭТ    = ЭТНомерЧекаЭТ;
	ПараметрыОперации.СсылочныйНомер = ЭТНомерСсылкиОперации;      
	ПараметрыОперации.КодАвторизации = ЭТКодАвторизации;
	ПараметрыОперации.ИдентификаторКорзины = ЭТИдентификаторКорзины;       
	ПараметрыОперации.ИдентификаторКорзиныОперацииОплаты = ЭТИдентификаторКорзиныОперацииОплаты;
	ПараметрыОперации.ХешНомерКарты = ЭТХешНомерКарты;
	
	ПараметрыОперации.СуммаЭлектронногоСертификата = ЭТСуммаЭлектронногоСертификата;
	ПараметрыОперации.СуммаСобственныхСредств = ЭТСуммаСобственныхСредств;            
	ПараметрыОперации.ИспользоватьБиометрию = ЭТИспользоватьБиометрию;

	ОписаниеОповещения = Новый ОписаниеОповещения("ЭТ_ВыполнитьОперациюЗавершение", ЭтотОбъект);
	ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеОперацииНаЭквайринговомТерминале(ОписаниеОповещения, УникальныйИдентификатор, ЭТ, ПараметрыОперации, Неопределено, ФискальноеУстройство); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЭТ_ПолучениеПараметровКарты(Команда)
	
	Если ЭТ.Пустая() Тогда
		ТекстСообщения = "ЭТ не выбран.";
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;              
	
	ПараметрыОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыПолучениеПараметровКарты();  
	Если Не ПустаяСтрока(ЭТРеквизитыКартыQR) И ОборудованиеПлатежныеСистемыКлиентСервер.ЭтоРеквизитыКартыQR(ЭТРеквизитыКартыQR) Тогда
		ПараметрыОперации.РеквизитыКартыQR = ЭТРеквизитыКартыQR; 
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЭТ_ВыполнитьОперациюЗавершение", ЭтотОбъект);
	ОборудованиеПлатежныеСистемыКлиент.НачатьПолучениеПараметровКарты(ОписаниеОповещения, УникальныйИдентификатор, ЭТ, ПараметрыОперации); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЭТ_НачатьПолучениеОперацииПоКартам(Команда)
	
	Если ЭТ.Пустая() Тогда
		ТекстСообщения = "ЭТ не выбран.";
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;              
	
	ОперацииЭкваринга.Очистить();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЭТ_ВыполнитьОперациюЗавершение", ЭтотОбъект);
	ОборудованиеПлатежныеСистемыКлиент.НачатьПолучениеОперацииПоКартам(ОписаниеОповещения, УникальныйИдентификатор, ЭТ);   
	
КонецПроцедуры

&НаКлиенте
Процедура ЭТ_АварийнаяОтменаОперации(Команда)
	
	Если ЭТ.Пустая() Тогда
		ТекстСообщения = "ЭТ не выбран.";
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЭТ_ВыполнитьОперациюЗавершение", ЭтотОбъект);
	ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеАварийнойОтменыОперации(ОписаниеОповещения, УникальныйИдентификатор, ЭТ); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЭТ_НапечататьПоследнийСлипЧек(Команда)
	
	СлипЧек = ОборудованиеПлатежныеСистемыКлиент.ПоследнийСлипЧек();
	Если Не ПустаяСтрока(СлипЧек) Тогда
		ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПечатиТекста(СлипЧек);
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект, Параметры);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПечатьТекста(ОповещениеПриЗавершении, УникальныйИдентификатор, Неопределено, ПараметрыОперации); 
	Иначе
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(НСтр("ru='Отсутствует последний чек.
		    |Возможно после запуска приложения операции по картам еще не проводились.'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормыПринтерЭтикеток

&НаСервере
Функция ПолучитьРезультатВыполненияЗапроса(СКД)
	
	МассивНоменклатуры = Новый Массив;
	МассивНоменклатуры.Добавить(НоменклатураДляПечатиЭтикетки);
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
    Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
	Компоновщик.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	
	Настройки = Компоновщик.Настройки;
	Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МассивНоменклатуры"));
	Параметр.Значение = МассивНоменклатуры;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ПКД = Новый ПроцессорКомпоновкиДанных;
    ПКД.Инициализировать(КомпоновщикМакета.Выполнить(СКД, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")));
	
	ТЗ = Новый ТаблицаЗначений;
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ПроцессорВывода.УстановитьОбъект(ТЗ);
    ПроцессорВывода.Вывести(ПКД);

    Возврат ТЗ;
	
КонецФункции

&НаСервере
Функция СформироватьДанныеДляПечати()
	
	СхемаКомпоновкиДанных = Справочники._ДемоЭтикеткиИЦенники.ПолучитьМакет("ПоляШаблонаЭтикетки");
	АдресХранилищаСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	СКД = ПолучитьИзВременногоХранилища(АдресХранилищаСКД);
	РезультатВыполненияЗапроса = ПолучитьРезультатВыполненияЗапроса(СКД);
	
	Поля = Новый Массив;
	
	Если РезультатВыполненияЗапроса.Количество()>0 Тогда
		Источник = РезультатВыполненияЗапроса[0];
		Для Каждого ТекПоле Из Этикетка.Поля Цикл
			Если ТекПоле.ТипЗаполнения = "Parameter" Тогда
				НовоеПоле = Новый Структура;
				НовоеПоле.Вставить("ИмяПоля", ТекПоле.Наименование);
				
				Попытка
					Значение = Вычислить("Источник." + ТекПоле.Значение);
				Исключение
					Значение = "";
				КонецПопытки;
				
				Если ТипЗнч(Значение) = Тип("ХранилищеЗначения") Тогда
					Значение = Значение.Получить();
					Если ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
						Значение = Base64Строка(Значение);
					Иначе
						Значение = Строка(Значение);
					КонецЕсли;
				КонецЕсли;
				Если ЗначениеЗаполнено(Значение) Тогда
					НовоеПоле.Вставить("Значение", Значение);
				Иначе
					Если ЗначениеЗаполнено(ТекПоле.ЗначениеПоУмолчанию) Тогда
						НовоеПоле.Вставить("Значение", ТекПоле.ЗначениеПоУмолчанию);
					Иначе
						НовоеПоле.Вставить("Значение", "");
					КонецЕсли;
				КонецЕсли;
				Поля.Добавить(НовоеПоле);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	МассивЭтикеток = Новый Массив;
	НоваяЭтикетка = Новый Структура;
	НоваяЭтикетка.Вставить("Количество", 1);
	НоваяЭтикетка.Вставить("Поля", Поля);
	МассивЭтикеток.Добавить(НоваяЭтикетка);
	
	Возврат Новый Структура("МассивЭтикеток, XMLОписаниеМакета", МассивЭтикеток, Этикетка.XMLОписаниеМакета);
	
КонецФункции

&НаКлиенте
Процедура ПЭ_ПечатьЗавершение(РезультатПечати, ДополнительныеПараметры) Экспорт
	
	Если РезультатПечати.Результат Тогда
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(НСтр("ru='Печать завершена.'"));
	Иначе
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(РезультатПечати.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПЭ_Печать(Команда)
	
	ДанныеЗаполнены = Истина;
	
	Если Не ЗначениеЗаполнено(Этикетка) Тогда
		ТекстСообщения = НСтр("ru='Не выбрана этикетка для печати.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		ДанныеЗаполнены = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НоменклатураДляПечатиЭтикетки) Тогда
		ТекстСообщения = НСтр("ru='Не выбрана номенклатура для печати этикетки.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		ДанныеЗаполнены = Ложь;
	КонецЕсли;
	
	Если ДанныеЗаполнены Тогда
	
		ДанныеДляПечати = СформироватьДанныеДляПечати();
		
		МодульОборудованиеПринтерыЭтикетокКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеПринтерыЭтикетокКлиент");
		ПараметрыОперации = МодульОборудованиеПринтерыЭтикетокКлиент.ПараметрыОперацииПечатиЭтикеток();
		ПараметрыОперации.ОписаниеЭтикеткиВXML = ДанныеДляПечати.XMLОписаниеМакета; 
		ПараметрыОперации.ДанныеДляПечати = ДанныеДляПечати.МассивЭтикеток;
		
		ОписаниеОповещениеПриЗавершенииПечати = Новый ОписаниеОповещения("ПЭ_ПечатьЗавершение", ЭтотОбъект);
		МодульОборудованиеПринтерыЭтикетокКлиент.НачатьПечатьЭтикеток(ОписаниеОповещениеПриЗавершенииПечати, УникальныйИдентификатор, ПринтерЭтикеток, ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПЭ_Инициализация(Команда)
	
	Если ПринтерЭтикеток.Пустая() Тогда
		ТекстСообщения = НСтр("ru='Принтер печати этикеток не выбран.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещениеПриЗавершенииПечати = Новый ОписаниеОповещения("ПЭ_ПечатьЗавершение", ЭтотОбъект);
	МодульОборудованиеПринтерыЭтикетокКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеПринтерыЭтикетокКлиент");
	МодульОборудованиеПринтерыЭтикетокКлиент.НачатьИнициализацияПринтераЭтикеток(ОписаниеОповещениеПриЗавершенииПечати, УникальныйИдентификатор, ПринтерЭтикеток);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ФискальноеУстройствоТипПриИзменении(Элемент)
	
	Элементы.ККТ_ОперацияФН.Видимость = ФискальноеУстройствоТип = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККТ");
	Элементы.ФФД12.Видимость = Элементы.ККТ_ОперацияФН.Видимость;
	ВидимостьЭлементовККТПринтерЧеков = Истина;
	Если ФискальноеУстройствоТип = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ОблачнаяККТ") Тогда
		ВидимостьЭлементовККТПринтерЧеков = Ложь;
	КонецЕсли;
	Элементы.ФФД12.Видимость = ВидимостьЭлементовККТПринтерЧеков;
	Элементы.ПакетныеОперации.Видимость = ВидимостьЭлементовККТПринтерЧеков;
	Элементы.ПечатьПакетно.Видимость = ВидимостьЭлементовККТПринтерЧеков;
	
КонецПроцедуры

&НаКлиенте
Процедура УВ_РазобратьШтрихкод(Команда)
	
	ВремДанныеСканера = СтрЗаменить(ДанныеСканера, "\u001d", ОбщегоНазначенияБПОКлиентСервер.РазделительGS1());
	ПолученШтрихкод(ВремДанныеСканера);
	
КонецПроцедуры

&НаКлиенте
Процедура УВ_ВыборКодаВидаНоменклатурнойКлассификации(Команда)
	
	ОповещениеПриВыборе = Новый ОписаниеОповещения("УВ_ВыборКодаВидаНоменклатурнойКлассификации_Завершение", ЭтотОбъект);                                 
	МенеджерОборудованияКлиент.НачатьВыборКодаВидаНоменклатурнойКлассификации(ОповещениеПриВыборе);
	
КонецПроцедуры

&НаКлиенте
Процедура УВ_ВыборКодаВидаНоменклатурнойКлассификации_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		 ДанныеСканера = Результат.КодВидаНоменклатурнойКлассификации;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УВ_РасшифроватьQRКодЧекаККТ(Команда)
	
	Результат = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.РасшифроватьQRКодЧекаККТ(ДанныеСканера)
	
КонецПроцедуры

&НаКлиенте
Процедура УВ_ГенерироватьВнешнееСобытие(Команда)
		
	Если Не ЗначениеЗаполнено(СканерШК) Тогда
		ТекстСообщения = НСтр("ru='Не выбрано устройсво.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;                   

	ПараметрыОперации = Новый Структура();
	ПараметрыОперации.Вставить("ДанныеСобытия", "0104680029460908215(TP%vWRq?,ha93Peys");
	ПараметрыОперации.Вставить("Base64", Ложь);
	
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("RFID_ОперацияЗавершение", ЭтотОбъект);
	МодульОборудованиеУстройстваВводаКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеУстройстваВводаКлиент");
	МодульОборудованиеУстройстваВводаКлиент.ГенерироватьВнешнееСобытие(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, СканерШК, ПараметрыОперации);

КонецПроцедуры

&НаКлиенте         
Процедура Преобразовать(Команда)
	
	МаркировкаРеквизитКодаТовараHEX = Base64Значение(МаркировкаРеквизитКодаТовараBASE64); // Декодируем строку
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКодТовараДляDataMatrixGS1(Команда)
	
	МодульМенеджерОборудованияМаркировкаКлиентСервер = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("МенеджерОборудованияМаркировкаКлиентСервер");
	ДанныеМаркировки = МодульМенеджерОборудованияМаркировкаКлиентСервер.СформироватьКодТовараДляDataMatrixGS1(МаркировкаGTIN, МаркировкаСерийныйНомер);
	МаркировкаРеквизитКодаТовараBASE64 = ДанныеМаркировки.РеквизитКодаТовара;
	МаркировкаРеквизитКодаТовараHEX = ДанныеМаркировки.РеквизитКодаТовараHEX;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинкуВыборФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Карт = Новый Картинка(ВыбранныеФайлы[0]);
		КартинкаBase64 = Base64Строка(Карт.ПолучитьДвоичныеДанные());
		КартинкаBase64 = СтрЗаменить(КартинкаBase64, Символы.ПС, "");
		КартинкаBase64 = СтрЗаменить(КартинкаBase64, Символы.ВК, "");
		ЛоготипКартинка = ПоместитьВоВременноеХранилище(Карт);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинку(Команда)
	
	Обработчик = Новый ОписаниеОповещения("ЗагрузитьКартинкуВыборФайла", ЭтотОбъект);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выбор файла картинки PNG";
	Диалог.Фильтр = "PNG (*.png)|*.png";
	Диалог.ИндексФильтра = 0;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Показать(Обработчик);
	
КонецПроцедуры      

&НаКлиенте
Процедура ОтобразитьQRКодЗавершение(Результат, ПараметрыОперации) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", ЭтотОбъект, Параметры);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПечатьQRКодаНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, Неопределено, ПараметрыОперации); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьQRКод(Команда)
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПечатиQRКодаНаФискальномУстройстве();
	ПараметрыОперации.ТипПлатежнойСистемы = ПредопределенноеЗначение("Перечисление.ТипыПлатежнойСистемыККТ.СистемаБыстрыхПлатежей");
	ПараметрыОперации.QRКод.ЗначениеКода = "https://qr.nspk.ru/AD10003UOKK4J3J09SO9M1CSQ2U23BQC?type=02&bank=540000000001&sum=10010&cur=RUB&crc=86EE";
	ПараметрыОперации.СуммаОперации = 100;
	
	Если ОборудованиеДисплеиПокупателяКлиент.ПодключенныеДисплеиПокупателяВыводятQRКод() Тогда
		ПараметрыОперации = ОборудованиеДисплеиПокупателяКлиент.ПараметрыОперацииДисплейПокупателя();
		ПараметрыОперации.ЗначениеQRКода = ДПQRКод;
		ПараметрыОперации.КартинкаQRКода = КартинкаBase64;
		ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("ДП_ВыполнитьЗавершение", ЭтотОбъект);
		ОборудованиеДисплеиПокупателяКлиент.НачатьВыводQRКодаНаДисплейПокупателя(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, Неопределено, ПараметрыОперации);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ОтобразитьQRКодЗавершение", ЭтотОбъект, ПараметрыОперации);
		ТекстСообщения = НСтр("ru='Нет доступных дисплеев покупателя для отображения QR кода.'") + Символы.ПС 
			+ НСтр("ru='Распечатать QR код для подтверждения платежа на ККТ?'"); 
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинкуВесыВыборФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ТекущаяСрока = Элементы.ТаблицаТоваровВесовСПечатьюЭтикеток.ТекущиеДанные;
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Карт = Новый Картинка(ВыбранныеФайлы[0]);
		КартинкаBase64 = Base64Строка(Карт.ПолучитьДвоичныеДанные());
		КартинкаBase64 = СтрЗаменить(КартинкаBase64, Символы.ПС, "");
		КартинкаBase64 = СтрЗаменить(КартинкаBase64, Символы.ВК, "");   
		ТекущаяСрока.КартинкаBase64 = КартинкаBase64;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинкуВесы(Команда)
	
	ТекущаяСрока = Элементы.ТаблицаТоваровВесовСПечатьюЭтикеток.ТекущиеДанные;
	Если ТекущаяСрока <> Неопределено Тогда
		Обработчик = Новый ОписаниеОповещения("ЗагрузитьКартинкуВесыВыборФайла", ЭтотОбъект);
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Заголовок = "Выбор файла картинки PNG";
		Диалог.Фильтр = "PNG (*.png)|*.png";
		Диалог.ИндексФильтра = 0;
		Диалог.МножественныйВыбор = Ложь;
		Диалог.Показать(Обработчик);   
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ФУ_ЗаписатьЕГАИСВЖурналОперацийКМНаСервере()

	ПараметрыЗаписи = МенеджерОборудованияМаркировка.ПараметрыЗаписиРезультатаПроверкиЕГАИС();
	
	ШтрихкодыПродукции = Новый Соответствие;
	ШтрихкодЕГАИС = "1324006813320010180017P7ULFH4L2ZACFN6ETB44QTD2IRZ4VKUBCUALGFGJCMYJQEM2RKV62P6FJRI6F7IGOESJGF5SEWZ5C2HWCJJ4JFZCBAFNSNEPUVXNU3XPK2RWCTGGYPXZXN4NXHMLE6OA";
	ШтрихкодыПродукции.Вставить(ШтрихкодЕГАИС, Новый Структура("Наименование", НСтр("ru = 'Водка Русская'")));
	ШтрихкодЕГАИС = "1324006913320010180017P7ULFH4L2ZACFN6ETB44QTD2IRZ4VKUBCUALGFGJCMYJQEM2RKV62P6FJRI6F7IGOESJGF5SEWZ5C2HWCJJ4JFZCBAFNSNEPUVXNU3XPK2RWCTGGYPXZXN4NXHMLE6OB";
	ШтрихкодыПродукции.Вставить(ШтрихкодЕГАИС, Новый Структура("Наименование", НСтр("ru = 'Вино Грузинское'")));
	
	ПараметрыЗаписи.ИдентификаторФискальнойОперации = "";
	ПараметрыЗаписи.Выполнено = Истина;
	ПараметрыЗаписи.ШтрихкодыПродукции = ШтрихкодыПродукции;
	ПараметрыЗаписи.ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор());
	
	ПараметрыЗаписи.СообщениеПередано = Истина;
	ПараметрыЗаписи.ТекстОшибки = "";
	ПараметрыЗаписи.ПодписьЧека = "0000";
	
	МенеджерОборудованияМаркировка.ДобавитьРезультатыОтправкиЕГАИС(ПараметрыЗаписи);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СлучайноеЧисло(НижняяГраница, ВерхняяГраница)
	
	ГенераторСч = Новый ГенераторСлучайныхЧисел();
	Возврат ГенераторСч.СлучайноеЧисло(НижняяГраница, ВерхняяГраница);
	
КонецФункции

&НаСервереБезКонтекста
Функция СлучайноеЧислоНаСервере(НижняяГраница, ВерхняяГраница)
	
	Возврат СлучайноеЧисло(НижняяГраница, ВерхняяГраница);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СлучайныеЧисла(НижняяГраница, ВерхняяГраница, Количество)
	
	ГенераторЧисел = Новый ГенераторСлучайныхЧисел;
	Результат = Новый Массив;
	Для Индекс = 1 По Количество Цикл
		Результат.Добавить(ГенераторЧисел.СлучайноеЧисло(НижняяГраница, ВерхняяГраница));
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СлучайныеЧислаНаСервере(НижняяГраница, ВерхняяГраница, Количество)
	
	Возврат СлучайныеЧисла(НижняяГраница, ВерхняяГраница, Количество);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормыПО

&НаКлиенте
Функция ПолучитьЭквайринговыйТерминал()
	Если ЭТ.Пустая() Тогда
		ТекстСообщения = "ЭТ не выбран.";
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	Возврат ЭТ;
КонецФункции

&НаКлиенте
Функция ШаблонЭквайринговойОперации()    
	
	ПараметрыЭквайринговойОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();
	ПараметрыЭквайринговойОперации.ТипТранзакции  = ТипЭквайринговойОперации;
	ПараметрыЭквайринговойОперации.НомерМерчанта  = ЭТНомерМерчанта;
	ПараметрыЭквайринговойОперации.СуммаОперации  = ЭТСумма;
	
	ПараметрыЭквайринговойОперации.НомерЧека      = ЭТНомерЧека;
	ПараметрыЭквайринговойОперации.НомерЧекаЭТ    = ЭТНомерЧекаЭТ;
	ПараметрыЭквайринговойОперации.СсылочныйНомер = ЭТНомерСсылкиОперации;
	ПараметрыЭквайринговойОперации.ИдентификаторКорзины = ЭТИдентификаторКорзины;
	ПараметрыЭквайринговойОперации.СуммаЭлектронногоСертификата = ЭТСуммаЭлектронногоСертификата;
	ПараметрыЭквайринговойОперации.СуммаСобственныхСредств = ЭТСуммаСобственныхСредств;
	Если ПО_ОплатаQRКодомПлатежнойКарты Тогда
		ПараметрыЭквайринговойОперации.РеквизитыКартыQR = ЭТРеквизитыКартыQR;
	КонецЕсли;
	
	Возврат ПараметрыЭквайринговойОперации;   
	
КонецФункции

&НаКлиенте
Функция ШаблонЧекаПродажи()   
	
	Возврат ПолучитьШаблонЧека();  
	
КонецФункции

&НаСервере
Функция ПО_ЧекДокументОснование()

	Чек = Документы._ДемоЧек.СоздатьДокумент();
	Чек.Кассир = "Казакова Н.А.";
	Чек.Организация = "ООО ""Альфа""";
	Чек.ДатаКоррекции = ТекущаяДата();
	Чек.Дата = ТекущаяДата();
	Чек.Заполнить(Неопределено);
	Чек.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат Чек.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура ПО_СформироватьОплатуПоЧеку(ОбщиеПараметры, ТолькоБезнал = Ложь)
	
	ОбщиеПараметры.ДетализацияОплаты.Очистить();
	ОбщиеПараметры.ТаблицаОплат.Очистить();
	СуммаНал = ПО_СуммаПродажи - ПО_СуммаБезнал;
	
	Если СуммаНал>0 И Не ТолькоБезнал Тогда
		ДетализацияОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыДетализацииСтрокиОплаты();
		ДетализацияОплаты.НаименованиеТипаОплаты = "НАЛИЧНЫЕ";
		ДетализацияОплаты.Сумма = СуммаНал;
		ОбщиеПараметры.ДетализацияОплаты.Добавить(ДетализацияОплаты);
		
		СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты(); 
		СтрокаОплаты.Сумма = СуммаНал; 
		СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Наличные");
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	КонецЕсли;
		
	Если ПО_СуммаБезнал > 0 Тогда
		ДетализацияОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыДетализацииСтрокиОплаты();
		ДетализацияОплаты.НаименованиеТипаОплаты = "КАРТА МИР";
		ДетализацияОплаты.Сумма = ?(ТолькоБезнал, ПО_СуммаПродажи, ПО_СуммаБезнал);
		ОбщиеПараметры.ДетализацияОплаты.Добавить(ДетализацияОплаты);
		
		СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты(); 
		СтрокаОплаты.Сумма = ?(ТолькоБезнал, ПО_СуммаПродажи, ПО_СуммаБезнал);
		СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно");
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПО_ПродажаСВыдачей_ПодготовитьОперацию(ПараметрыОперации)

	ПО_РезультатОперации.Очистить();
	ПО_СостояниеУстройств.Очистить();
	
	// заполнить параметры
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиент.ПараметрыПродажаСВыдачейНаличных();
	ПараметрыОперации.ПараметрыФискализацииЧека = ШаблонЧекапродажи();
	//ПараметрыОперации.ПараметрыФискализацииЧека.ПозицииЧека[1].Текст = "";
	ПараметрыОперации.ПараметрыФискализацииЧека.ДокументОснование = ПО_ЧекДокументОснование();
	ПО_СформироватьОплатуПоЧеку(ПараметрыОперации.ПараметрыФискализацииЧека);

	
	Если Не ПО_РаспределеннаяФискализация Тогда
		ПараметрыОперации.ПараметрыВыполненияЭквайринговойОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();
		ЗаполнитьЗначенияСвойств(ПараметрыОперации.ПараметрыВыполненияЭквайринговойОперации, ШаблонЭквайринговойОперации());
		ПараметрыОперации.ПараметрыВыполненияЭквайринговойОперации.СуммаОперации = ПО_СуммаПродажи + ПО_СуммаВыдачи;
		ПараметрыОперации.ПараметрыВыполненияЭквайринговойОперации.СуммаНаличных = ПО_СуммаВыдачи;
		ПараметрыОперации.ПараметрыВыполненияЭквайринговойОперации.ТипТранзакции = "PayByPaymentCardWithCashWithdrawal";
		
		СтруктураДанныеАгента = ПараметрыОперации.ДанныеАгента;
		СтруктураДанныеАгента.ПлатежныйАгент.Операция       = "Выдача наличных";
		СтруктураДанныеАгента.ПлатежныйАгент.Телефон        = "+74957040404";
		СтруктураДанныеАгента.ОператорПеревода.Телефон      = "+74957040404";
		СтруктураДанныеАгента.ОператорПеревода.Наименование = "Сбербанк";
		СтруктураДанныеАгента.ОператорПеревода.Адрес        = "г. Вологда";
		СтруктураДанныеАгента.ОператорПеревода.ИНН          = "7714017115";

		//ПараметрыОперации.ДанныеПоставщика = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыДанныеПоставщика();
		//ПараметрыОперации.ДанныеПоставщика.ИНН          = "7714017115";
		//ПараметрыОперации.ДанныеПоставщика.Телефон      = "+74957040404";
		//ПараметрыОперации.ДанныеПоставщика.Наименование = "Получатель д/с";
	
		// эти процедуры следует вызвать 
		// если требуется изменить параметры фискалиазции чека выдачи
		ОборудованиеЧекопечатающиеУстройстваКлиент.ЗаполнитьПараметрыЧекаВыдачи(ПараметрыОперации);
		// или параметры фискализации чека коррекции
		ОборудованиеЧекопечатающиеУстройстваКлиент.ЗаполнитьПараметрыЧекаВозврата(ПараметрыОперации);
		
		Если ПО_Электронно2 Тогда
			// и теперь его можно заполнить
			ПараметрыОперации.ПараметрыФискализацииЧекаВыдачи.Электронно = Истина;
			ПараметрыОперации.ПараметрыФискализацииЧекаВыдачи.ПокупательEmail = "a@a.a";
			ПараметрыОперации.ПараметрыФискализацииЧекаВыдачи.ПокупательНомер = Неопределено;
		КонецЕсли;

		Если ПО_ПринудительнаяПечатьСлипЧековВТелеФискального Тогда
			ПараметрыОперации.СлипЧекВТелеФискального = Истина;
		КонецЕсли;
		ПараметрыОперации.ВыводитьУведомленияПользователя = ПО_ВыводитьУведомленияПользователя;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПО_ПродажаСВыдачейНаличных(Команда)
	
	ИдентификаторКлиента = УникальныйИдентификатор;
	ИдентификаторККТ     = ПолучитьФискальноеУстройство();
	ИдентификаторЭТ      = ПолучитьЭквайринговыйТерминал();

	ПараметрыОперации    = "";
	ПО_ПродажаСВыдачей_ПодготовитьОперацию(ПараметрыОперации);
	
	Если ПО_РаспределеннаяФискализация Тогда
		
		ПараметрыПакетнойОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПакетнойОперацииВОчередиЧеков();
		ПараметрыПакетнойОперации.ТипОперации     = ПредопределенноеЗначение("Перечисление.ТипыПакетнойОперацииВОчередиЧеков.ПродажаСВыдачейНаличных");
		ПараметрыПакетнойОперации.ИдентификаторЭТ = ИдентификаторЭТ;
		ПараметрыПакетнойОперации.ПараметрыПродажаСВыдачейНаличных.СуммаВыдачи     = ПО_СуммаВыдачи;
		ПараметрыПакетнойОперации.ПараметрыПродажаСВыдачейНаличных.ДокументОснованиеВыдачи = ПО_ЧекДокументОснование();
		Если ПО_ОплатаQRКодомПлатежнойКарты Тогда
			ПараметрыПакетнойОперации.ПараметрыЭквайринговойОперации.РеквизитыКартыQR = ЭТРеквизитыКартыQR;
		КонецЕсли;
		
		СтруктураДанныеАгента = ПараметрыПакетнойОперации.ПараметрыПродажаСВыдачейНаличных.ДанныеАгента;
		СтруктураДанныеАгента.ПлатежныйАгент.Операция       = "Выдача наличных";
		СтруктураДанныеАгента.ПлатежныйАгент.Телефон        = "+74957040404";
		СтруктураДанныеАгента.ОператорПеревода.Телефон      = "+74957040404";
		СтруктураДанныеАгента.ОператорПеревода.Наименование = "Сбербанк";
		СтруктураДанныеАгента.ОператорПеревода.Адрес        = "г. Вологда";
		СтруктураДанныеАгента.ОператорПеревода.ИНН          = "7714017115";
		
		ПО_ДобавитьЧекВОчередьЧековККТСервер(ПараметрыОперации.ПараметрыФискализацииЧека, ПараметрыПакетнойОперации);
		МодульРаспределеннаяФискализацияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("РаспределеннаяФискализацияКлиент");
		МодульРаспределеннаяФискализацияКлиент.ФискализацияЧековВОчереди(Ложь);
		
	Иначе
	
		// выполнить пакет операций
		ОписаниеОповещения = Новый ОписаниеОповещения("ПО_ПродажаСВыдачейНаличныхЗавершение", ЭтотОбъект);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПродажаСВыдачейНаличных(
			ОписаниеОповещения, 
			ИдентификаторКлиента, 
			ИдентификаторККТ, 
			ИдентификаторЭТ, 
			ПараметрыОперации,
			ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПО_ПродажаСВыдачейНаличныхСОшибкойПродажи(Команда)

	ИдентификаторКлиента = УникальныйИдентификатор;
	ИдентификаторККТ     = ПолучитьФискальноеУстройство();
	ИдентификаторЭТ      = ПолучитьЭквайринговыйТерминал();

	ПараметрыОперации    = "";
	ПО_ПродажаСВыдачей_ПодготовитьОперацию(ПараметрыОперации);
	
	// зададим некорректный параметр
	ПараметрыОперации.ПараметрыФискализацииЧека.КассирИНН = "111";
	
	Если ПО_РаспределеннаяФискализация Тогда
		
		ПараметрыПакетнойОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПакетнойОперацииВОчередиЧеков();
		ПараметрыПакетнойОперации.ТипОперации     = ПредопределенноеЗначение("Перечисление.ТипыПакетнойОперацииВОчередиЧеков.ПродажаСВыдачейНаличных");
		ПараметрыПакетнойОперации.ИдентификаторЭТ = ИдентификаторЭТ;
		ПараметрыПакетнойОперации.ПараметрыПродажаСВыдачейНаличных.СуммаВыдачи     = ПО_СуммаВыдачи;
		
		ПО_ДобавитьЧекВОчередьЧековККТСервер(ПараметрыОперации.ПараметрыФискализацииЧека, ПараметрыПакетнойОперации);
		МодульРаспределеннаяФискализацияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("РаспределеннаяФискализацияКлиент");
		МодульРаспределеннаяФискализацияКлиент.ФискализацияЧековВОчереди(Ложь);
		
	Иначе
	
		// выполнить пакет операций
		ОписаниеОповещения = Новый ОписаниеОповещения("ПО_ПродажаСВыдачейНаличныхЗавершение", ЭтотОбъект);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПродажаСВыдачейНаличных(
			ОписаниеОповещения, 
			ИдентификаторКлиента, 
			ИдентификаторККТ, 
			ИдентификаторЭТ, 
			ПараметрыОперации,
			ДополнительныеПараметры);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПО_ПродажаСВыдачейНаличныхСОшибкойВыдачи(Команда)

	ИдентификаторКлиента = УникальныйИдентификатор;
	ИдентификаторККТ     = ПолучитьФискальноеУстройство();
	ИдентификаторЭТ      = ПолучитьЭквайринговыйТерминал();

	ПараметрыОперации    = "";
	ПО_ПродажаСВыдачей_ПодготовитьОперацию(ПараметрыОперации);
	
	// зададим некорректный параметр
	ПараметрыОперации.ПараметрыФискализацииЧекаВыдачи.КассирИНН = "111";
	
	// выполнить пакет операций
	ОписаниеОповещения = Новый ОписаниеОповещения("ПО_ПродажаСВыдачейНаличныхЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПродажаСВыдачейНаличных(
		ОписаниеОповещения, 
		ИдентификаторКлиента, 
		ИдентификаторККТ, 
		ИдентификаторЭТ, 
		ПараметрыОперации,
		ДополнительныеПараметры);    
		
КонецПроцедуры

&НаКлиенте
Процедура ПО_ПродажаСВыдачейНаличныхСОшибкойКоррекции(Команда)

	ИдентификаторКлиента = УникальныйИдентификатор;
	ИдентификаторККТ     = ПолучитьФискальноеУстройство();
	ИдентификаторЭТ      = ПолучитьЭквайринговыйТерминал();

	ПараметрыОперации    = "";
	ПО_ПродажаСВыдачей_ПодготовитьОперацию(ПараметрыОперации);
	
	// зададим некорректный параметр
	ПараметрыОперации.ПараметрыФискализацииЧекаВыдачи.КассирИНН = "111";
	ПараметрыОперации.ПараметрыФискализацииЧекаВозврата.КассирИНН = "111";
	
	// выполнить пакет операций
	ОписаниеОповещения = Новый ОписаниеОповещения("ПО_ПродажаСВыдачейНаличныхЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПродажаСВыдачейНаличных(
		ОписаниеОповещения, 
		ИдентификаторКлиента, 
		ИдентификаторККТ, 
		ИдентификаторЭТ, 
		ПараметрыОперации,
		ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура ПО_ПродажаСВыдачейНаличныхЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Свойство("ИдентификаторЗаписи") Тогда
		Результат = ПО_ПолучитьСтатусЧекаВОчередиНаСервере(Результат.ИдентификаторЗаписи);
		Результат = Результат.РезультатПакетнойОперации;
	КонецЕсли;
	
	ПО_РезультатОперации.Очистить();
	ПО_СостояниеУстройств.Очистить();
	
	Строка = ПО_РезультатОперации.Добавить();
	Строка.Параметр = "Общий";
	ЗаполнитьЗначенияСвойств(Строка, Результат);
	
	Строка = ПО_РезультатОперации.Добавить();
	Строка.Параметр = "Оплата с выдачей наличных";
	Если ЗначениеЗаполнено(Результат.РезультатВыполненияЭквайринговойОперации) Тогда
		ЗаполнитьЗначенияСвойств(Строка, Результат.РезультатВыполненияЭквайринговойОперации);
	КонецЕсли;

	Строка = ПО_РезультатОперации.Добавить();
	Строка.Параметр = "Фискализация чека продажи";
	Если ЗначениеЗаполнено(Результат.РезультатФискализацииЧека) Тогда
		ЗаполнитьЗначенияСвойств(Строка, Результат.РезультатФискализацииЧека);
	КонецЕсли;
	
	Строка = ПО_РезультатОперации.Добавить();
	Строка.Параметр = "Фискализация чека выдачи наличных";
	Если ЗначениеЗаполнено(Результат.РезультатФискализацииЧекаВыдачи) Тогда
		ЗаполнитьЗначенияСвойств(Строка, Результат.РезультатФискализацииЧекаВыдачи);
	КонецЕсли;
	
	Строка = ПО_РезультатОперации.Добавить();
	Строка.Параметр = "Фискализация чека возврата";
	Если ЗначениеЗаполнено(Результат.РезультатФискализацииЧекаВозврата) Тогда
		ЗаполнитьЗначенияСвойств(Строка, Результат.РезультатФискализацииЧекаВозврата);
	КонецЕсли;
	
	Строка = ПО_РезультатОперации.Добавить();
	Строка.Параметр = "Аварийная отмена эквайринговой операции";
	Если ЗначениеЗаполнено(Результат.РезультатАварийнойОтменыОперации) Тогда
		ЗаполнитьЗначенияСвойств(Строка, Результат.РезультатАварийнойОтменыОперации);
	КонецЕсли;
	
	ИдентификаторКлиента = УникальныйИдентификатор;
	ИдентификаторККТ = ПолучитьФискальноеУстройство();
	ИдентификаторЭТ = ПолучитьЭквайринговыйТерминал();

	Строка = ПО_СостояниеУстройств.Добавить();
	Строка.Устройство = ИдентификаторККТ;
	Строка.Подключено = ЗначениеЗаполнено(МенеджерОборудованияКлиент.ПолучитьПодключенноеУстройство(ИдентификаторККТ));

	Строка = ПО_СостояниеУстройств.Добавить();
	Строка.Устройство = ИдентификаторЭТ;
	Строка.Подключено = ЗначениеЗаполнено(МенеджерОборудованияКлиент.ПолучитьПодключенноеУстройство(ИдентификаторЭТ));
	
КонецПроцедуры

&НаКлиенте
Процедура ПО_ФискализацияЧекаСОплатой_ПодготовитьОперацию(ПараметрыОперации)
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиент.ПараметрыФискализацияЧекаСОплатойКартой();
	ПараметрыОперации.ПараметрыФискализацииЧека = ПолучитьШаблонЧека();

	ПО_СформироватьОплатуПоЧеку(ПараметрыОперации.ПараметрыФискализацииЧека);

	Если ПО_Электронно1 Тогда
		ПараметрыОперации.ПараметрыФискализацииЧека.Электронно = Истина;
		ПараметрыОперации.ПараметрыФискализацииЧека.ПокупательEmail = "a@a.a";
		ПараметрыОперации.ПараметрыФискализацииЧека.ПокупательНомер = Неопределено;
	КонецЕсли;

	Если Не ПО_РаспределеннаяФискализация Тогда
		ПараметрыОперации.ПараметрыВыполненияЭквайринговойОперации = ШаблонЭквайринговойОперации();
		Если ПО_СвойВопросПользователю Тогда
			ДопПараметры = Новый Структура("ТипОперации", "ПО_СвойВопросПользователюОплатаСФискализациейЗавершение");
			ПараметрыОперации.ОповещениеВопросПользователю = Новый ОписаниеОповещения("ПО_СвойВопросПользователю", ЭтотОбъект, ДопПараметры);
		КонецЕсли;
		ПараметрыОперации.ПараметрыВыполненияЭквайринговойОперации.СуммаОперации = ПО_СуммаБезнал;
		ПараметрыОперации.ПараметрыВыполненияЭквайринговойОперации.ТипТранзакции = "AuthorizeSales";
	
		Если ПО_ПринудительнаяПечатьСлипЧековВТелеФискального Тогда
			ПараметрыОперации.СлипЧекВТелеФискального = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПО_ФискализацияЧекаСОплатойСОшибкойФискализации(Команда)
	
	ИдентификаторКлиента = УникальныйИдентификатор;
	ИдентификаторККТ = ПолучитьФискальноеУстройство();
	ИдентификаторЭТ = ПолучитьЭквайринговыйТерминал();
	
	ПараметрыОперации = "";
	ПО_ФискализацияЧекаСОплатой_ПодготовитьОперацию(ПараметрыОперации);
	
	// зададим некорректный параметр
	ПараметрыОперации.ПараметрыФискализацииЧека.КассирИНН = "111";
	
	Если ПО_РаспределеннаяФискализация Тогда
		
		ПараметрыПакетнойОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПакетнойОперацииВОчередиЧеков();
		ПараметрыПакетнойОперации.ТипОперации     = ПредопределенноеЗначение("Перечисление.ТипыПакетнойОперацииВОчередиЧеков.ФискализацияЧекаСОплатойКартой");
		ПараметрыПакетнойОперации.ИдентификаторЭТ = ИдентификаторЭТ;
		ПараметрыПакетнойОперации.ПараметрыЭквайринговойОперации.ВидОплаты = "VISA";
		ПараметрыПакетнойОперации.ПараметрыЭквайринговойОперации.ПроцентКомиссии = 0;
		
		ПО_ДобавитьЧекВОчередьЧековККТСервер(ПараметрыОперации.ПараметрыФискализацииЧека, ПараметрыПакетнойОперации);
		МодульРаспределеннаяФискализацияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("РаспределеннаяФискализацияКлиент");
		МодульРаспределеннаяФискализацияКлиент.ФискализацияЧековВОчереди(Ложь);
		
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ПО_ФискализацияЧекаСОплатойКартойЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФискализациюЧекаСОплатойКартой(
			ОписаниеОповещения, 
			ИдентификаторКлиента, 
			ИдентификаторККТ, 
			ИдентификаторЭТ, 
			ПараметрыОперации,
			ДополнительныеПараметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПО_ФискализацияЧекаСОплатой(Команда)
	
	ИдентификаторЭТ = ПолучитьЭквайринговыйТерминал();
	
	ПараметрыОперации = "";
	ПО_ФискализацияЧекаСОплатой_ПодготовитьОперацию(ПараметрыОперации);

	Если ПО_РаспределеннаяФискализация Тогда
		
		ПараметрыПакетнойОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПакетнойОперацииВОчередиЧеков();
		ПараметрыПакетнойОперации.ТипОперации     = ПредопределенноеЗначение("Перечисление.ТипыПакетнойОперацииВОчередиЧеков.ФискализацияЧекаСОплатойКартой");
		ПараметрыПакетнойОперации.ИдентификаторЭТ = ИдентификаторЭТ;
		ПараметрыПакетнойОперации.ПараметрыЭквайринговойОперации.ВидОплаты = "VISA";
		ПараметрыПакетнойОперации.ПараметрыЭквайринговойОперации.ПроцентКомиссии = 0;
		Если ПО_ОплатаQRКодомПлатежнойКарты Тогда
			ПараметрыПакетнойОперации.ПараметрыЭквайринговойОперации.РеквизитыКартыQR = ЭТРеквизитыКартыQR;
		КонецЕсли;
		
		ПО_ДобавитьЧекВОчередьЧековККТСервер(ПараметрыОперации.ПараметрыФискализацииЧека, ПараметрыПакетнойОперации);
		МодульРаспределеннаяФискализацияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("РаспределеннаяФискализацияКлиент");
		МодульРаспределеннаяФискализацияКлиент.ФискализацияЧековВОчереди(Ложь);
		
	Иначе
		ИдентификаторКлиента = УникальныйИдентификатор;
		ИдентификаторККТ = ПолучитьФискальноеУстройство();
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПО_ФискализацияЧекаСОплатойКартойЗавершение", ЭтотОбъект);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФискализациюЧекаСОплатойКартой(
			ОписаниеОповещения, 
			ИдентификаторКлиента, 
			ИдентификаторККТ, 
			ИдентификаторЭТ, 
			ПараметрыОперации, 
			ДополнительныеПараметры);
	КонецЕсли;  
		
КонецПроцедуры

&НаКлиенте
Процедура ПО_ФискализацияЧекаСОплатойКартойЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Свойство("ИдентификаторЗаписи") Тогда
		Результат = ПО_ПолучитьСтатусЧекаВОчередиНаСервере(Результат.ИдентификаторЗаписи);
		Результат = Результат.РезультатПакетнойОперации;
	КонецЕсли;

	ПО_РезультатОперации.Очистить();
	ПО_СостояниеУстройств.Очистить();

	Строка = ПО_РезультатОперации.Добавить();
	Строка.Параметр = "Общий";
	ЗаполнитьЗначенияСвойств(Строка, Результат);
	
	Строка = ПО_РезультатОперации.Добавить();
	Строка.Параметр = "Оплата";
	Если ЗначениеЗаполнено(Результат.РезультатВыполненияЭквайринговойОперации) Тогда
		ЗаполнитьЗначенияСвойств(Строка, Результат.РезультатВыполненияЭквайринговойОперации);
	КонецЕсли;
	
	Строка = ПО_РезультатОперации.Добавить();
	Строка.Параметр = "Фискализация";
	Если ЗначениеЗаполнено(Результат.РезультатФискализацииЧека) Тогда
		ЗаполнитьЗначенияСвойств(Строка, Результат.РезультатФискализацииЧека);
	КонецЕсли;
	
	Строка = ПО_РезультатОперации.Добавить();
	Строка.Параметр = "Аварийная отмена";
	Если ЗначениеЗаполнено(Результат.РезультатАварийнойОтменыОперации) Тогда
		ЗаполнитьЗначенияСвойств(Строка, Результат.РезультатАварийнойОтменыОперации);
	КонецЕсли;

	ИдентификаторКлиента = УникальныйИдентификатор;
	ИдентификаторККТ = ПолучитьФискальноеУстройство();
	Если Результат.РезультатВыполненияЭквайринговойОперации <> Неопределено Тогда
		ИдентификаторЭТ = ПолучитьЭквайринговыйТерминал();
	КонецЕсли;

	Строка = ПО_СостояниеУстройств.Добавить();
	Строка.Устройство = ИдентификаторККТ;
	Строка.Подключено = ЗначениеЗаполнено(МенеджерОборудованияКлиент.ПолучитьПодключенноеУстройство(ИдентификаторККТ));

	Строка = ПО_СостояниеУстройств.Добавить();
	Строка.Устройство = ИдентификаторЭТ;
	Строка.Подключено = ЗначениеЗаполнено(МенеджерОборудованияКлиент.ПолучитьПодключенноеУстройство(ИдентификаторЭТ));
	
КонецПроцедуры

&НаКлиенте
Процедура ПО_СвойВопросПользователю(Результат, ДопПараметры) Экспорт
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ОписаниеОшибки", Результат.РезультатОперации.ОписаниеОшибки);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения(ДопПараметры.ТипОперации, ЭтотОбъект, Результат.КонтекстОперации);
	
	ОткрытьФорму(
		"Обработка._ДемоТестированиеПодключаемогоОборудования.Форма.ФормаВопросПользователюПриОшибкеОплаты",
		ПараметрыФормы,
		ЭтаФорма,
		УникальныйИдентификатор,,,
		ОповещениеОЗакрытии, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		
КонецПроцедуры

&НаКлиенте
Процедура ПО_ЗапуститьОчередьФискализации(Команда) 
	
	МодульРаспределеннаяФискализацияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("РаспределеннаяФискализацияКлиент");
	МодульРаспределеннаяФискализацияКлиент.ФискализацияЧековВОчереди();  
	
КонецПроцедуры

&НаСервере
Процедура ПО_ОчиститьОчередьФискализацииСервер()   
	
	НаборЗаписей = РегистрыСведений.ОчередьЧековККТ.СоздатьНаборЗаписей();
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПО_ОчиститьОчередьФискализации(Команда) 
	
	ПО_ОчиститьОчередьФискализацииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеПараметровУстройства(Команда)
	
	Если ЭТ.Пустая() Тогда
		ТекстСообщения = "ЭТ не выбран.";
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НачатьПолучениеПараметровУстройстваЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьПолучениеПараметровУстройства(ОписаниеОповещения, УникальныйИдентификатор, ЭТ); 
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеПараметровУстройстваЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(РезультатВыполнения);
	
КонецПроцедуры                          

&НаКлиенте
Процедура ЗапросКМФормируетсяЛокальноПриИзменении(Элемент)
	
	ОжидатьПолучениеОтветаОИСМ = НЕ ЗапросКМФормируетсяЛокально;   
	Элементы.ОжидатьПолучениеОтветаОИСМ.Доступность = НЕ ЗапросКМФормируетсяЛокально; 
	
КонецПроцедуры

&НаСервере
Процедура ПО_ДобавитьЧекВОчередьЧековККТСервер(ПараметрыФискализацииЧека, ПараметрыПакетнойОперации)
	МодульРаспределеннаяФискализация = ОбщегоНазначенияБПО.ОбщийМодуль("РаспределеннаяФискализация");
	МодульРаспределеннаяФискализация.ДобавитьЧекВОчередьЧековККТ(ПараметрыФискализацииЧека, ПараметрыПакетнойОперации);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПО_ПолучитьСтатусЧекаВОчередиНаСервере(ИдентификаторЗаписи)
	МодульРаспределеннаяФискализация = ОбщегоНазначенияБПО.ОбщийМодуль("РаспределеннаяФискализация");
	Возврат МодульРаспределеннаяФискализация.ПолучитьСтатусЧекаВОчереди(ИдентификаторЗаписи);
КонецФункции

&НаКлиенте
Процедура ПО_ПокупкаСЗачислением_ПодготовитьОперацию(ПараметрыОперации)
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиент.ПараметрыФискализацияЧекаСОплатойКартой();
	ПараметрыОперации.ПараметрыФискализацииЧека = ПолучитьШаблонЧека();
	ПараметрыОперации.ПараметрыФискализацииЧека.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств");

	ТолькоБезнал = Истина;
	ПО_СформироватьОплатуПоЧеку(ПараметрыОперации.ПараметрыФискализацииЧека, ТолькоБезнал);

	Если ПО_Электронно1 Тогда
		ПараметрыОперации.ПараметрыФискализацииЧека.Электронно = Истина;
		ПараметрыОперации.ПараметрыФискализацииЧека.ПокупательEmail = "a@a.a";
		ПараметрыОперации.ПараметрыФискализацииЧека.ПокупательНомер = Неопределено;
	КонецЕсли;

	Если Не ПО_РаспределеннаяФискализация Тогда
		ПараметрыОперации.ПараметрыВыполненияЭквайринговойОперации = ШаблонЭквайринговойОперации();
		Если ПО_СвойВопросПользователю Тогда
			ДопПараметры = Новый Структура("ТипОперации", "ПО_СвойВопросПользователюПокупкаСЗачислениемЗавершение");
			ПараметрыОперации.ОповещениеВопросПользователю = Новый ОписаниеОповещения("ПО_СвойВопросПользователю", ЭтотОбъект, ДопПараметры);
		КонецЕсли;
		ПараметрыОперации.ПараметрыВыполненияЭквайринговойОперации.СуммаОперации = ПО_СуммаПродажи;
		ПараметрыОперации.ПараметрыВыполненияЭквайринговойОперации.ТипТранзакции = "PurchaseWithEnrollment";
	
		Если ПО_ПринудительнаяПечатьСлипЧековВТелеФискального Тогда
			ПараметрыОперации.СлипЧекВТелеФискального = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПО_ПокупкаСЗачислением(Команда)
	
	ИдентификаторЭТ = ПолучитьЭквайринговыйТерминал();
	
	ПараметрыОперации = "";
	ПО_ПокупкаСЗачислением_ПодготовитьОперацию(ПараметрыОперации);

	Если ПО_РаспределеннаяФискализация Тогда
		
		ПараметрыПакетнойОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПакетнойОперацииВОчередиЧеков();
		ПараметрыПакетнойОперации.ТипОперации     = ПредопределенноеЗначение("Перечисление.ТипыПакетнойОперацииВОчередиЧеков.ПокупкаСЗачислением");
		ПараметрыПакетнойОперации.ИдентификаторЭТ = ИдентификаторЭТ;
		ПараметрыПакетнойОперации.ПараметрыЭквайринговойОперации.ВидОплаты = "VISA";
		ПараметрыПакетнойОперации.ПараметрыЭквайринговойОперации.ПроцентКомиссии = 0;
		Если ПО_ОплатаQRКодомПлатежнойКарты Тогда
			ПараметрыПакетнойОперации.ПараметрыЭквайринговойОперации.РеквизитыКартыQR = ЭТРеквизитыКартыQR;
		КонецЕсли;
		
		ПО_ДобавитьЧекВОчередьЧековККТСервер(ПараметрыОперации.ПараметрыФискализацииЧека, ПараметрыПакетнойОперации);
		МодульРаспределеннаяФискализацияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("РаспределеннаяФискализацияКлиент");
		МодульРаспределеннаяФискализацияКлиент.ФискализацияЧековВОчереди(Ложь);
		
	Иначе
		ИдентификаторКлиента = УникальныйИдентификатор;
		ИдентификаторККТ = ПолучитьФискальноеУстройство();
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПО_ПокупкаСЗачислениемЗавершение", ЭтотОбъект);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПокупкаСЗачислением(
			ОписаниеОповещения, 
			ИдентификаторКлиента, 
			ИдентификаторККТ, 
			ИдентификаторЭТ, 
			ПараметрыОперации, 
			ДополнительныеПараметры);
	КонецЕсли;  
		
КонецПроцедуры

&НаКлиенте
Процедура ПО_ПокупкаСЗачислениемСОшибкой(Команда)
	
	ИдентификаторЭТ = ПолучитьЭквайринговыйТерминал();
	
	ПараметрыОперации = "";
	ПО_ПокупкаСЗачислением_ПодготовитьОперацию(ПараметрыОперации);

	// зададим некорректный параметр
	ПараметрыОперации.ПараметрыФискализацииЧека.КассирИНН = "111";
	
	Если ПО_РаспределеннаяФискализация Тогда
		
		ПараметрыПакетнойОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПакетнойОперацииВОчередиЧеков();
		ПараметрыПакетнойОперации.ТипОперации     = ПредопределенноеЗначение("Перечисление.ТипыПакетнойОперацииВОчередиЧеков.ПокупкаСЗачислением");
		ПараметрыПакетнойОперации.ИдентификаторЭТ = ИдентификаторЭТ;
		ПараметрыПакетнойОперации.ПараметрыЭквайринговойОперации.ВидОплаты = "VISA";
		ПараметрыПакетнойОперации.ПараметрыЭквайринговойОперации.ПроцентКомиссии = 0;
		Если ПО_ОплатаQRКодомПлатежнойКарты Тогда
			ПараметрыПакетнойОперации.ПараметрыЭквайринговойОперации.РеквизитыКартыQR = ЭТРеквизитыКартыQR;
		КонецЕсли;
		
		ПО_ДобавитьЧекВОчередьЧековККТСервер(ПараметрыОперации.ПараметрыФискализацииЧека, ПараметрыПакетнойОперации);
		МодульРаспределеннаяФискализацияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("РаспределеннаяФискализацияКлиент");
		МодульРаспределеннаяФискализацияКлиент.ФискализацияЧековВОчереди(Ложь);
		
	Иначе
		ИдентификаторКлиента = УникальныйИдентификатор;
		ИдентификаторККТ = ПолучитьФискальноеУстройство();
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПО_ПокупкаСЗачислениемЗавершение", ЭтотОбъект);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПокупкаСЗачислением(
			ОписаниеОповещения, 
			ИдентификаторКлиента, 
			ИдентификаторККТ, 
			ИдентификаторЭТ, 
			ПараметрыОперации, 
			ДополнительныеПараметры);
	КонецЕсли;  
		
КонецПроцедуры

&НаКлиенте
Процедура ПО_ПокупкаСЗачислениемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Свойство("ИдентификаторЗаписи") Тогда
		Результат = ПО_ПолучитьСтатусЧекаВОчередиНаСервере(Результат.ИдентификаторЗаписи);
		Результат = Результат.РезультатПакетнойОперации;
	КонецЕсли;

	ПО_РезультатОперации.Очистить();
	ПО_СостояниеУстройств.Очистить();

	Строка = ПО_РезультатОперации.Добавить();
	Строка.Параметр = "Общий";
	ЗаполнитьЗначенияСвойств(Строка, Результат);
	
	Строка = ПО_РезультатОперации.Добавить();
	Строка.Параметр = "Оплата";
	Если ЗначениеЗаполнено(Результат.РезультатВыполненияЭквайринговойОперации) Тогда
		ЗаполнитьЗначенияСвойств(Строка, Результат.РезультатВыполненияЭквайринговойОперации);
	КонецЕсли;
	
	Строка = ПО_РезультатОперации.Добавить();
	Строка.Параметр = "Фискализация";
	Если ЗначениеЗаполнено(Результат.РезультатФискализацииЧека) Тогда
		ЗаполнитьЗначенияСвойств(Строка, Результат.РезультатФискализацииЧека);
	КонецЕсли;
	
	Строка = ПО_РезультатОперации.Добавить();
	Строка.Параметр = "Аварийная отмена";
	Если ЗначениеЗаполнено(Результат.РезультатАварийнойОтменыОперации) Тогда
		ЗаполнитьЗначенияСвойств(Строка, Результат.РезультатАварийнойОтменыОперации);
	КонецЕсли;

	ИдентификаторКлиента = УникальныйИдентификатор;
	ИдентификаторККТ = ПолучитьФискальноеУстройство();
	Если Результат.РезультатВыполненияЭквайринговойОперации <> Неопределено Тогда
		ИдентификаторЭТ = ПолучитьЭквайринговыйТерминал();
	КонецЕсли;

	Строка = ПО_СостояниеУстройств.Добавить();
	Строка.Устройство = ИдентификаторККТ;
	Строка.Подключено = ЗначениеЗаполнено(МенеджерОборудованияКлиент.ПолучитьПодключенноеУстройство(ИдентификаторККТ));

	Строка = ПО_СостояниеУстройств.Добавить();
	Строка.Устройство = ИдентификаторЭТ;
	Строка.Подключено = ЗначениеЗаполнено(МенеджерОборудованияКлиент.ПолучитьПодключенноеУстройство(ИдентификаторЭТ));
	
КонецПроцедуры

&НаКлиенте
Процедура ПО_СвойВопросПользователюОплатаСФискализациейЗавершение(Результат, КонтекстОперации) Экспорт
	
	Если Результат = "Оплачено" Тогда
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФискализациюЧекаСОплатойКартой_ПродолжитьВыполнение(Истина, КонтекстОперации);
	ИначеЕсли Результат = "Повторить" Тогда
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФискализациюЧекаСОплатойКартой_ПовторитьОплату(КонтекстОперации);
	ИначеЕсли Результат = "Отмена" Тогда
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФискализациюЧекаСОплатойКартой_ПродолжитьВыполнение(Ложь, КонтекстОперации);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПО_СвойВопросПользователюПокупкаСЗачислениемЗавершение(Результат, КонтекстОперации) Экспорт
	
	Если Результат = "Оплачено" Тогда
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПокупкаСЗачислением_ПродолжитьВыполнение(Истина, КонтекстОперации);
	ИначеЕсли Результат = "Повторить" Тогда
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПокупкаСЗачислением_ПовторитьОплату(КонтекстОперации);
	ИначеЕсли Результат = "Отмена" Тогда
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПокупкаСЗачислением_ПродолжитьВыполнение(Ложь, КонтекстОперации);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Несертифицированное_ВыполнитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Результат Тогда
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(НСтр("ru='Операция выполнена успешно.'"));
	Иначе
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(Результат.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Несертифицированное_Выполнить(Команда)
	
	ПараметрыОперации = ОборудованиеНесертифицированноеКлиентСервер.ПараметрыОперации();
	ПараметрыОперации.ПодготовитьДанные = Несертифицированное_Подготовить;
	ПараметрыОперации.ОбработатьДанные = Несертифицированное_Обработать;
	ПараметрыОперации.Команда = Несертифицированное_Команда;
	
	Оповещение = Новый ОписаниеОповещения("Несертифицированное_ВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеНесертифицированноеКлиент.НачатьВыполнениеКоманды(Оповещение, , НесертифицированноеОборудование, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭТ_ЗаполнитьРеквизитыКартыQR(Команда)
	
	ЭТРеквизитыКартыQR = "hQVDUFYwMWGBqk8HoAAABlgQEFAMTUlSIENJVCBRUjAxVxAiATiUAAAABtJRIgETMGd4WggiATiUAAAABl80AQGfJgjvysaDVc+U2J8nAYCfNgIAAZ8CBgAAAAAAAJ8DBgAAAAAAAJUFgAAACACfNAMgAAKfGgIGQ18qAgZDmgMiBwScAQCfNwQAAAAAggIAgJ8QIA+lAaDwAAAAAAAAAAAAAAAOAAAAAAAAAAAAAAAAAQAA";
	
КонецПроцедуры

&НаКлиенте       
Процедура ВывестиСвойства(ОтображаемыеПараметры)
	
	Элементы.Печать.ТекущаяСтраница = Элементы.Параметры;
	
	Если Параметры <> Неопределено Тогда                
		Для Каждого Параметр из ОтображаемыеПараметры Цикл
			Если ТипЗнч(Параметр.Значение) = Тип("Структура") Тогда
				Для Каждого ВложПараметр из Параметр.Значение Цикл
					СтрокаТаблицы = ККТ_Параметры.Добавить();  
					СтрокаТаблицы.Имя = Параметр.Ключ + "." + ВложПараметр.Ключ;    
					СтрокаТаблицы.Значение = ВложПараметр.Значение; 
				КонецЦикла; 
			Иначе
				СтрокаТаблицы = ККТ_Параметры.Добавить();  
				СтрокаТаблицы.Имя = Параметр.Ключ;    
				СтрокаТаблицы.Значение = Параметр.Значение; 
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция РасчитатьНДС(Знач Сумма, Знач СтавкаНДС)   
	
	Если СтавкаНДС <> Неопределено И СтавкаНДС > 0 Тогда        
		Если СтавкаНДС > 100 Тогда
			СтавкаНДС = СтавкаНДС - 100;
		КонецЕсли;
		СуммаНДС = Окр(Сумма / (100 + СтавкаНДС) * СтавкаНДС, 2)
	Иначе
		СуммаНДС = 0;
	КонецЕсли;
	
	Возврат СуммаНДС;
	
КонецФункции

#КонецОбласти 