Функция ПолучениеПеребора(Заведение,ДатаЗапроса) Экспорт 
	ОбщаяКасса=0;
	СуммаДесертов=0;
	СуммаХлеба=0;
	СуммаДизеля=0;
	СуммаРасходов=0;
	СуммаПеребора=0;
	СуммаПроцентов=0;
	
	Отчет = Документы.ДневнойОтчет.Выбрать(НачалоНедели(ДатаЗапроса),ДатаЗапроса);
	
	Пока Отчет.Следующий() Цикл
		ТекущийОтчет = Отчет.ПолучитьОбъект();
		Если ТекущийОтчет.Заведение = Заведение Тогда
			Для Каждого Выборка Из ТекущийОтчет.ОсновнаяИнформация Цикл 
				Если Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.ОбщаяКасса Тогда
					ОбщаяКасса=ОбщаяКасса+Выборка.Сумма;
					
				ИначеЕсли Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.Десерты Тогда
					СуммаДесертов=СуммаДесертов+Выборка.Сумма;	
				ИначеЕсли Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.Хлеб Тогда
					СуммаХлеба=СуммаХлеба+Выборка.Сумма;	
				ИначеЕсли Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.Дизель Тогда	
					СуммаДизеля=СуммаДизеля+Выборка.Сумма;	
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого Выборка Из ТекущийОтчет.Расходы Цикл
				СуммаРасходов=СуммаРасходов+Выборка.Сумма;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
		
	СуммаПроцентов=(ОбщаяКасса-СуммаХлеба-СуммаДесертов)*0.2;
	СуммаПеребора=СуммаПроцентов-(СуммаРасходов+СуммаДизеля);
	Сообщить("Общая касса "+Строка(ОбщаяКасса)+", сумма хлеба "+Строка(СуммаХлеба)+", сумма десертов "+Строка(СуммаДесертов)
		+", сумма дизеля "+Строка(СуммаДизеля)+", сумма расходов "+Строка(СуммаРасходов)+", сумма процентов "+Строка(СуммаПроцентов)
		+", сумма перебора "+Строка(СуммаПеребора));
	Возврат СуммаПеребора; 		
КонецФункции

Функция СсылкаНаОтчет(ДатаСмены,Заведение) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДневнойОтчет.Заведение КАК Заведение,
		|	ДневнойОтчет.Ссылка КАК Ссылка,
		|	ДневнойОтчет.Дата КАК Дата
		|ИЗ
		|	Документ.ДневнойОтчет КАК ДневнойОтчет
		|ГДЕ
		|	ДневнойОтчет.Заведение = &Заведение
		|	И ДневнойОтчет.ДатаСмены = &ДатаСмены";
	
	Запрос.УстановитьПараметр("ДатаСмены", ДатаСмены);
	Запрос.УстановитьПараметр("Заведение", Заведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
		
КонецФункции

Функция ПолученияИндексаСтраницыДневнойОтчет(Страница) Экспорт 
	
	Если Страница = "ОсновнаяИнформация" Тогда
		Возврат 1;
	ИначеЕсли Страница = "Расходы" Тогда
		Возврат 2;
	ИначеЕсли Страница = "Накладные" Тогда
		Возврат 3;	
	ИначеЕсли Страница = "Зарплаты" Тогда
		Возврат 4;
	ИначеЕсли Страница = "ДолговыеНакладные" Тогда
		Возврат 5;
	ИначеЕсли Страница = "ЗадолжнотиЗакупщика" Тогда
		Возврат 6;
	ИначеЕсли Страница = "НеОплаченыеЗП" Тогда
		Возврат 7;
	КонецЕсли;
	
КонецФункции

Функция ПолученияИндексаКолонкиДневнойОтчет(Колонка) Экспорт 
	//сумма,поставщик,статья,комментарий,оплачено,закупщик,номер,тип накладной,выданаЗП,дата, ошибка
	Если Колонка = "Сумма" Тогда
		Возврат 1;
	ИначеЕсли Колонка = "Поставщик" Тогда
		Возврат 2;	
	ИначеЕсли Колонка = "Статья" Тогда
		Возврат 3;
	ИначеЕсли Колонка = "Коментарий" Тогда
		Возврат 4;	
	ИначеЕсли Колонка = "Оплачено" Тогда
		Возврат 5;
	ИначеЕсли Колонка = "Закупщик" Тогда
		Возврат 6;
	ИначеЕсли Колонка = "Номер" Тогда
		Возврат 7
	ИначеЕсли Колонка = "ТипНакладной" Тогда
		Возврат 8;
	ИначеЕсли Колонка = "Выдана" Тогда
		Возврат 9;	
	ИначеЕсли Колонка = "Дата" Тогда
		Возврат 10;	
	ИначеЕсли Колонка = "Ошибка" Тогда
		Возврат 11;	
	КонецЕсли;
	
КонецФункции
