
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!

	// регістр Баланс Приход
	Движения.Баланс.Записывать = Истина;
	Для Каждого ТекСтрокаОсновнаяИнформация Из ОсновнаяИнформация Цикл
		Если ТекСтрокаОсновнаяИнформация.Статья.ДенежноеДвижение = Перечисления.ТипДенежногоДвижения.ПриходныйКассовыйОрдер ИЛИ
			ТекСтрокаОсновнаяИнформация.Статья.ДенежноеДвижение = Перечисления.ТипДенежногоДвижения.РасходныйКассовыйОрдер Тогда
			Если ТекСтрокаОсновнаяИнформация.Сумма > 0 Тогда
				Движение = Движения.Баланс.Добавить();
				Если ТекСтрокаОсновнаяИнформация.Статья.ДенежноеДвижение = Перечисления.ТипДенежногоДвижения.ПриходныйКассовыйОрдер Тогда
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				ИначеЕсли ТекСтрокаОсновнаяИнформация.Статья.ДенежноеДвижение = Перечисления.ТипДенежногоДвижения.РасходныйКассовыйОрдер Тогда
						Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				КонецЕсли;
				Движение.Период = Дата;
				Движение.Заведение = Заведение;
				Движение.Сумма = ТекСтрокаОсновнаяИнформация.Сумма;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	// регістр Баланс Расход
	Движения.Баланс.Записывать = Истина;
	Для Каждого ТекСтрокаРасходы Из Расходы Цикл
		Если ТекСтрокаРасходы.Сумма > 0 Тогда
			Движение = Движения.Баланс.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Заведение = Заведение;
			Движение.Сумма = ТекСтрокаРасходы.Сумма;
		КонецЕсли;
	КонецЦикла;

	// регістр Баланс Накладные
	Движения.Баланс.Записывать = Истина;
	Для Каждого ТекСтрокаНакладные Из Накладные Цикл
		Если ТекСтрокаНакладные.Сумма >  0 Тогда
			Если ТекСтрокаНакладные.Оплачено = Истина Тогда 
				Движение = Движения.Баланс.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Заведение = Заведение;
				Движение.Сумма = ТекСтрокаНакладные.Сумма;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// регістр Баланс Зарплаты
	Движения.Баланс.Записывать = Истина;
	Для Каждого ТекСтрокаНакладные Из Зарплаты Цикл
		Если ТекСтрокаНакладные.Сумма >  0 Тогда
			Если ТекСтрокаНакладные.Выдана = Истина Тогда
				Движение = Движения.Баланс.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Заведение = Заведение;
				Движение.Сумма = ТекСтрокаНакладные.Сумма;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	// регістр Баланс ДолговыеНакладные
	Движения.Баланс.Записывать = Истина;
	Для Каждого ТекСтрокаНакладные Из ДолговыеНакладные Цикл
		Если ТекСтрокаНакладные.Оплачен = Истина Тогда
			Движение = Движения.Баланс.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Заведение = Заведение;
			Движение.Сумма = ТекСтрокаНакладные.Сумма;
		КонецЕсли;
	КонецЦикла;

	// регістр Баланс ЗадолжностиЗакупщика

	Движения.Баланс.Записывать = Истина;
	Для Каждого ТекСтрокаНакладные Из ЗадолжнотиЗакупщика Цикл
		Если ТекСтрокаНакладные.Сумма > 0 Тогда
			Движение = Движения.Баланс.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Заведение = Заведение;
			Движение.Сумма = ТекСтрокаНакладные.Сумма;
		КонецЕсли;
	КонецЦикла;

	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
