
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Электронно = Ложь;     
	Параметры.Свойство("ЧекКоррекции", ЧекКоррекции)
	
КонецПроцедуры

&НаКлиенте
Процедура ПоSMSПриИзменении(Элемент)
	
	Элементы.ПокупательНомер.Доступность = ПоSMS;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоEMailПриИзменении(Элемент)
	
	Элементы.ПокупательПочта.Доступность = ПоEMail;
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацияПродолжить(Команда)
	
	РезультатВыполнения = Новый Структура();
	РезультатВыполнения.Вставить("Электронно"  , Электронно);      
	РезультатВыполнения.Вставить("ЧекКоррекции", ЧекКоррекции);
	РезультатВыполнения.Вставить("ОтправлятьEmailСредствами1С", ОтправлятьEmailСредствами1С);
	РезультатВыполнения.Вставить("ОтправлятьSMSСредствами1С"  , ОтправлятьSMSСредствами1С);
	РезультатВыполнения.Вставить("ПокупательEmail", ПокупательПочта);
	РезультатВыполнения.Вставить("ПокупательНомер", ПокупательНомер);
	
	Закрыть(РезультатВыполнения); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацияОтмена(Команда)
	
	Закрыть(Неопределено); 
	
КонецПроцедуры
