Процедура ЗаписьСеанса() Экспорт 

	Сеанс = РегистрыСведений.СеансыПользователей.СоздатьНаборЗаписей();
	Сеанс.Записывать = Истина;
	НовыйСеанс = Сеанс.Добавить();
	
	НовыйСеанс.Пользователь = Константы.ПользовательПоУмолчанию.Получить();
	НовыйСеанс.Сеанс = НомерСоединенияИнформационнойБазы();

	//НовыйСеанс.Сеанс = НомерСоединенияИнформационнойБазы();
	Сеанс.Записать();

КонецПроцедуры

Процедура ЗаписьАтрибута_В_Регистр(Задача, Атрибут, Значение, Автор) Экспорт 

	Запись = РегистрыСведений.АтрибутыЗадачи.СоздатьМенеджерЗаписи();
    Запись.Период = ТекущаяДата();
    Запись.Задача = Задача;
    Запись.Атрибут = Атрибут;
    Запись.Значение = Значение;
    Запись.Автор = Автор;

    Попытка
        Запись.Записать(Истина);
		Сообщить("Атрибут успешно обновлен " + Строка(Атрибут)); 
    Исключение
        Сообщить("Ошибка при записи в регистр сведений: " + ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры

Процедура ЗаписьРодителя_В_Регистр(Задача, Родитель, Автор) Экспорт 

	Запись = РегистрыСведений.РодительЗадачи.СоздатьМенеджерЗаписи();
    Запись.Период = ТекущаяДата();
    Запись.Задача = Задача;
    Запись.Родитель = Родитель;
    Запись.Автор = Автор;

    Попытка
        Запись.Записать(Истина);
		Сообщить("Родитель задачи успешно обновлен!");
    Исключение
        Сообщить("Ошибка при записи в родителя Задачи: " + ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры

Процедура ЗаписьВидаЗадачи_В_Регистр(Задача, Значение, Автор) Экспорт 

	Запись = РегистрыСведений.КласификацияЗаписей.СоздатьМенеджерЗаписи();
    Запись.Период = ТекущаяДата();
	Запись.Задача = Задача;
	Запись.Значение = Значение;
    Запись.Автор = Автор;

    Попытка
        Запись.Записать(Истина);
		Сообщить("Вид задачи успешно обновлен ");

    Исключение
        Сообщить("Ошибка при записи в регистр сведений: " + ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры

Процедура ЗаписьАтрибутаОборудования_В_Регистр(Оборудование, ХарактеристикаДанных, Значение, Автор) Экспорт 

	Запись = РегистрыСведений.АтрибутыОборудования.СоздатьМенеджерЗаписи();
    Запись.Период = ТекущаяДата();
    Запись.Оборудование = Оборудование;
    Запись.ХарактеристикаДанных = ХарактеристикаДанных;
    Запись.Значение = Значение;
    Запись.Автор = Автор;

    Попытка
        Запись.Записать(Истина);
		Сообщить("Атрибут оборудования успешно обновлен " + Строка(ХарактеристикаДанных)); 
    Исключение
        Сообщить("Ошибка при записи в регистр сведений: " + ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры

