
&НаСервере
Функция ЗаполнениеИнформацииПоЗП()
	Объект.Зарплаты.Очистить();
	Отчет = Документы.ДневнойОтчет.Выбрать(Объект.ДатаНач,Объект.ДатаКон);
	Пока Отчет.Следующий() Цикл
		Если Отчет.Заведение = Перечисления.Заведение.ПицерияЗаболотного Тогда
			ИнфоЗП = Объект.Зарплаты.Добавить();
			ИнфоЗП.Дата = Отчет.ДатаСмены;
			Для Каждого Выборка Из Отчет.Зарплаты Цикл
				Если Выборка.Сотрудник.Наименование = "Мангал" Тогда
					ИнфоЗП.Мангал = Выборка.Сумма;				
				ИначеЕсли Выборка.Сотрудник.Наименование = "Сушист" Тогда
					ИнфоЗП.Сушист = Выборка.Сумма;
				ИначеЕсли Выборка.Сотрудник.Наименование = "Упаковщик" Тогда
					ИнфоЗП.Упаковщик = Выборка.Сумма;
				ИначеЕсли Выборка.Сотрудник.Наименование = "Заготовщик" Тогда
					ИнфоЗП.Заготовщик = Выборка.Сумма;
				ИначеЕсли Выборка.Сотрудник.Наименование = "Уборка" Тогда
					ИнфоЗП.Уборка = Выборка.Сумма;
				ИначеЕсли Выборка.Сотрудник.Наименование = "Пиццеола" Тогда
					ИнфоЗП.Пицеола = Выборка.Сумма;
				ИначеЕсли Выборка.Сотрудник.Наименование = "Продавец" Тогда
					ИнфоЗП.Продавец = Выборка.Сумма;
				КонецЕсли;
			КонецЦикла;
	
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаСервере
Функция ЗаполнениеИнформацииПоЗакупщику()
	Объект.ЗакупкиЗакупщика.Очистить();
	Отчет = Документы.ДневнойОтчет.Выбрать(Объект.ДатаНач,Объект.ДатаКон);
	Пока Отчет.Следующий() Цикл
		Если Отчет.Заведение = Перечисления.Заведение.ПицерияЗаболотного Тогда
			
			Для Каждого Выборка Из Отчет.ЗадолжнотиЗакупщика Цикл
				Если Выборка.ТекущаяЗакупка = Истина Тогда 
					ИнфоЗакуп = Объект.ЗакупкиЗакупщика.Добавить();
					ИнфоЗакуп.Дата = Отчет.ДатаСмены;
					ИнфоЗакуп.СуммаЗакупки = Выборка.СуммаТекущейЗакупки;
					ИнфоЗакуп.Оплачено = Выборка.Сумма; 
					ИнфоЗакуп.Задолжность = Выборка.Неоплачено; 
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ЗаполнениеОбщихСведений()
	Объект.ОбщиеСведенья.Очистить();
	Отчет = Документы.ДневнойОтчет.Выбрать(Объект.ДатаНач,Объект.ДатаКон);
	Пока Отчет.Следующий() Цикл
		Если Отчет.Заведение = Перечисления.Заведение.ПицерияЗаболотного Тогда
			ОбщИнф = Объект.ОбщиеСведенья.Добавить();
			ОбщИнф.Дата = Отчет.ДатаСмены;
			//касса
			Для Каждого Выборка Из Отчет.ОсновнаяИнформация Цикл
				Если Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.ОбщаяКасса Тогда
					ОбщИнф.Касса = Выборка.Сумма;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			//терминал
			Для Каждого Выборка Из Отчет.Расходы Цикл
				Если Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.Терминал Тогда
					ОбщИнф.Терминал = Выборка.Сумма;	
				КонецЕсли;
			КонецЦикла;
			//расходы (зп,закупки)
			СуммаЗП = Отчет.Зарплаты.Итог("Сумма");
			СуммаЗакупки = Отчет.Накладные.Итог("Сумма");
			ОбщИнф.Расходы = СуммаЗП + СуммаЗакупки;
			//остаток
			Остаток = ОбщИнф.Касса - ОбщИнф.Терминал - ОбщИнф.Расходы;
			ОбщИнф.Остаток = Остаток;
			ОбщИнф.ЗП = СуммаЗП;
			ОбщИнф.Закупка = СуммаЗакупки;
			ОбщИнф.Прибыль = ОбщИнф.Касса - ОбщИнф.Расходы;

		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ЗаполнениеИнформацииПоПоставщикам()
	Объект.Поставщики.Очистить();
	Отчет = Документы.ДневнойОтчет.Выбрать(Объект.ДатаНач,Объект.ДатаКон);
	Пока Отчет.Следующий() Цикл
		Если Отчет.Заведение = Перечисления.Заведение.ПицерияЗаболотного Тогда
			
			Для Каждого Выборка Из Отчет.Накладные Цикл
				Если Выборка.Сумма > 0 Тогда
					Если Выборка.Закупщик = Ложь Тогда
						Если Выборка.Оплачено = Ложь Тогда
							Накладная = Объект.Поставщики.Добавить();
							Накладная.Дата = Отчет.ДатаСмены;
							Накладная.Поставщик = Выборка.Поставщик; 
							Накладная.Сумма = Выборка.Сумма;
							Если Выборка.Оплачено = Истина Тогда
								Накладная.Оплачено = Выборка.Сумма; 
							Иначе
								Накладная.Задолжность = Выборка.Сумма; 
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				 КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
КонецФункции


&НаСервере
Процедура СформироватьНаСервере()
	//заполнение зарплат
	ЗаполнениеИнформацииПоЗП();
	//заполнение закупщика
	ЗаполнениеИнформацииПоЗакупщику();	
	//заполнение накладных
	ЗаполнениеИнформацииПоПоставщикам();		
	//заполнение общих сведений
	ЗаполнениеОбщихСведений();
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
