// Модуль управляемого приложения

Перем глДрайверСканера Экспорт;
Перем глКэшДрайверовККТ Экспорт;

Процедура ПриНачалеРаботыСистемы()
	
	глКэшДрайверовККТ = Новый Соответствие;
	
	// ЗАПУСКАЕМ асинхронное подключение.
	// Результат будет обработан внутри МенеджерОборудования, 
	// и он сам установит значение глДрайверСканера.
	МенеджерОборудования.ПодключитьСканер();
	
КонецПроцедуры

Процедура ПриЗавершенииРаботыСистемы()
	
	Если глДрайверСканера <> Неопределено Тогда
		Попытка
			глДрайверСканера.DeviceEnabled = Ложь;
			глДрайверСканера = Неопределено;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Для Каждого ЭлементКэша Из глКэшДрайверовККТ Цикл
		Попытка
			Драйвер = ЭлементКэша.Значение;
			Драйвер.DeviceEnabled = Ложь;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры