Процедура СозданиеДокументаПодтверждения(СсылкаНаНакладную, ДатаДок) Экспорт 

	Док = Документы.ПодтверждениеДокумента.СоздатьДокумент();
	Док.Дата = ДатаДок;
	Док.СсылкаНаНакладную = СсылкаНаНакладную;
	Док.Записать(РежимЗаписиДокумента.Запись);

КонецПроцедуры

Функция СсылкаДокПодтверждения(СсылкаНаНакладную) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодтверждениеДокумента.СсылкаНаНакладную КАК СсылкаНаНакладную,
		|	ПодтверждениеДокумента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПодтверждениеДокумента КАК ПодтверждениеДокумента
		|ГДЕ
		|	ПодтверждениеДокумента.СсылкаНаНакладную = &СсылкаНаНакладную";
	
	Запрос.УстановитьПараметр("СсылкаНаНакладную", СсылкаНаНакладную);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции // СсылкаДокПодтверждения()

Функция ДатаПолученияДок(СсылкаНаПН) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодтверждениеДокумента.Ссылка КАК Ссылка,
		|	ПодтверждениеДокумента.Дата КАК Дата,
		|	ПодтверждениеДокумента.СсылкаНаНакладную КАК СсылкаНаНакладную
		|ИЗ
		|	Документ.ПодтверждениеДокумента КАК ПодтверждениеДокумента
		|ГДЕ
		|	ПодтверждениеДокумента.СсылкаНаНакладную = &СсылкаНаНакладную";
	
	Запрос.УстановитьПараметр("СсылкаНаНакладную", СсылкаНаПН);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Дата;
	КонецЦикла;
	
	
	Возврат Неопределено;

КонецФункции // ДатаПолученияДок()

