Функция ФорматированиеНазвания(Фраза) Экспорт
	НоваяФраза = СтрЗаменить(Фраза,"i","і");
	НоваяФраза = СтрЗаменить(НоваяФраза,"I","І");	
	НоваяФраза = СокрЛП(НоваяФраза);
	
	Возврат НоваяФраза;

КонецФункции

// Функция собирает строку из элементов массива, разделенных запятой
Функция МассивВСтроку(МассивЭлементы) Экспорт
    
    Если ТипЗнч(МассивЭлементы) <> Тип("Массив") Тогда
        Возврат "";
    КонецЕсли;
    
    СтрокаРезультат = "";
    
    Для Каждого Элемент Из МассивЭлементы Цикл
        Если ЗначениеЗаполнено(СтрокаРезультат) Тогда
            СтрокаРезультат = СтрокаРезультат + ", ";
        КонецЕсли;
        СтрокаРезультат = СтрокаРезультат + Строка(Элемент);
    КонецЦикла;
    
    Возврат СтрокаРезультат;
    
КонецФункции