#Область ОбработчикиСобытийФормы

&НаКлиенте
Асинх Процедура ПриОткрытии(Отказ)
	
	РезультатОперации = Ждать HttpBridgeКлиент.ВерсияАсинх();
	Если РезультатОперации.Результат Тогда
		Версия = РезультатОперации.Версия;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура Put(Команда)
	
	Если ТелоКакДвоичныеДанные Тогда
		ТелоДляПередачи = ПолучитьДвоичныеДанныеИзСтроки(Тело, "utf-8");
	Иначе
		ТелоДляПередачи = Строка(Тело);
	КонецЕсли;
	
	Результат = Ждать HttpBridgeКлиент.PutАсинх(Адрес, ТелоДляПередачи, ЗаголовкиЗапроса());
	Если Не Результат.Результат Тогда       
		Сообщить(Результат.ОписаниеОшибки);
	КонецЕсли;
	КодОтвета = Результат.КодОтвета;
	Ответ = Результат.Ответ;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Get(Команда)
	
	Результат = Ждать HttpBridgeКлиент.GetАсинх(Адрес, ЗаголовкиЗапроса());
	Если Не Результат.Результат Тогда       
		Сообщить(Результат.ОписаниеОшибки);
	КонецЕсли;
	КодОтвета = Результат.КодОтвета;
	Ответ = Результат.Ответ;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Post(Команда)
	
	Если ТелоКакДвоичныеДанные Тогда
		ТелоДляПередачи = ПолучитьДвоичныеДанныеИзСтроки(Тело, "utf-8");
	Иначе
		ТелоДляПередачи = Строка(Тело);
	КонецЕсли;
	
	Результат = Ждать HttpBridgeКлиент.PostАсинх(Адрес, ТелоДляПередачи, ЗаголовкиЗапроса());
	Если Не Результат.Результат Тогда
		Сообщить(Результат.ОписаниеОшибки);
	КонецЕсли;
	КодОтвета = Результат.КодОтвета;
	Ответ = Результат.Ответ;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Delete(Команда)
	
	Результат = Ждать HttpBridgeКлиент.DeleteАсинх(Адрес, ЗаголовкиЗапроса());
	Если Не Результат.Результат Тогда
		Сообщить(Результат.ОписаниеОшибки);
	КонецЕсли;
	КодОтвета = Результат.КодОтвета;
	Ответ = Результат.Ответ;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ЗаголовкиЗапроса()
	
	Результат = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из Заголовки Цикл
		Результат.Вставить(СтрокаТаблицы.Имя, СтрокаТаблицы.Значение);
	КонецЦикла;   
	
	Возврат Результат;
	
КонецФункции
