#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьДанныеЧека(Ссылка, ИдентификаторУстройства = Неопределено) Экспорт;
	
	Объект = Ссылка.ПолучитьОбъект();
	
	// Подготовка соответствие секций для табличной части.
	ТаблицаТоваровСоответствииСекциям = Новый Соответствие();
	
	// Общие параметры чека
	ОбщиеПараметры = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииЧекаКоррекции(); 
	                                                                                                      
	ОбщиеПараметры.ДокументОснование = Объект.Ссылка;  
	ОбщиеПараметры.ИдентификаторФискальнойЗаписи = XMLСтрока(Объект.Ссылка);
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		НомерСекции = ТаблицаТоваровСоответствииСекциям.Получить(СтрокаТЧ.НомерСтроки);
		СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека();
		СтрокаПозицииЧека.ПризнакСпособаРасчета  = СтрокаТЧ.СпособРасчета;
		СтрокаПозицииЧека.ПризнакПредметаРасчета = СтрокаТЧ.ПредметРасчета;
		СтрокаПозицииЧека.Наименование = Строка(СтрокаТЧ.Номенклатура);
		СтрокаПозицииЧека.Количество   = СтрокаТЧ.Количество;
		СтрокаПозицииЧека.Цена = СтрокаТЧ.Цена;
		СтрокаПозицииЧека.Сумма = СтрокаТЧ.Сумма;
		СтрокаПозицииЧека.НомерСекции = НомерСекции;
		СтрокаПозицииЧека.СуммаСкидок = СтрокаТЧ.СуммаРучнойСкидки;
		СтрокаПозицииЧека.СтавкаНДС = _ДемоПодключаемоеОборудованиеВызовСервера.ВернутьСтавкуНДС(СтрокаТЧ.СтавкаНДС);
		СтрокаПозицииЧека.НомерСтрокиТовара = СтрокаТЧ.НомерСтроки;
		СтрокаПозицииЧека.СуммаНДС = СтрокаТЧ.СуммаНДС;      
		СтрокаПозицииЧека.ЕдиницаИзмерения = "Штука";
		СтрокаПозицииЧека.Штрихкод = СтрокаТЧ.Штрихкод;
		СтрокаПозицииЧека.ДанныеКодаТоварнойНоменклатуры.РеквизитКодаТовара = СтрокаТЧ.РеквизитКодаТовара;
		
		СтрокаПозицииЧека.ПризнакАгентаПоПредметуРасчета = СтрокаТЧ.Номенклатура.ПризнакАгента;
		СтрокаПозицииЧека.ДанныеПоставщика.Телефон       = СтрокаТЧ.Номенклатура.ДанныеПоставщикаТелефон;
		СтрокаПозицииЧека.ДанныеПоставщика.Наименование  = СтрокаТЧ.Номенклатура.ДанныеПоставщикаНаименование;
		СтрокаПозицииЧека.ДанныеПоставщика.ИНН           = СтрокаТЧ.Номенклатура.ДанныеПоставщикаИНН;
		СтрокаПозицииЧека.ДанныеАгента.ПлатежныйАгент.Операция = СтрокаТЧ.Номенклатура.ПлатежныйАгентОперация;
		СтрокаПозицииЧека.ДанныеАгента.ПлатежныйАгент.Телефон  = СтрокаТЧ.Номенклатура.ПлатежныйАгентТелефон;
		СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.Телефон      = СтрокаТЧ.Номенклатура.ОператорПереводаТелефон;
		СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.Наименование = СтрокаТЧ.Номенклатура.ОператорПереводаНаименование;
		СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.Адрес        = СтрокаТЧ.Номенклатура.ОператорПереводаАдрес;
		СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.ИНН          = СтрокаТЧ.Номенклатура.ОператорПереводаИНН;
		СтрокаПозицииЧека.ДанныеАгента.ОператорПоПриемуПлатежей.Телефон = СтрокаТЧ.Номенклатура.ОператорПоПриемуПлатежейТелефон;
		
		СтрокаПозицииЧека.КодСтраныПроисхожденияТовара = СтрокаТЧ.КодСтраныПроисхожденияТовара;
		СтрокаПозицииЧека.НомерТаможеннойДекларации    = СтрокаТЧ.НомерТаможеннойДекларации;
		СтрокаПозицииЧека.СуммаАкциза                  = СтрокаТЧ.СуммаАкциза;
		СтрокаПозицииЧека.ДополнительныйРеквизит       = СтрокаТЧ.ДополнительныйРеквизит;
		
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	КонецЦикла;
	
	// Подготовка таблицы оплат
	Для Каждого СтрокаТО Из Объект.Оплата Цикл
		СтрокаОплаты  = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
		СтрокаОплаты.ТипОплаты = СтрокаТО.ВидОплаты;
		СтрокаОплаты.Сумма = СтрокаТО.СуммаОплаты;
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	КонецЦикла;
	//
	ОбщиеПараметры.ПризнакАгента = Объект.ПризнакАгента;
	ОбщиеПараметры.ДанныеПоставщика.Телефон       = Объект.ДанныеПоставщикаТелефон;
	ОбщиеПараметры.ДанныеПоставщика.Наименование  = Объект.ДанныеПоставщикаНаименование;
	ОбщиеПараметры.ДанныеПоставщика.ИНН           = Объект.ДанныеПоставщикаИНН;
	ОбщиеПараметры.ДанныеАгента.ПлатежныйАгент.Операция = Объект.ПлатежныйАгентОперация;
	ОбщиеПараметры.ДанныеАгента.ПлатежныйАгент.Телефон  = Объект.ПлатежныйАгентТелефон;
	ОбщиеПараметры.ДанныеАгента.ОператорПеревода.Телефон      = Объект.ОператорПереводаТелефон;
	ОбщиеПараметры.ДанныеАгента.ОператорПеревода.Наименование = Объект.ОператорПереводаНаименование;
	ОбщиеПараметры.ДанныеАгента.ОператорПеревода.Адрес        = Объект.ОператорПереводаАдрес;
	ОбщиеПараметры.ДанныеАгента.ОператорПеревода.ИНН          = Объект.ОператорПереводаИНН;
	ОбщиеПараметры.ДанныеАгента.ОператорПоПриемуПлатежей.Телефон = Объект.ОператорПоПриемуПлатежейТелефон;
	
	// Общие реквизиты для всех типов оборудования.
	ОбщиеПараметры.ТипРасчета          = Объект.ТипОперации;
	ОбщиеПараметры.Кассир              = СокрЛП(Объект.Кассир);
	ОбщиеПараметры.КассирИНН           = СокрЛП(Объект.КассирИНН);
	
	ОбщиеПараметры.ОрганизацияНазвание = Объект.Организация;
	ОбщиеПараметры.ОрганизацияИНН      = "0000000000";
	ОбщиеПараметры.ОрганизацияКПП      = "234523454542";

	Если Не ПустаяСтрока(Объект.Клиент) Тогда
		ОбщиеПараметры.СведенияОПокупателе.Покупатель    = Строка(Объект.Клиент);
		ОбщиеПараметры.СведенияОПокупателе.ПокупательИНН = Объект.Клиент.ИНН;
	КонецЕсли;
	
	//ОбщиеПараметры.АдресРасчетов       = "г.Москва, Дмитровское ш. д.9";
	//ОбщиеПараметры.МестоРасчетов       = "Северное крыло, комната 9441";
	
	// Параметры необходимые для чека ЕНВД на принтере чеков
	ОбщиеПараметры.НомерКассы = "3463345";
	ОбщиеПараметры.НомерЧека  = Объект.Номер;
	ОбщиеПараметры.НомерСмены = 1;
	// Новые параметры для ККТ по ФЗ-54
	ОбщиеПараметры.ОтправительEmail  = "info@1c.ru";
	ОбщиеПараметры.Электронно = Ложь;
	
	ОбщиеПараметры.СистемаНалогообложения = Объект.СистемаНалогообложения;
	
	ОбщиеПараметры.ДанныеКоррекции.ТипКоррекции      = Объект.ТипКоррекции;
	ОбщиеПараметры.ДанныеКоррекции.ОписаниеКоррекции = Объект.ОписаниеКоррекции;
	ОбщиеПараметры.ДанныеКоррекции.ДатаКоррекции     = Объект.ДатаКоррекции;
	ОбщиеПараметры.ДанныеКоррекции.НомерПредписания  = Объект.НомерПредписания;
	
	ОбщиеПараметры.ДополнительныйРеквизит = Объект.ДополнительныйРеквизит;
	ОбщиеПараметры.ДополнительныйРеквизитПользователя.Наименование = Объект.РеквизитПользователяНаименование;
	ОбщиеПараметры.ДополнительныйРеквизитПользователя.Значение = Объект.РеквизитПользователяЗначение;
	
	Если ИдентификаторУстройства <> Неопределено Тогда
		МодульФорматноЛогическийКонтроль = ОбщегоНазначенияБПО.ОбщийМодуль("ФорматноЛогическийКонтроль");
		РеквизитыОборудования  = МодульФорматноЛогическийКонтроль.СтруктураДанныхФорматноЛогическогоКонтроля(ИдентификаторУстройства);
		ОбщиеПараметры.СпособФорматноЛогическогоКонтроля = РеквизитыОборудования.СпособФорматноЛогическогоКонтроля;
		ОбщиеПараметры.ДопустимоеРасхождениеФорматноЛогическогоКонтроля = РеквизитыОборудования.ДопустимоеРасхождениеФорматноЛогическогоКонтроля;
	Иначе
		ОбщиеПараметры.СпособФорматноЛогическогоКонтроля = Перечисления.СпособыФорматноЛогическогоКонтроля.РазделятьСтроки;
	КонецЕсли;
	
	Возврат ОбщиеПараметры;
	
КонецФункции

#КонецЕсли