
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка._ДемоЧек") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Чек.ТипОперации,
		|	Чек.Кассир,
		|	Чек.Клиент,
		|	Чек.Организация,
		|	Чек.Сдача,
		|	Чек.СуммаБезСкидки,
		|	Чек.СуммаДокумента,
		|	Чек.СуммаНДС,
		|	Чек.СуммаОплаты,
		|	Чек.СуммаСкидки,
		|	Чек.Товары,
		|	Чек.Оплата
		|ИЗ
		|	Документ._ДемоЧек КАК Чек
		|ГДЕ
		|	Чек.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения.Ссылка);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			ТипОперации = Выборка.ТипОперации;
			Кассир = Выборка.Кассир;
			Клиент = Выборка.Клиент;
			Организация = Выборка.Организация;
			Сдача = Выборка.Сдача;
			СуммаБезСкидки = Выборка.СуммаБезСкидки;
			СуммаДокумента = Выборка.СуммаДокумента;
			СуммаНДС = Выборка.СуммаНДС;
			СуммаОплаты = Выборка.СуммаОплаты;
			СуммаСкидки = Выборка.СуммаСкидки;
			Товары.Загрузить(Выборка.Товары.Выгрузить());
			Оплата.Загрузить(Выборка.Оплата.Выгрузить());
		КонецЕсли;
		Дата = ТекущаяДатаСеанса();
		
	КонецЕсли;
	
	СпособФорматноЛогическогоКонтроля = Перечисления.СпособыФорматноЛогическогоКонтроля.НеКонтролировать;
	ДопустимоеРасхождениеФорматноЛогическогоКонтроля = 0.01;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ТаблицаЗначений") Тогда
		СтандартнаяОбработка = Ложь;
		Товары.Загрузить(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Статус = Перечисления._ДемоСтатусыЧековККМ.Отложен;
	
КонецПроцедуры

#КонецОбласти
