#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РабочееМесто = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();
	
	ККТ_КодКонтрольнойМаркиСтрока = "010406205871178521.Bb""adi,ELNkc\u001d91FFD0\u001d92dGVzdCXjohbwmtUivYwTxu8f9F4KY4yt7oWMUdlZchw=";
	
	КассирФИО = "Сидоров И.П.";
	КассирДолжность = "АДМИНИСТРАТОР";
	КассирИНН = "780100325933";
	
	ПолучательИНН = "500100732259";
	Получатель = "Пупкин В.В.";
	
	ОрганизацияИНН = "7709860400";
	ОрганизацияКПП = "770901001";
	
	ТелефонАгента = "+78005550606";
	ТелефонПоставщика = "+78002500505";
	
	СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
	
	Сумма = 100;
	ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств;

	ВремТовар = Товары.Добавить();
	СтрокаТаблицыТоваров = Новый Структура();
	ВремТовар.Наименование = "Мука пшеничная (Продукт первой необходимости)";   
	ВремТовар.Количество   = 0.992;  
	ВремТовар.Цена         = 15;
	ВремТовар.Сумма        = 13.84;  
	ВремТовар.НомерСекции  = 1;   
	ВремТовар.СтавкаНДС    = Перечисления._ДемоСтавкиНДС.НДС10;   
	ВремТовар.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	ВремТовар.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	
	ВремТовар = Товары.Добавить();
	СтрокаТаблицыТоваров = Новый Структура();
	ВремТовар.Наименование = "Томатный сок в бутылке 0.5 л";   
	ВремТовар.Количество   = 2;  
	ВремТовар.Цена         = 150;
	ВремТовар.Сумма        = 320;  
	ВремТовар.НомерСекции  = 2;   
	ВремТовар.СтавкаНДС    = Перечисления._ДемоСтавкиНДС.НДС20;;  
	ВремТовар.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	ВремТовар.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	
	ВремТовар = Товары.Добавить();
	СтрокаТаблицыТоваров = Новый Структура();
	ВремТовар.Наименование = "Пакет";   
	ВремТовар.Количество   = 1;  
	ВремТовар.Цена         = 10;
	ВремТовар.Сумма        = 10;  
	ВремТовар.НомерСекции  = 3;   
	ВремТовар.СтавкаНДС    = Перечисления._ДемоСтавкиНДС.БезНДС;  
	ВремТовар.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	ВремТовар.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	
	ВремОплата = Оплата.Добавить();
	ВремОплата.ТипОплаты = Перечисления.ТипыОплатыККТ.Наличные;
	ВремОплата.Сумма = 150;
	ВремОплата = Оплата.Добавить();
	ВремОплата.ТипОплаты = Перечисления.ТипыОплатыККТ.Электронно;
	ВремОплата.Сумма = 200;
	ВремОплата = Оплата.Добавить();
	ВремОплата.ТипОплаты = Перечисления.ТипыОплатыККТ.Предоплата;
	ВремОплата.Сумма = 0;
	ВремОплата = Оплата.Добавить();
	ВремОплата.ТипОплаты = Перечисления.ТипыОплатыККТ.Постоплата;
	ВремОплата.Сумма = 0;
	ВремОплата = Оплата.Добавить();
	ВремОплата.ТипОплаты = Перечисления.ТипыОплатыККТ.ВстречноеПредоставление;
	ВремОплата.Сумма = 0;
	
	СтрокиТекста = "Мой дядя самых честных правил,
		|Когда не в шутку занемог,
		|Он уважать себя заставил,
		|И лучше выдумать не мог;
		|Его пример другим наука:
		|Но, боже мой, какая скука
		|С больным сидеть и день, и ночь,
		|Не отходя ни шагу прочь!    
		|[cut]
		|Какое низкое коварство
		|Полуживого забавлять,
		|Ему подушки поправлять,
		|Печально подносить лекарство,
		|Вздыхать и думать про себя:
		|Когда же черт возьмет тебя!";
		
	ТипШтрихкода = "EAN13";
	ШтрихКод     = "2900001462105";
	
	ЭТСумма = 100;  
	ЭТНомерМерчанта = 0;
	
	ОписаниеКоррекции  = "Ошибка применения ККТ";
	ДокументОснованиеФП = "4208773893";
	НомерПредписания = 100;
	ДатаКоррекции = ТекущаяДата();
	
	ККТ_Количество = 1;
	ККТ_ПланируемыйСтатусТовара = Перечисления.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварРеализован;
	ККТ_МераКоличества = Перечисления.МераКоличестваПредметаРасчетаККТ.Штука;
	ККТ_ОжидатьПолучениеОтветаОИСМ = Истина;
	ККТ_БудетРеализована = Истина;
	ФФД12 = Истина;
	ТестовыеДанные = Истина;     
	ККТ_Электронно = Ложь;
	
	ПодготовитьЭлементУправления(Элементы.Оборудование);
	ПодготовитьЭлементУправления(Элементы.ОборудованиеУстройствоВвода);
	ПодготовитьЭлементУправления(Элементы.ОборудованиеПлатежнаяСистема);
	ПодготовитьЭлементУправления(Элементы.ОборудованиеПериферия);
	
	ПодготовитьЭлементУправления(Элементы.ТипРасчета);
	ПодготовитьЭлементУправления(Элементы.КассирФИО);
	ПодготовитьЭлементУправления(Элементы.КассирИНН);
	ПодготовитьЭлементУправления(Элементы.КассирДолжность);
	ПодготовитьЭлементУправления(Элементы.СистемаНалогообложения);
	ПодготовитьЭлементУправления(Элементы.Получатель);
	ПодготовитьЭлементУправления(Элементы.ПолучательИНН);
	ПодготовитьЭлементУправления(Элементы.ОрганизацияИНН);
	ПодготовитьЭлементУправления(Элементы.ОрганизацияКПП);
	ПодготовитьЭлементУправления(Элементы.ТелефонйАгента);
	ПодготовитьЭлементУправления(Элементы.ТелефонПоставщика);
	
	ПодготовитьЭлементУправления(Элементы.НомерЧека);
	ПодготовитьЭлементУправления(Элементы.Сумма);
	
	ПодготовитьЭлементУправления(Элементы.ТипШтрихкода);
	ПодготовитьЭлементУправления(Элементы.Штрихкод);
	ПодготовитьЭлементУправления(Элементы.СтрокиТекста);
	
	ПодготовитьЭлементУправления(Элементы.ЭТСумма);
	ПодготовитьЭлементУправления(Элементы.ЭТНомерЧека);
	ПодготовитьЭлементУправления(Элементы.ЭТНомерКарты);
	ПодготовитьЭлементУправления(Элементы.ЭТНомерСсылкиОперации);
	ПодготовитьЭлементУправления(Элементы.ЭТКодАвторизации);
	ПодготовитьЭлементУправления(Элементы.ЭТНомерМерчанта);
	ПодготовитьЭлементУправления(Элементы.ЭТСлипЧек);
	ПодготовитьЭлементУправления(Элементы.ДП_Текст);
	ПодготовитьЭлементУправления(Элементы.ДП_ЗначениеQRКода);
	
	ПодготовитьЭлементУправления(Элементы.НеприменениеККТ);
	ПодготовитьЭлементУправления(Элементы.ОписаниеКоррекции);
	ПодготовитьЭлементУправления(Элементы.ТипКоррекции);
	ПодготовитьЭлементУправления(Элементы.ДополнительныйРеквизит);
	ПодготовитьЭлементУправления(Элементы.ДатаКоррекции);
	ПодготовитьЭлементУправления(Элементы.НомерПредписания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ККТ_ПланируемыйСтатусТовараПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Ждать МенеджерОборудованияКлиент.ОтключениеВсегоОборудованияАсинх();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ScanData" Тогда
		Если ТипЗнч(Параметр) = Тип("Массив") Тогда
	 		Штрихкод = Параметр[0];      
		Иначе
			Штрихкод = Параметр;            
		КонецЕсли;
		ОбработатьШтрихкод(Штрихкод);
	ИначеЕсли ИмяСобытия = "Штрихкод" Или ИмяСобытия = "Barcode" Тогда
		Штрихкод = Параметр;
		ОбработатьШтрихкод(Штрихкод);
	ИначеЕсли ИмяСобытия = "RFID" Тогда
		Если Параметр <> Неопределено Тогда
			Для Каждого Элемент Из Параметр Цикл
				МеткаRFID = МеткиRFID.Добавить();
				ЗаполнитьЗначенияСвойств(МеткаRFID, Элемент);
			КонецЦикла;
		КонецЕсли;
	Иначе
		Сообщить("Данные:" + Параметр);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Асинх Процедура ОборудованиеПриИзменении(Элемент)
	
	Ждать МенеджерОборудованияКлиент.ОтключениеВсегоОборудованияАсинх();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Сумма = Окр(ТекущаяСтрока.Цена * ТекущаяСтрока.Количество, 2); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьВерсиюДрайвераУстройстваПечати(Команда)
	
	ПолучитьВерсиюДрайвера(ОборудованиеУстройстваПечати);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВерсиюДрайвераУстройстваВвода(Команда)
	
	ПолучитьВерсиюДрайвера(ОборудованиеУстройствоВвода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВерсиюДрайвераПлатежнаяСистема(Команда)
	
	ПолучитьВерсиюДрайвера(ОборудованиеПлатежнаяСистема);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыполнитьПроверкуГотовностиУстройства(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(ОборудованиеУстройстваПечати) Тогда
		ТекстСообщения = НСтр("ru = 'Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ВыполнитьПроверкуГотовностиУстройстваЗавершение", ЭтотОбъект);
		МенеджерОборудованияКлиент.НачатьТестУстройства(Оповещение, ОборудованиеУстройстваПечати);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуГотовностиУстройстваЗавершение(Результат, Контекст) Экспорт
	
	Если Результат.Результат Тогда
		ТекстСообщения = НСтр("ru = 'Устройство доступно.'");
	Иначе
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка выполнения: %1'"), Результат.ОписаниеОшибки);
	КонецЕсли;
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуГотовностиЭквайринга(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(ОборудованиеПлатежнаяСистема) Тогда
		ТекстСообщения = НСтр("ru = 'Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ВыполнитьПроверкуГотовностиУстройстваЗавершение", ЭтотОбъект);
		МенеджерОборудованияКлиент.НачатьТестУстройства(Оповещение, ОборудованиеПлатежнаяСистема);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура УВ_ПодключениеОборудование(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(ОборудованиеУстройствоВвода) Тогда
		ТекстСообщения = НСтр("ru = 'Оборудование не выбрано.'");
	Иначе
		МассивРезультат = Ждать МенеджерОборудованияКлиент.ПодключениеОборудованияАсинх(УникальныйИдентификатор, , ОборудованиеУстройствоВвода);
		Если МассивРезультат.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Ошибка подключения устройства.'");
		Иначе 
			Если МассивРезультат[0].Результат Тогда
				ТекстСообщения = НСтр("ru = 'Устройство доступно.'");
			Иначе
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка выполнения: %1'"), МассивРезультат[0].ОписаниеОшибки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура УВ_ОтключитьОборудование(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(ОборудованиеУстройствоВвода) Тогда
		ТекстСообщения = НСтр("ru = 'Оборудование не выбрано.'");
	Иначе
		МассивРезультат = Ждать МенеджерОборудованияКлиент.ОтключениеОборудованияАсинх(УникальныйИдентификатор, , ОборудованиеУстройствоВвода);
		Если МассивРезультат.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Ошибка отключения устройства.'");
		Иначе 
			Если МассивРезультат[0].Результат Тогда
				ТекстСообщения = НСтр("ru = 'Устройство отключено.'");
			Иначе
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка выполнения: %1'"), МассивРезультат[0].ОписаниеОшибки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры

&НаКлиенте
Процедура УВ_ВыборКодаВидаНоменклатурнойКлассификации(Команда)
	
	ОповещениеПриВыборе = Новый ОписаниеОповещения("УВ_ВыборКодаВидаНоменклатурнойКлассификации_Завершение", ЭтотОбъект);                                 
	МенеджерОборудованияКлиент.НачатьВыборКодаВидаНоменклатурнойКлассификации(ОповещениеПриВыборе);
	
КонецПроцедуры

&НаКлиенте
Процедура РазобратьШК(Команда)
	
	ВремДанныеСканера = СтрЗаменить(Штрихкод, "\u001d", МенеджерОборудованияМаркировкаКлиентСервер.РазделительGS1());
	ОбработатьШтрихкод(ВремДанныеСканера);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭТ_ВыполнитьОперациюЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'Операция выполнена успешно.'");
		ЭТНомерСсылкиОперации = ?(РезультатВыполнения.Свойство("СсылочныйНомер"), РезультатВыполнения.СсылочныйНомер, "");
		ЭТНомерКарты = ?(РезультатВыполнения.Свойство("НомерКарты"), РезультатВыполнения.НомерКарты, "");
		ЭТКодАвторизации = ?(РезультатВыполнения.Свойство("КодАвторизации"), РезультатВыполнения.КодАвторизации, "");     
		ЭТСлипЧек = РезультатВыполнения.ТекстСлипЧека;
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭС_Оплатить(Команда)
	
	Если ОборудованиеПлатежнаяСистема.Пустая() Тогда
		ТекстСообщения = НСтр("ru = 'ЭТ не выбран.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ПараметрыОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();  
	ПараметрыОперации.ТипТранзакции  = "AuthorizeSales";
	ПараметрыОперации.НомерМерчанта  = ЭТНомерМерчанта;
	ПараметрыОперации.СуммаОперации  = ЭТСумма;
	ПараметрыОперации.НомерЧека      = ЭТНомерЧека;
	ПараметрыОперации.СсылочныйНомер = ЭТНомерСсылкиОперации;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЭТ_ВыполнитьОперациюЗавершение", ЭтотОбъект);
	ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеОперацииНаЭквайринговомТерминале(ОписаниеОповещения, УникальныйИдентификатор, ОборудованиеПлатежнаяСистема, ПараметрыОперации); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЭС_Отменить(Команда)
	
	Если ОборудованиеПлатежнаяСистема.Пустая() Тогда
		ТекстСообщения = НСтр("ru = 'ЭТ не выбран.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ПараметрыОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();  
	ПараметрыОперации.ТипТранзакции  = "AuthorizeVoid";
	ПараметрыОперации.НомерМерчанта  = ЭТНомерМерчанта;
	ПараметрыОперации.СуммаОперации  = ЭТСумма;
	ПараметрыОперации.НомерЧека      = ЭТНомерЧека;
	ПараметрыОперации.СсылочныйНомер = ЭТНомерСсылкиОперации;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЭТ_ВыполнитьОперациюЗавершение", ЭтотОбъект);
	ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеОперацииНаЭквайринговомТерминале(ОписаниеОповещения, УникальныйИдентификатор, ОборудованиеПлатежнаяСистема, ПараметрыОперации); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЭС_Вернуть(Команда)
	Если ОборудованиеПлатежнаяСистема.Пустая() Тогда
		ТекстСообщения = НСтр("ru = 'ЭТ не выбран.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ПараметрыОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();  
	ПараметрыОперации.ТипТранзакции  = "AuthorizeRefund";
	ПараметрыОперации.НомерМерчанта  = ЭТНомерМерчанта;
	ПараметрыОперации.СуммаОперации  = ЭТСумма;
	ПараметрыОперации.НомерЧека      = ЭТНомерЧека;
	ПараметрыОперации.СсылочныйНомер = ЭТНомерСсылкиОперации;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЭТ_ВыполнитьОперациюЗавершение", ЭтотОбъект);
	ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеОперацииНаЭквайринговомТерминале(ОписаниеОповещения, УникальныйИдентификатор, ОборудованиеПлатежнаяСистема, ПараметрыОперации); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЭС_СверкаИтогов(Команда)
	
	Если ОборудованиеПлатежнаяСистема.Пустая() Тогда
		ТекстСообщения = НСтр("ru = 'ЭТ не выбран.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ПараметрыОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();  
	ПараметрыОперации.ТипТранзакции  = "Settlement";
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЭТ_ВыполнитьОперациюЗавершение", ЭтотОбъект);
	ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеОперацииНаЭквайринговомТерминале(ОписаниеОповещения, УникальныйИдентификатор, ОборудованиеПлатежнаяСистема, ПараметрыОперации); 
	
КонецПроцедуры

&НаКлиенте
Процедура ККТ_ШиринаСтроки(Команда)
	
	ФискальноеУстройство = ОборудованиеУстройстваПечати;
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолучениеШириныСтрокиПечатающегоУстройства(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство);
	
КонецПроцедуры

&НаКлиенте
Процедура ККТ_ДенежныйЯщик(Команда)
	
	ФискальноеУстройство = ОборудованиеУстройстваПечати;
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьОткрытиеДенежногоЯщика(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство);
	
КонецПроцедуры

&НаКлиенте
Процедура ККТ_ОткрытьСмену(Команда)
	
	ФискальноеУстройство = ОборудованиеУстройстваПечати;
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ККТ_ПараметрыВыполненияОперации();
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьОткрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ККТ_ЗакрытьСмену(Команда)
	
	ФискальноеУстройство = ОборудованиеУстройстваПечати;
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ККТ_ПараметрыВыполненияОперации();
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьЗакрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ККТ_ФискализацияЧека(Команда)
	
	ФискальноеУстройство = ОборудованиеУстройстваПечати;
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщиеПараметры = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека();
	
	Если ТестовыеДанные Тогда
		ЗаполнитьШаблонЧекаДоп(ОбщиеПараметры);
	Иначе
		ЗаполнитьШаблонЧека(ОбщиеПараметры, Истина);
	КонецЕсли;
	
	// Параметры для товарного чека и слип-чека ЕГАИС.
	ОбщиеПараметры.Вставить("ПодписьЕГАИС", ПодписьЕГАИС);
	ПредзаполнитьПараметрыЧека(ОбщиеПараметры);
	
	ФорматноЛогическийКонтрольКлиентСервер.ПровестиФорматноЛогическийКонтроль(ОбщиеПараметры, ОборудованиеУстройстваПечати);
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	ИсправленыОсновныеПараметры = Ложь;
	
	Если ФорматноЛогическийКонтрольВызовСервера.ВыполненаПроверкаОбязательностиИПравильностиЗаполненияТэгов(ОбщиеПараметры, ОборудованиеУстройстваПечати, ОписаниеОшибки) Тогда
		ФорматноЛогическийКонтрольКлиентСервер.ПривестиДанныеКТребуемомуФормату(ОбщиеПараметры, Отказ, ОписаниеОшибки, ИсправленыОсновныеПараметры);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Сообщить(ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ОбщиеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ККТ_ЧекКоррекции(Команда)
	
	ФискальноеУстройство = ОборудованиеУстройстваПечати;
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Если НеприменениеККТ Тогда
		// Документ с правильными реквизитами
		ОбщиеПараметры = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииЧекаКоррекции();
		ЗаполнитьШаблонЧека(ОбщиеПараметры); 
		// Заполняем параметры для коррекции
		ОбщиеПараметры.ДополнительныйРеквизит = ДокументОснованиеФП;   // Фискальный признак документа основания.
		ОбщиеПараметры.ДанныеКоррекции.ТипКоррекции      = ТипКоррекции;
		ОбщиеПараметры.ДанныеКоррекции.ОписаниеКоррекции = ОписаниеКоррекции;
		ОбщиеПараметры.ДанныеКоррекции.ДатаКоррекции     = ДатаКоррекции;
		ОбщиеПараметры.ДанныеКоррекции.НомерПредписания  = НомерПредписания;
		ОбщиеПараметры.НеприменениеККТ = НеприменениеККТ; 
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_КомандаВыполнитьЗавершение", ЭтотОбъект);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФормированиеЧекаКоррекцииНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ОбщиеПараметры);
	Иначе
		// Общие параметры для формирования чека коррекции
		
		// Документ с правильными реквизитами
		ОбщиеПараметры = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииЧекаКоррекции();
		ЗаполнитьШаблонЧека(ОбщиеПараметры); 
		ОбщиеПараметры.ДополнительныйРеквизит = ДокументОснованиеФП;   // Фискальный признак документа основания.
		ОбщиеПараметры.ДанныеКоррекции.ТипКоррекции      = ТипКоррекции;
		ОбщиеПараметры.ДанныеКоррекции.ОписаниеКоррекции = ОписаниеКоррекции;
		ОбщиеПараметры.ДанныеКоррекции.ДатаКоррекции     = ДатаКоррекции;
		ОбщиеПараметры.ДанныеКоррекции.НомерПредписания  = НомерПредписания;
		ОбщиеПараметры.НеприменениеККТ = НеприменениеККТ; 
	
		// Документ, содержащий ошибки, для которого будет сформирован чек сторно.
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_ВыполнитьФискализациюЧекаКоррекцииНаФискальномУстройствеЗавершение", ЭтотОбъект);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФормированиеЧекаКоррекцииНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ОбщиеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ККТ_ВыполнитьФискализациюЧекаКоррекцииНаФискальномУстройствеЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.Результат Тогда
		
		ФискальноеУстройство = ОборудованиеУстройстваПечати;
		
		// Документ, содержащий правильные реквизиты.
		ОбщиеПараметры = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииЧекаКоррекции();
		ЗаполнитьШаблонЧека(ОбщиеПараметры); 
		ОбщиеПараметры.ДополнительныйРеквизит = ДокументОснованиеФП;   // Фискальный признак документа основания.
		ОбщиеПараметры.ДанныеКоррекции.ТипКоррекции      = ТипКоррекции;
		ОбщиеПараметры.ДанныеКоррекции.ОписаниеКоррекции = ОписаниеКоррекции;
		ОбщиеПараметры.ДанныеКоррекции.ДатаКоррекции     = ДатаКоррекции;
		ОбщиеПараметры.ДанныеКоррекции.НомерПредписания  = НомерПредписания;
		ОбщиеПараметры.НеприменениеККТ = НеприменениеККТ; 
		
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_КомандаВыполнитьЗавершение", ЭтотОбъект);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ОбщиеПараметры);
		
	Иначе
		ККТ_КомандаВыполнитьЗавершение(Результат, Параметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ККТ_ВнестиСумму(Команда)
	
	ФискальноеУстройство = ОборудованиеУстройстваПечати;
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыИнкассации();
	ПараметрыОперации.ТипИнкассации = 1;
	ПараметрыОперации.Сумма = Сумма;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьИнкассациюНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ККТ_ИзъятьСумму(Команда)
	
	ФискальноеУстройство = ОборудованиеУстройстваПечати;
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыИнкассации();
	ПараметрыОперации.ТипИнкассации = 0;
	ПараметрыОперации.Сумма = Сумма;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьИнкассациюНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ККТ_ПечатьТекста(Команда)
	
	ФискальноеУстройство = ОборудованиеУстройстваПечати;
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПечатиТекста(СтрокиТекста);
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_КомандаВыполнитьЗавершение", ЭтотОбъект, Параметры);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПечатьТекста(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации); 
	
КонецПроцедуры

&НаКлиенте
Процедура ККТ_ОтчетОТекущемСостоянииРасчетов(Команда)
	
	ФискальноеУстройство = ОборудованиеУстройстваПечати;
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ККТ_ПараметрыВыполненияОперации();
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФормированиеОтчетаОТекущемСостоянииРасчетов(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации);

КонецПроцедуры

&НаКлиенте
Процедура ККТ_ОтчетБезГашения(Команда)
	
	
	ФискальноеУстройство = ОборудованиеУстройстваПечати;
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ККТ_ПараметрыВыполненияОперации();
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФормированиеОтчетаБезГашения(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ККТ_ПараметрыККТ(Команда)
	
	
	ФискальноеУстройство = ОборудованиеУстройстваПечати;
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_ПараметрыККТЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолучениеПараметровФискальногоУстройства(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство);

КонецПроцедуры

&НаКлиенте
Процедура ККТ_ТекстЧека(Команда)
	
	ФискальноеУстройство = ОборудованиеУстройстваПечати;
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ККТ_ТекстЧекаЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолучениеШириныСтрокиПечатающегоУстройства(Оповещение, УникальныйИдентификатор, ФискальноеУстройство);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстНефискальногоЧекаНаСервере(Знач ШиринаСтроки, Знач ОбщиеПараметры)
	Шаблон = ШаблоныФискальныхДокументов.ШаблонКассовыйЧек(ШиринаСтроки, ОбщиеПараметры);
	Возврат ШаблоныФискальныхДокументов.ВывестиКакТекст(Шаблон);
КонецФункции

&НаКлиенте
Процедура ККТ_ТекстЧекаЗавершение(Результат, Параметры) Экспорт
	
	ШиринаСтроки = 32;
	Если Результат.Результат Тогда
		ШиринаСтроки = Результат.ШиринаСтроки;
	КонецЕсли;
	
	ОбщиеПараметры = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека();
	ЗаполнитьШаблонЧека(ОбщиеПараметры, Истина);
	ПредзаполнитьПараметрыЧека(ОбщиеПараметры);
	
	ФорматноЛогическийКонтрольКлиентСервер.ПровестиФорматноЛогическийКонтроль(ОбщиеПараметры, ОборудованиеУстройстваПечати);
	
	Текст = ТекстНефискальногоЧекаНаСервере(ШиринаСтроки, ОбщиеПараметры);
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПечатиТекста(Текст);
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПечатьТекста(ОповещениеПриЗавершении, УникальныйИдентификатор, ОборудованиеУстройстваПечати, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ККТ_ТекстИнфоЧека(Команда)
	
	ФискальноеУстройство = ОборудованиеУстройстваПечати;
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ККТ_ТекстИнфоЧекаЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолучениеШириныСтрокиПечатающегоУстройства(Оповещение, УникальныйИдентификатор, ФискальноеУстройство);
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ТекстИнфоЧекаНаСервере(Знач ШиринаСтроки, Знач ОбщиеПараметры)
	Шаблон = ШаблоныФискальныхДокументов.ШаблонИнфоКвитанция(ШиринаСтроки, ОбщиеПараметры);
	Возврат ШаблоныФискальныхДокументов.ВывестиКакТекст(Шаблон);
КонецФункции

&НаКлиенте
Процедура ККТ_ТекстИнфоЧекаЗавершение(Результат, Параметры) Экспорт
	
	ШиринаСтроки = 32;
	Если Результат.Результат Тогда
		ШиринаСтроки = Результат.ШиринаСтроки;
	КонецЕсли;
	
	ОбщиеПараметры = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека();
	ЗаполнитьШаблонЧека(ОбщиеПараметры, Истина);
	ПредзаполнитьПараметрыЧека(ОбщиеПараметры);
	
	ФорматноЛогическийКонтрольКлиентСервер.ПровестиФорматноЛогическийКонтроль(ОбщиеПараметры, ОборудованиеУстройстваПечати);
	
	ПараметрыШтрихкода = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыШтрихкодВСтрокеЧека("EAN13", "2900001462105");
	ОбщиеПараметры.ПозицииЧека.Добавить(ПараметрыШтрихкода);
	//Текст = МенеджерОборудованияКлиентСервер.СформироватьИнформационныйЧек(ОбщиеПараметры, ШиринаСтроки,, ПараметрыШтрихкода);
	//
	Текст = ТекстИнфоЧекаНаСервере(ШиринаСтроки, ОбщиеПараметры);
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПечатиТекста(Текст);
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПечатьТекста(ОповещениеПриЗавершении, УникальныйИдентификатор, ОборудованиеУстройстваПечати, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ККТ_ПодготовитьКМ(Команда)
	
	ККТ_КодКонтрольнойМаркиСтрока = СтрЗаменить(ККТ_КодКонтрольнойМаркиСтрока, "\u001d", МенеджерОборудованияМаркировкаКлиентСервер.РазделительGS1());
	ККТ_КодКонтрольнойМарки = МенеджерОборудованияКлиентСервер.ШтрихкодВBase64(ККТ_КодКонтрольнойМаркиСтрока);
	ККТ_КодКонтрольнойМаркиСтрока = СтрЗаменить(ККТ_КодКонтрольнойМаркиСтрока, МенеджерОборудованияМаркировкаКлиентСервер.РазделительGS1(), "\u001d");
	
КонецПроцедуры

&НаКлиенте
Процедура ККТ_ОткрытьСессиюРегистрацииКМ(Команда)
	
	ФискальноеУстройство = ОборудованиеУстройстваПечати;
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьОткрытиеСессииРегистрацииКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство);
	
КонецПроцедуры

&НаКлиенте
Процедура ККТ_ЗакрытьСессиюРегистрацииКМ(Команда)
	
	ФискальноеУстройство = ОборудованиеУстройстваПечати;
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьЗакрытииСессииРегистрацииКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство);
	
КонецПроцедуры

&НаКлиенте
Процедура ККТ_ЗапросКМ(Команда)
	
	ФискальноеУстройство = ОборудованиеУстройстваПечати;
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;

	ШтучныйТовар = ККТ_ПланируемыйСтатусТовара = ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварРеализован")
		Или ККТ_ПланируемыйСтатусТовара = ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварВозвращен");
		
	ККТ_УникальныйИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор); 
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыЗапросКМ();
	ПараметрыОперации.ИдентификаторЗапроса = ККТ_УникальныйИдентификаторЗапроса;
	Если Не ШтучныйТовар Тогда
		ПараметрыОперации.Количество = ККТ_Количество;  
		ПараметрыОперации.ДробноеКоличество.Числитель   = ККТ_ДробноеКоличествоЧислитель;     
		ПараметрыОперации.ДробноеКоличество.Знаменатель = ККТ_ДробноеКоличествоЗнаменатель;     
		ПараметрыОперации.МераКоличестваПредметаРасчета = ККТ_МераКоличества;
	КонецЕсли;
	
	ПараметрыОперации.ПланируемыйСтатусТовара = ККТ_ПланируемыйСтатусТовара;
	ПараметрыОперации.КонтрольнаяМарка = ККТ_КодКонтрольнойМарки;
	ПараметрыОперации.ОжидатьПолучениеОтветаОИСМ = ККТ_ОжидатьПолучениеОтветаОИСМ;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_КомандаВыполнитьЗавершениеКМ", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьЗапросКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации);

КонецПроцедуры

&НаКлиенте
Процедура ККТ_ПодтверждениеКМ(Команда)
	
	ФискальноеУстройство = ОборудованиеУстройстваПечати;
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПодтверждениеКМ();
	ПараметрыОперации.ИдентификаторЗапроса = ККТ_УникальныйИдентификаторЗапроса;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_КомандаВыполнитьЗавершениеКМ", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПодтверждениеКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ККТ_ПолучитьРезультатыЗапросаКМ(Команда)
	
	ФискальноеУстройство = ОборудованиеУстройстваПечати;
	Если Не ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ККТ_КомандаВыполнитьЗавершениеКМ", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолученияРезультатовЗапросаКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, ФискальноеУстройство, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ВО_КомандаВыполнитьЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru='Операция завершена.'");
		Если РезультатВыполнения.Свойство("Вес") Тогда
			Если РезультатВыполнения.Вес = 0 Тогда
				ТекстСообщения = НСтр("ru = 'Электронные весы вернули нулевой вес.'");
			Иначе
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Вес: %1'"), РезультатВыполнения.Вес);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВО_ПолучитьВесСЭлектронныхВесов(Команда)
	
	
	Если Не ЗначениеЗаполнено(ОборудованиеПериферия) Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("ВО_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеВесовоеОборудованиеКлиент.НачатьПолученияВесаСЭлектронныхВесов(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, ОборудованиеПериферия, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДП_ВыводИнформацииНаДисплейПокупателя(Команда)
	
	Если Не ЗначениеЗаполнено(ОборудованиеПериферия) Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ОборудованиеДисплеиПокупателяКлиент.ПараметрыОперацииДисплейПокупателя(ДП_Текст);
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("ВО_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеДисплеиПокупателяКлиент.НачатьВыводИнформацииНаДисплейПокупателя(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, ОборудованиеПериферия, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ДП_ВыполнитьОчисткуДисплеяПокупателя(Команда)
	
	Если Не ЗначениеЗаполнено(ОборудованиеПериферия) Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ОборудованиеДисплеиПокупателяКлиент.ПараметрыОперацииДисплейПокупателя(ДП_Текст);
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("ВО_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеДисплеиПокупателяКлиент.НачатьОчисткуДисплеяПокупателя(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, ОборудованиеПериферия);
	
КонецПроцедуры            

&НаКлиенте
Процедура ДП_ВыполнитьВыводQRКода(Команда)
	
	Если Не ЗначениеЗаполнено(ОборудованиеПериферия) Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ОборудованиеДисплеиПокупателяКлиент.ПараметрыОперацииДисплейПокупателя();   
	ПараметрыОперации.СтрокиТекста   = ДП_Текст;
	ПараметрыОперации.ЗначениеQRКода = ДП_ЗначениеQRКода;

	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("ВО_КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеДисплеиПокупателяКлиент.НачатьВыводQRКодаНаДисплейПокупателя(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, ОборудованиеПериферия, ПараметрыОперации);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьЭлементУправления(ЭлементУправления) Экспорт
	
#Если МобильноеПриложениеСервер Тогда
	СтандартнаяОбработка = Истина;
	Если СтандартнаяОбработка Тогда
		ЭлементУправления.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		ЭлементУправления.ШрифтЗаголовка = ШрифтыСтиля.МелкийШрифтТекста;
	КонецЕсли;
#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПолучитьВерсиюДрайвера(ПодключаемоеОборудование)
	
	ОчиститьСообщения();
	Если Не ЗначениеЗаполнено(ПодключаемоеОборудование) Тогда
		
		ТекстСообщения = НСтр("ru = 'Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	Иначе
		
		Оповещение = Новый ОписаниеОповещения("ПолучитьВерсиюДрайвераЗавершение", ЭтотОбъект);
		МенеджерОборудованияКлиент.НачатьПолучениеОписанияОборудования(Оповещение, ПодключаемоеОборудование);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВерсиюДрайвераЗавершение(Результат, Контекст) Экспорт
	
	Если Результат.Результат Тогда
		
		ТекстСообщения = "";
		ОписаниеДрайвера = Результат.ОписаниеДрайвера;
		Если НЕ ПустаяСтрока(ОписаниеДрайвера.РевизияИнтерфейса) Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Ревизия драйвера: %1'"), ОписаниеДрайвера.РевизияИнтерфейса) + Символы.ПС;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ОписаниеДрайвера.ВерсияДрайвера) Тогда
			ТекстСообщения = ТекстСообщения + СтрШаблон(НСтр("ru = 'Версия драйвера установленная: %1'"), ОписаниеДрайвера.ВерсияДрайвера) + Символы.ПС;
		КонецЕсли;
		
	Иначе
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка получения описания драйвера: %1'"), Результат.ОписаниеОшибки);
		
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШаблонЧекаДоп(ОбщиеПараметры)
	
	// Общие параметры чека
	ОбщиеПараметры = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииЧекаКоррекции();
	
	// Параметры установлены по умолчанию.
	ОбщиеПараметры.ТипРасчета = ТипРасчета;
	ОбщиеПараметры.Электронно = ККТ_Электронно;
	
	ОбщиеПараметры.ПокупательEmail = Неопределено;
	ОбщиеПараметры.ПокупательНомер = Неопределено;
	// Параметры необходимые для чека ЕНВД на принтере чеков
	
	ОбщиеПараметры.Кассир     = КассирФИО;
	ОбщиеПараметры.КассирИНН  = КассирИНН;
	
	ОбщиеПараметры.СистемаНалогообложения = СистемаНалогообложения;
	ОбщиеПараметры.ОрганизацияНазвание = "ООО ""1C-СОФТ""";
	ОбщиеПараметры.ОрганизацияИНН = ОрганизацияИНН;
	ОбщиеПараметры.ОрганизацияКПП = ОрганизацияКПП;
	
	ОбщиеПараметры.НомерКассы     = "00001";
	ОбщиеПараметры.НомерЧека      = "1";
	ОбщиеПараметры.НомерСмены     = "1";
	ОбщиеПараметры.АдресРасчетов  = "г.Москва, Дмитровское ш. д.9";
	ОбщиеПараметры.МестоРасчетов  = "Торговый островок на 1 этаже";
	
	ОбщиеПараметры.ОперационныйРеквизит.ДатаВремяОперации  = ТекущаяДата();
	ОбщиеПараметры.ОперационныйРеквизит.ИдентификаторОперации = 0;
	ОбщиеПараметры.ОперационныйРеквизит.ДанныеОперации = "DATA";
	
	ОбщиеПараметры.ОтраслевойРеквизит.ИдентификаторФОИВ  = "001";
	ОбщиеПараметры.ОтраслевойРеквизит.ДатаДокументаОснования = ТекущаяДата();
	ОбщиеПараметры.ОтраслевойРеквизит.НомерДокументаОснования = "2343243";
	ОбщиеПараметры.ОтраслевойРеквизит.ЗначениеРеквизита = "Ид1=Знач1&Ид2=Знач2&Ид3=Знач3";
	
	ОбщиеПараметры.СведенияОПокупателе.Покупатель =  Получатель;
	ОбщиеПараметры.СведенияОПокупателе.ПокупательИНН = ПолучательИНН;
	ОбщиеПараметры.СведенияОПокупателе.ПокупательАдрес = ОбщиеПараметры.АдресРасчетов;
	ОбщиеПараметры.ЕстьПерсональныеДанные = Истина; 
	
	Если ДанныеАгента Тогда
		ОбщиеПараметры.ПризнакАгента = Перечисления.ПризнакиАгента.Агент;
		ОбщиеПараметры.ДанныеАгента.ПлатежныйАгент.Операция = "Оплата";
		ОбщиеПараметры.ДанныеАгента.ПлатежныйАгент.Телефон = ТелефонАгента;
		ОбщиеПараметры.ДанныеАгента.ОператорПеревода.Телефон = ТелефонПоставщика;
		ОбщиеПараметры.ДанныеАгента.ОператорПеревода.Наименование = "КИВИ Банк (АО)";
		ОбщиеПараметры.ДанныеАгента.ОператорПеревода.Адрес = "117648, г.Москва, мкр.Чертаново Северное, д.1А, корп.1";
		ОбщиеПараметры.ДанныеАгента.ОператорПеревода.ИНН = ОрганизацияИНН;
		ОбщиеПараметры.ДанныеПоставщика.Телефон = ТелефонПоставщика;
		ОбщиеПараметры.ДанныеПоставщика.Наименование = Получатель;
		ОбщиеПараметры.ДанныеПоставщика.ИНН = ПолучательИНН;
	КонецЕсли;

	// Фискальная строка 1
	СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	СтрокаПозицииЧека.Наименование = "Товарная позиция";
	СтрокаПозицииЧека.Количество   = 1;
	СтрокаПозицииЧека.Цена         = 100;
	СтрокаПозицииЧека.Сумма        = СтрокаПозицииЧека.Количество * СтрокаПозицииЧека.Цена;
	СтрокаПозицииЧека.НомерСекции  = 1;
	СтрокаПозицииЧека.СтавкаНДС    = Неопределено;
	СтрокаПозицииЧека.КодЕдиницыИзмерения = "796";
	СтрокаПозицииЧека.Штрихкод = "RU-430301-AAA0020659";
	СтрокаПозицииЧека.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	СтрокаПозицииЧека.КодЕдиницыИзмерения = "796";
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
	// Нефискальная строка
	ТекстоваяСтрокаЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека();
	ТекстоваяСтрокаЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека("Для подключение оборудования к автоматизированным системам на платформе «1С:Предприятие» используется ""1С:Библиотека подключаемого оборудования"". Библиотека предоставляет набор высокоуровневых механизмов для унифицированной работы с подключаемым оборудованием. Применение данной библиотеки позволяет ускорить реализацию поддержки широкого спектра моделей подключаемого оборудования в разрабатываемых конфигурациях, а также добавить готовые функциональные блоки в уже работающие прикладные решения.");
	ТекстоваяСтрокаЧека.ПереносСтроки = Истина;
	ОбщиеПараметры.ПозицииЧека.Добавить(ТекстоваяСтрокаЧека);
	
	// Фискальная строка 2
	СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	СтрокаПозицииЧека.Наименование = "Оплата за телефон";
	СтрокаПозицииЧека.Количество   = 1;
	СтрокаПозицииЧека.Цена         = 100;
	СтрокаПозицииЧека.Сумма        = СтрокаПозицииЧека.Количество * СтрокаПозицииЧека.Цена;
	СтрокаПозицииЧека.НомерСекции  = 1;
	СтрокаПозицииЧека.СтавкаНДС    = 10;
	СтрокаПозицииЧека.СуммаНДС = РасчитатьНДС(СтрокаПозицииЧека.Сумма, СтрокаПозицииЧека.СтавкаНДС);
	СтрокаПозицииЧека.КодЕдиницыИзмерения = "796";
	
	Если ДанныеАгента Тогда
		СтрокаПозицииЧека.ДанныеАгента.ПлатежныйАгент.Операция = "Оплата";
		СтрокаПозицииЧека.ДанныеАгента.ПлатежныйАгент.Телефон = ТелефонАгента;
		СтрокаПозицииЧека.ДанныеПоставщика.Телефон = ТелефонПоставщика;
		СтрокаПозицииЧека.ДанныеПоставщика.Наименование = Получатель;
		СтрокаПозицииЧека.ДанныеПоставщика.ИНН = ПолучательИНН;
	КонецЕсли;
	
	СтрокаПозицииЧека.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.ПредоплатаПолная;
	СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Услуга;
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
	// Фискальная строка 3
	СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	СтрокаПозицииЧека.Наименование = "Другая товарная позиция c очень длинным наименование для проверки";
	СтрокаПозицииЧека.Количество   = 2;
	СтрокаПозицииЧека.Цена         = 100;
	СтрокаПозицииЧека.Сумма        = СтрокаПозицииЧека.Количество * СтрокаПозицииЧека.Цена;
	СтрокаПозицииЧека.СуммаСкидок  = 50;
	СтрокаПозицииЧека.НомерСекции  = 1;
	СтрокаПозицииЧека.КодЕдиницыИзмерения = "796";
	СтрокаПозицииЧека.СтавкаНДС  = 20;
	СтрокаПозицииЧека.СуммаНДС = РасчитатьНДС(СтрокаПозицииЧека.Сумма, СтрокаПозицииЧека.СтавкаНДС);
	СтрокаПозицииЧека.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.Аванс;
	СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
	// Фискальная строка 4
	СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	СтрокаПозицииЧека.Наименование = "Тобачная продукция";
	СтрокаПозицииЧека.Количество   = 1;
	СтрокаПозицииЧека.Цена         = 30;
	СтрокаПозицииЧека.Сумма        = СтрокаПозицииЧека.Количество * СтрокаПозицииЧека.Цена;
	СтрокаПозицииЧека.СуммаСкидок  = 0;
	СтрокаПозицииЧека.НомерСекции  = 3;
	СтрокаПозицииЧека.СтавкаНДС    = Неопределено;
	СтрокаПозицииЧека.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	СтрокаПозицииЧека.КодЕдиницыИзмерения = "796";
	
	Если Не ПустаяСтрока(ККТ_КодКонтрольнойМарки) Тогда
		КодКонтрольнойМарки = ККТ_КодКонтрольнойМарки;  
		Если ФФД12 Тогда
			СтрокаПозицииЧека.КонтрольнаяМарка = КодКонтрольнойМарки;
		Иначе
			СтрокаПозицииЧека.ШтрихкодBase64  = КодКонтрольнойМарки;
		КонецЕсли;
		
		ШтучныйТовар = ККТ_ПланируемыйСтатусТовара = ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварРеализован")
			Или ККТ_ПланируемыйСтатусТовара = ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварВозвращен");
		Если Не ШтучныйТовар Тогда
			СтрокаПозицииЧека.ДробноеКоличество.Числитель = 1; 
			СтрокаПозицииЧека.ДробноеКоличество.Знаменатель = 6;
		КонецЕсли;
	КонецЕсли;
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
	// Фискальная строка 5
	СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	СтрокаПозицииЧека.Наименование = "Яблоки на развес";
	СтрокаПозицииЧека.Количество   = 0.61;
	СтрокаПозицииЧека.Цена         = 172.5;
	СтрокаПозицииЧека.Сумма        = СтрокаПозицииЧека.Количество * СтрокаПозицииЧека.Цена;
	СтрокаПозицииЧека.НомерСекции  = 3;
	СтрокаПозицииЧека.СтавкаНДС = 20;
	СтрокаПозицииЧека.СуммаНДС = РасчитатьНДС(СтрокаПозицииЧека.Сумма, СтрокаПозицииЧека.СтавкаНДС);
	СтрокаПозицииЧека.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	СтрокаПозицииЧека.КодЕдиницыИзмерения = "166";
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
	// Фискальная строка 6
	СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	СтрокаПозицииЧека.Наименование = "Позиция с НДС 5% ";
	СтрокаПозицииЧека.Количество   = 1;
	СтрокаПозицииЧека.Цена         = 100;
	СтрокаПозицииЧека.Сумма        = СтрокаПозицииЧека.Количество * СтрокаПозицииЧека.Цена;
	СтрокаПозицииЧека.СтавкаНДС = 5;
	СтрокаПозицииЧека.СуммаНДС = РасчитатьНДС(СтрокаПозицииЧека.Сумма, СтрокаПозицииЧека.СтавкаНДС);
	СтрокаПозицииЧека.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	СтрокаПозицииЧека.КодЕдиницыИзмерения = "166";
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
	// Фискальная строка 7
	СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	СтрокаПозицииЧека.Наименование = "Позиция с НДС 7% ";
	СтрокаПозицииЧека.Количество   = 1;
	СтрокаПозицииЧека.Цена         = 200;
	СтрокаПозицииЧека.Сумма        = СтрокаПозицииЧека.Количество * СтрокаПозицииЧека.Цена;
	СтрокаПозицииЧека.СтавкаНДС = 7;
	СтрокаПозицииЧека.СуммаНДС = РасчитатьНДС(СтрокаПозицииЧека.Сумма, СтрокаПозицииЧека.СтавкаНДС);     
	СтрокаПозицииЧека.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	СтрокаПозицииЧека.КодЕдиницыИзмерения = "166";
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
	СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека("Накопление по карте: 234543443");
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);   
	
	СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека("Другая товарная позиция c очень длинным наименование для проверки");
	СтрокаПозицииЧека.ПереносСтроки = Истина;
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
	СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека("Другая f");
	СтрокаПозицииЧека.Выравнивание  = "Центр";
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
	СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыШтрихкодВСтрокеЧека("EAN13", "2900001462105");
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
	СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	СтрокаОплаты.Сумма = 1100; 
	СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Наличные");
	ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
		
	СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	СтрокаОплаты.Сумма = 200; 
	СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно");
	ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	
	ОбщиеПараметры.ДанныеКоррекции.ТипКоррекции      = 0;
	ОбщиеПараметры.ДанныеКоррекции.ОписаниеКоррекции = "Чек ККМ";
	ОбщиеПараметры.ДанныеКоррекции.ДатаКоррекции     = ТекущаяДата();
	ОбщиеПараметры.ДанныеКоррекции.НомерПредписания  = "101";
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШаблонЧека(ОбщиеПараметры, ШтрихкодВЧеке = Ложь)
	
	НесколькоВидовОплат = Истина;
	
	// Параметры установлены по умолчанию.   
	ОбщиеПараметры.ТипРасчета = ТипРасчета;
	ОбщиеПараметры.СистемаНалогообложения = СистемаНалогообложения;
	ОбщиеПараметры.Электронно = ККТ_Электронно;
	
	ОбщиеПараметры.ПокупательEmail = Неопределено;
	ОбщиеПараметры.ПокупательНомер = Неопределено;
	// Параметры необходимые для чека ЕНВД на принтере чеков
	ОбщиеПараметры.Кассир       = КассирФИО;
	ОбщиеПараметры.КассирИНН       = КассирИНН;
	// ОбщиеПараметры.КассирДолжность = КассирДолжность;
	// ОбщиеПараметры.КодСистемыНалогообложения = КодСистемыНалогообложения;
	ОбщиеПараметры.ОрганизацияНазвание = "ООО ""1C-СОФТ""";
	ОбщиеПараметры.ОрганизацияИНН = ОрганизацияИНН;
	ОбщиеПараметры.ОрганизацияКПП = ОрганизацияКПП;
	ОбщиеПараметры.НомерКассы     = "00001";
	ОбщиеПараметры.НомерЧека      = "1";
	ОбщиеПараметры.НомерСмены     = "1";
	ОбщиеПараметры.АдресРасчетов  = "г.Москва, Дмитровкое ш. д.9";
	ОбщиеПараметры.МестоРасчетов  = "Учебный центр 1С";
	ОбщиеПараметры.Получатель     = Получатель;
	ОбщиеПараметры.ПолучательИНН  = ПолучательИНН;
	
	НомерСтрокиТовара = 1;
	Для Каждого ВремТовар Из Товары Цикл
		СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
		СтрокаПозицииЧека.Наименование = ВремТовар.Наименование;   
		СтрокаПозицииЧека.Количество   = ВремТовар.Количество;   
		СтрокаПозицииЧека.Цена         = ВремТовар.Цена;   
		СтрокаПозицииЧека.Сумма        = ВремТовар.Сумма;   
		СтрокаПозицииЧека.НомерСекции  = ВремТовар.НомерСекции; 
		СтрокаПозицииЧека.ПризнакСпособаРасчета  = ВремТовар.ПризнакСпособаРасчета;
		СтрокаПозицииЧека.ПризнакПредметаРасчета = ВремТовар.ПризнакПредметаРасчета;
		СтрокаПозицииЧека.СтавкаНДС = _ДемоПодключаемоеОборудованиеВызовСервера.ВернутьСтавкуНДС(ВремТовар.СтавкаНДС);
		СтрокаПозицииЧека.СуммаНДС = РасчитатьНДС(СтрокаПозицииЧека.Сумма, СтрокаПозицииЧека.СтавкаНДС); 
		СтрокаПозицииЧека.Штрихкод = "RU-430301-AAA0020659";
		СтрокаПозицииЧека.НомерСтрокиТовара = НомерСтрокиТовара; // Дополнительный параметр для обработки строк чека для форматно-логического контроля.
		НомерСтрокиТовара = НомерСтрокиТовара + 1;
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	КонецЦикла;    
	
	СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека("Предоставляемый библиотекой функционал является универсальным и не зависит от конкретных моделей оборудования различных производителей. После встраивания библиотеки в конфигурацию, данные функции доступны пользователям через предоставляемый библиотекой пользовательский интерфейс.");
	СтрокаПозицииЧека.ПереносСтроки = Истина;
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
	Если ШтрихкодВЧеке Тогда
		СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыШтрихкодВСтрокеЧека("EAN13", "2900001462105");
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	КонецЕсли;
	
	// Таблица оплат
	ВремИндекс = 0;
	Для Каждого ВремОплата Из Оплата Цикл
		Если ВремОплата.Сумма > 0 Тогда
			СтрокаОплаты = Новый Структура();
			СтрокаОплаты.Вставить("ТипОплаты", ВремОплата.ТипОплаты); 
			СтрокаОплаты.Вставить("Сумма"    , ВремОплата.Сумма);
			ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
		КонецЕсли;
		ВремИндекс = ВремИндекс + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредзаполнитьПараметрыЧека(ОбщиеПараметры);
	
	ОбщиеПараметры.Вставить("ОрганизацияНазвание" , "ООО ""Тестовая организация""");
	ОбщиеПараметры.Вставить("ОрганизацияИНН"      , ОрганизацияИНН);
	ОбщиеПараметры.Вставить("ОрганизацияКПП"      , ОрганизацияКПП);
	ОбщиеПараметры.Вставить("НомерКассы"          , "2334534");
	ОбщиеПараметры.Вставить("НомерЧека"           , "30");
	ОбщиеПараметры.Вставить("НомерСмены"          , "12");
	ОбщиеПараметры.Вставить("ТекстШапки"          , "ДОБРО ПОЖАЛОВАТЬ!");
	ОбщиеПараметры.Вставить("ТекстПодвала"        , "СПАСИБО ЗА ПОКУПКУ!");
	ОбщиеПараметры.Вставить("КассирФИО"           , КассирФИО);
	ОбщиеПараметры.Вставить("КассирДолжность"     , КассирДолжность);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(ДанныеВвода)
	
	ВремТипШтрихкода = МенеджерОборудованияКлиентСервер.ОпределитьТипШтрихкода(ДанныеВвода);
	ШтрихкодМаркировки = ДанныеВвода;
	
	Если ВремТипШтрихкода <> "EAN13" И ВремТипШтрихкода <> "EAN8" Тогда	
		Результат = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.РасшифроватьQRКодЧекаККТ(ДанныеВвода);
		Если Результат.Расшифрован Тогда
			Сообщить("Чек ККТ");
			ВывестиСтруктуруНаЭкран(Результат);
		Иначе
			Результат = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьКодМаркировки(ДанныеВвода);
			Если Результат.Разобран Тогда
				Сообщить("Маркировки продукции");
				МаркировкаGTIN          = Результат.ГлобальныйИдентификаторТорговойЕдиницы;
				МаркировкаСерийныйНомер = Результат.СерийныйНомер;
				МаркировкаКодПроверки   = Результат.КодПроверки;
				Сообщить("GTIN:" + МаркировкаGTIN);
				Сообщить("Серийный номер:" + МаркировкаСерийныйНомер);
				Сообщить("Код проверки:" + МаркировкаКодПроверки);
			Иначе
				Сообщить("Штрихкод: " + ДанныеВвода);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Сообщить("Штрихкод (" + ВремТипШтрихкода + "): " + ДанныеВвода);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ККТ_КомандаВыполнитьЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ОчиститьСообщения();
	//Элементы.ФискальноеУстройство.Доступность = Истина;
	
	НомерСмены  = Неопределено; 
	НомерЧека   = Неопределено;
	СтатусСмены = Неопределено;
	ФискальныйПризнак = Неопределено;
	СайтПроверкиОФД   = Неопределено;
	
	Если РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru='Операция завершена.'");
		
		Если РезультатВыполнения.Свойство("НомерЧекаККТ") Тогда
			НомерЧека = РезультатВыполнения.НомерЧекаККТ;
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("НомерСменыККТ") Тогда
			НомерСмены = РезультатВыполнения.НомерСменыККТ;
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("ШиринаСтроки") Тогда
			Сообщить("ШиринаСтроки:" + РезультатВыполнения.ШиринаСтроки);    
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("СтатусСмены") Тогда
			СтатусСмены = РезультатВыполнения.СтатусСмены;
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("ФискальныйПризнак") Тогда
			ФискальныйПризнак = РезультатВыполнения.ФискальныйПризнак;
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("АдресСайтаПроверки") Тогда
			СайтПроверкиОФД = РезультатВыполнения.АдресСайтаПроверки;
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("ИдентификаторСессии") Тогда
			ИдентификаторСессии = РезультатВыполнения.ИдентификаторСессии;
		КонецЕсли;     
		
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
		//// Пишем лог
		//ОтветОтУстройства = ОтветОтУстройства + ТекстСообщения + Символы.ПС;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ККТ_ПараметрыККТЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ОчиститьСообщения();
	Если РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru='Операция завершена.'");
		ВывестиСтруктуруНаЭкран(РезультатВыполнения.ПараметрыККТ);
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
		//// Пишем лог
		//ОтветОтУстройства = ОтветОтУстройства + ТекстСообщения + Символы.ПС;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Функция ККТ_ПараметрыВыполненияОперации();
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
	ПараметрыОперации.Кассир = НСтр("ru='Иванов П.П.'");
	ПараметрыОперации.КассирИНН = "526317984689";
	ПараметрыОперации.АдресРасчетов = "Дмитровское ш. д.9";
	ПараметрыОперации.МестоРасчетов = "1 Этаж";
	Возврат ПараметрыОперации;
	
КонецФункции

&НаКлиенте
Процедура ККТ_КомандаВыполнитьЗавершениеКМ(Результат, Параметры) Экспорт
	
	ОчиститьСообщения();
	
	ККТ_КодМаркировкиПроверенФискальнымНакопителем = Ложь;
	ККТ_СтатусРезультатаЗапросаКМ = Неопределено;
	ККТ_РезультатПроверкиОИСМПредставление = Неопределено;
	ККТ_РезультатПроверкиФискальнымНакопителемПоложительный = Ложь;
	ККТ_РезультатПроверки = Ложь;
	ККТ_РезультатПроверкиСведенийОТоваре = Неопределено;
	ККТ_РезультатПроверкиСведенийОТовареПФ = Неопределено;
	
	ТекстСообщения = НСтр("ru='Операция завершена.'");
	
	Если Результат.Свойство("СтатусРезультата") Тогда
		ККТ_СтатусРезультатаЗапросаКМ = Результат.СтатусРезультата;
	КонецЕсли;
	Если Результат.Свойство("КодМаркировкиПроверен") Тогда
		ККТ_КодМаркировкиПроверенФискальнымНакопителем = Результат.КодМаркировкиПроверен;
	КонецЕсли;
	Если Результат.Свойство("РезультатПроверки") Тогда
		ККТ_РезультатПроверкиФискальнымНакопителемПоложительный = Результат.РезультатПроверки;
	КонецЕсли;
	Если Результат.Свойство("РезультатПроверкиОИСМ") Тогда
		ККТ_РезультатПроверки = Результат.РезультатПроверкиОИСМ;
	КонецЕсли;
	Если Результат.Свойство("РезультатПроверкиОИСМПредставление") Тогда
		ККТ_РезультатПроверкиОИСМПредставление = Результат.РезультатПроверкиОИСМПредставление;
	КонецЕсли;
	Если Результат.Свойство("СтатусОбработкиЗапроса") Тогда
		ККТ_СтатусОбработкиЗапроса = Результат.СтатусОбработкиЗапроса;
	КонецЕсли;
	Если Результат.Свойство("СтатусТовара") Тогда
		ККТ_ОтветОИСМОСтатусеТовара = Результат.СтатусТовара;
	КонецЕсли;
	Если Результат.Свойство("ИдентификаторСессии") Тогда
		ККТ_ИдентификаторСессии = Результат.ИдентификаторСессии;
	КонецЕсли;
	Если Результат.Свойство("РезультатПроверкиСведенийОТоваре") Тогда
		ККТ_РезультатПроверкиСведенийОТоваре = Результат.РезультатПроверкиСведенийОТоваре;
	КонецЕсли;
	Если Результат.Свойство("РезультатПроверкиСведенийОТовареПФ") Тогда
		ККТ_РезультатПроверкиСведенийОТоваре = Результат.РезультатПроверкиСведенийОТовареПФ + " " + ККТ_РезультатПроверкиСведенийОТоваре;
	КонецЕсли;
	
	Сообщить("Выполнено.");
	
КонецПроцедуры

&НаКлиенте
Процедура ККТ_ПланируемыйСтатусТовараПриИзменении(Элемент)
	
	ШтучныйТовар = ККТ_ПланируемыйСтатусТовара = ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварРеализован")
			Или ККТ_ПланируемыйСтатусТовара = ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварВозвращен");
	
	Элементы.ККТ_МераКоличества.Доступность = НЕ ШтучныйТовар;
	Элементы.ККТ_Количество.Доступность = НЕ ШтучныйТовар;
	Элементы.ККТ_ДробноеКоличествоЧислитель.Доступность = НЕ ШтучныйТовар;
	Элементы.ККТ_ДробноеКоличествоЗнаменатель.Доступность = НЕ  ШтучныйТовар;
	
КонецПроцедуры

&НаКлиенте
Процедура УВ_ВыборКодаВидаНоменклатурнойКлассификации_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		 Штрихкод = Результат.КодВидаНоменклатурнойКлассификации;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСтруктуруНаЭкран(СтруктурыДляВывода)  
	
	Для Каждого СвойствоСтруктуры Из СтруктурыДляВывода Цикл
		Если ТипЗнч(СвойствоСтруктуры.Значение) = Тип("Структура") Тогда 
			ВывестиСтруктуруНаЭкран(СвойствоСтруктуры.Значение) 
		Иначе
			Сообщить(СвойствоСтруктуры.Ключ + "=" + СвойствоСтруктуры.Значение);
		КонецЕсли
	КонецЦикла;
	
КонецПроцедуры    

&НаКлиенте
Процедура НеприменениеККТПриИзменении(Элемент)
	
	Элементы.ДополнительныйРеквизит.Доступность = НЕ НеприменениеККТ; 
	               
КонецПроцедуры

&НаСервере
Функция РасчитатьНДС(Сумма, СтавкаНДС)   
	
	СуммаНДС = ?(СтавкаНДС <> Неопределено И СтавкаНДС > 0, Окр(Сумма / (100 + СтавкаНДС) * СтавкаНДС, 2), 0);
	Возврат СуммаНДС;
	
КонецФункции
	
#КонецОбласти





