
#Область ПроцедурыИФункцииРаботыСШтрихкодами

// Определить тип штрихкода по значению.
//
Функция ОпределитьТипШтрихкода(Штрихкод) Экспорт
	
	ТипШтрихкодаВрем = МенеджерОборудованияКлиентСервер.ОпределитьТипШтрихкода(Штрихкод);
	
	ТипШтрихкодаЗнач = Перечисления._ДемоТипыШтрихкодов[ТипШтрихкодаВрем];
	
	Возврат ТипШтрихкодаЗнач;
	
КонецФункции

// Функция возвращает результат поиска по штрихкоду в справочнике Номенклатура.
//
// Параметры:
// ШКод - Строка - проверяемый штрихкод.
// ТолькоКод - Булево - признак изменения текста запроса.
//
// Возвращаемое значение:
//	ТаблицаЗначений:
//		*Номенклатура - СправочникСсылка._ДемоНоменклатура 
//		*Цена - Число.
//		*ЕдиницаИзмерения - ПеречислениеСсылка._ДемоЕдиницыИзмерения
//		*Весовой - Булево.
//	ТаблицаЗначений:
//		*Код - Число
//
Функция ПоискПоШтрихкоду(ШКод, ТолькоКод = Ложь) Экспорт
	
	ТипШК = ОпределитьТипШтрихкода(ШКод);
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	_ДемоШтрихкоды.Владелец КАК _ДемоНоменклатура
	|ИЗ
	|	Справочник._ДемоНоменклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._ДемоШтрихкоды КАК _ДемоШтрихкоды
	|		ПО (_ДемоШтрихкоды.Владелец.Ссылка = СпрНоменклатура.Ссылка)
	|ГДЕ
	|	_ДемоШтрихкоды.ТипШтрихкода = &ТипШК
	|	И _ДемоШтрихкоды.Штрихкод = &ШКод";
	
	Если ТолькоКод Тогда
		ЗаменяемыйТекст = "
		|	_ДемоШтрихкоды.Владелец КАК _ДемоНоменклатура";
		ТекстЗамены = "
		|	СпрНоменклатура.Код";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ЗаменяемыйТекст, ТекстЗамены);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипШК", ТипШК);
	Запрос.УстановитьПараметр("ШКод", ШКод);
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить();
	
КонецФункции

// Функция возвращает результат проверки полученного штрихкода на предмет уникальности в информационной базе.
//
// Параметры:
// ШКод - Строка - проверяемый штрихкод.
// ТипШК - ПланВидовХарактеристикСсылка.ТипыШтрихкодов - тип штрихкода.
//
// ВозвращаемоеЗначение:
// Булево - результат проверки.
//
Функция ПроверитьУникальностьШтрихкода(ШКод, ТипШК = Неопределено) Экспорт
	
	Уникальность = Истина;
	Если ТипШК = Неопределено Тогда
		ТипШК = ОпределитьТипШтрихкода(ШКод);
	КонецЕсли;
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	| _ДемоШтрихкоды.Штрихкод КАК Штрихкод
	|ИЗ РегистрСведений._ДемоШтрихкоды КАК _ДемоШтрихкоды
	|ГДЕ _ДемоШтрихкоды.Штрихкод = &ШКод
	|И _ДемоШтрихкоды.ТипШтрихкода = &ТипШК";
	
	Запрос.УстановитьПараметр("ШКод", ШКод);
	Запрос.УстановитьПараметр("ТипШК", ТипШК);
	
	Если Запрос.Выполнить().Выгрузить().Количество() Тогда
		Уникальность = Ложь;
	КонецЕсли;
	
	Возврат Уникальность;
	
КонецФункции

// Функция возвращает результат поиска по регистру сведений Штрихкоды.
//
// Параметры:
// ТекКод - Строка - штрихкод,по которуму производится поиск.
//
// Возвращаемое значение зависит от результат запроса:
//
//   Штрихкод найден:
//    Структура - ключи структуры: Владелец, Штрихкод, ТипШтрихкода.
//
//   Штрихкод НЕ найден:
//    Структура - ключи структуры: Штрихкод, ТипШтрихкода.
//
Функция ПоискПоРегиструСведенийШтрихкоды(ТекКод) Экспорт
	
	ТипШтрихкодаВрем = ОпределитьТипШтрихкода(ТекКод);
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	_ДемоШтрихкоды.Владелец КАК Владелец
	|ИЗ
	|	РегистрСведений._ДемоШтрихкоды КАК _ДемоШтрихкоды
	|ГДЕ
	|	_ДемоШтрихкоды.Штрихкод = &Штрихкод
	|	И _ДемоШтрихкоды.ТипШтрихкода = &ТипШтрихкода";
	
	Запрос.УстановитьПараметр("Штрихкод", ТекКод);
	Запрос.УстановитьПараметр("ТипШтрихкода", ТипШтрихкодаВрем);
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("ТипШтрихкода", ТипШтрихкодаВрем);
	Выборка = Запрос.Выполнить();
	Если Не Выборка.Пустой() Тогда
		ТекСтрока = Выборка.Выгрузить()[0];
		СтруктураРезультата.Вставить("Владелец", ТекСтрока.Владелец);
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСКодамиМагнитыхКарт

// Функция возвращает результат поиска клиента в справочнике по коду магнитной карты.
//
// Параметры:
// МКод - Строка - магнитный код.
//
// Возвращаемое значение:
// СправочникСсылкаКлиенты / Неопределено
//
Функция НайтиКлиентаПоМК(МКод) Экспорт
	
	Клиент = Справочники._ДемоКлиенты.НайтиПоРеквизиту("НомерКарты", МКод);
	Если Клиент.Пустая() Тогда
		Клиент = Неопределено;
	КонецЕсли;
	Возврат Клиент;
	
КонецФункции

// Функция возвращает результат проверки кода магнитной карты на предмет уникальности в информационной базе.
//
// Если объект уже записан и редактируется, тогда для исключения этого объекта из результат запроса
// добавляется дополнительное условие и устанавливается параметр.
//
// Параметры:
// СпрОбъект - СправочникОбъект.Клиенты - элемент справочника Клиенты.
//
// Возвращаемое значение:
// Булево - результат проверки.
//
Функция ПроверитьУникальностьМагнитногоКода(СпрОбъект) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	| _ДемоКлиенты.НомерКарты
	|ИЗ
	| Справочник._ДемоКлиенты КАК _ДемоКлиенты
	|ГДЕ
	|	_ДемоКлиенты.НомерКарты = &МКод";
	МКод = СпрОбъект.НомерКарты;
	Запрос.УстановитьПараметр("МКод", МКод);
	Если НЕ СпрОбъект.ЭтоНовый() Тогда
		ЭлементСсылка = СпрОбъект.Ссылка;
		Запрос.Текст = Запрос.Текст + " И _ДемоКлиенты.Ссылка <> &ЭлементСсылка";
		Запрос.УстановитьПараметр("ЭлементСсылка", ЭлементСсылка);
	КонецЕсли;
	Результат = Запрос.Выполнить().Пустой();
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции            

// Возвращает, для каких типов товаров будет заполняться отраслевой реквизит.
//
// Параметры:
//  ТипыТоваров - Структура
//  * ИзделияИзНатуральногоМеха - Булево - Заполнения для изделия из натурального меха. 
//  * ОбъемноСортовойУчет -  Заполнения для товаров объемно сортового учета.
//
Процедура ОтраслевойРеквизитЗаполняетсяДляТиповТоваров(ТипыТоваров) Экспорт
	
	ТипыТоваров.ИзделияИзНатуральногоМеха = Истина;
	ТипыТоваров.ОбъемноСортовойУчет = Истина;
	
КонецПроцедуры

Процедура ВедетсяОбъемноСортовойУчет(ОбъемноСортовойУчет, СтандартнаяОбработка) Экспорт
	
	ОбъемноСортовойУчет = Истина;
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОказываютсяУслугиОбщественноеПитания(ОбщественноеПитание, СтандартнаяОбработка) Экспорт
	
	ОбщественноеПитание = Истина;
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры 

// Функция возвращает результат проверки общей структуры адресов электронной почты клиента
// на корректность записи.
//
// Параметры:
// АдресЭП - Строка - адрес или несколько адресов электронной почты.
//
// Возвращаемое значение:
// Результат - Булево - результат проверки.
//
Функция ПроверитьКорректностьЗаписиАдресаЭлектроннойПочты(АдресЭП) Экспорт
	
	Результат = Истина;
	Если НЕ ПустаяСтрока(АдресЭП) Тогда
		
		ЧислоАдресов = СтрЧислоВхождений(АдресЭП,"@");
		Если ЧислоАдресов = 0 Тогда
			
			Результат = Ложь;
			
		Иначе
			
			Для к = 1 По ЧислоАдресов Цикл
				
				АТ = Найти(АдресЭП, "@");
				
				ИмяПользователя = Лев(АдресЭП,АТ-1);
				
				Если (ПустаяСтрока(ИмяПользователя) ИЛИ Найти(ИмяПользователя," ") <> 0) Тогда
					Результат = Ложь;
					Прервать;
				КонецЕсли;
				
				АдресЭП = Сред(АдресЭП, АТ+1);
				Разделитель = НайтиРазделительАдресов(АдресЭП);
				Если Разделитель = СтрДлина(АдресЭП) Тогда
					Домен = Лев(АдресЭП,Разделитель);
				Иначе
					Домен = Лев(АдресЭП,Разделитель-1);
				КонецЕсли;
				
				Если (ПустаяСтрока(Домен) ИЛИ Найти(Домен," ") <> 0) Тогда
					Результат = Ложь;
					Прервать;
				КонецЕсли;
				
				ЧислоТочек = СтрЧислоВхождений(Домен,".");
				
				Если НЕ (ЧислоТочек > 0 И ЧислоТочек <=2) Тогда
					Результат = Ложь;
					Прервать;
				КонецЕсли;
				
				АдресЭП = СокрЛ(Сред(АдресЭП,Разделитель+1));
				
			КонецЦикла
			
		КонецЕсли;
		
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

// Функция возвращает позицию символа, разделяющего два соседних адреса электронной почты,
// записанных в одной строке.
//
// Параметры:
// Стр - Строка - строка с адресам электронной почты.
//
// Возвращаемое значение:
// Результат - Число - позиция разделителя.
//
Функция НайтиРазделительАдресов(Стр)
	
	Результат = Найти(Стр," ");
	Если Результат = 0 Тогда
		Результат = Найти(Стр,",");
	КонецЕсли;
	Если Результат = 0 Тогда
		Результат = Найти(Стр,";");
	КонецЕсли;
	Если Результат = 0 Тогда
		Результат = СтрДлина(Стр);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает ф.о "Использовать подключаемое оборудование".
//
Функция ИспользоватьПодключаемоеОборудование() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Получить максимальный код SKU.
//
Функция ПолучитьМаксимальныйКодSKU() Экспорт
	
	Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(_ДемоНоменклатура.SKU) КАК SKU
	|ИЗ
	|	Справочник._ДемоНоменклатура КАК _ДемоНоменклатура";
	
	Запрос = Новый Запрос(Текст);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.SKU) Тогда
			Результат = Выборка.SKU + 1;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает первые 50 элементов из справочника Номенклатура.
//
// Возвращаемое значение:
// Результат - ТаблицаЗначений - таблица товаров.
//
Функция ВыбратьДемоДанные() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 50
	|	_ДемоНоменклатура.Ссылка КАК Номенклатура,
	|	_ДемоНоменклатура.Характеристика,
	|	_ДемоНоменклатура.ЕдиницаИзмерения,
	|	_ДемоНоменклатура.Цена,
	|	_ДемоНоменклатура.СтавкаНДС,
	|	_ДемоНоменклатура.Цена КАК Сумма
	|ИЗ
	|	Справочник._ДемоНоменклатура КАК _ДемоНоменклатура
	|ГДЕ
	|	_ДемоНоменклатура.ЭтоГруппа = ЛОЖЬ";
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Вставить(6,"Количество");
	Результат.Колонки.Вставить(7,"СуммаНДС");
	
	Для Каждого СтрокаТЗ Из Результат Цикл
		СтрокаТЗ.Количество = 1;
		Ставка = ВернутьСтавкуНДС(СтрокаТЗ.СтавкаНДС);
		Если Ставка <> Неопределено И Ставка > 0 Тогда
			Сумма = СтрокаТЗ.Сумма;
			Если Ставка > 100 Тогда
				СтрокаТЗ.СуммаНДС = Окр(Сумма - Сумма/( 1 + (Ставка - 100) /100),2);
			Иначе
				СтрокаТЗ.СуммаНДС = Окр(Сумма - Сумма/( 1 + Ставка /100),2);
			КонецЕсли;
		Иначе
			СтрокаТЗ.СуммаНДС = 0;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает значение ставки НДС с типом Число для рассчета Суммы НДС.
//
Функция ВернутьСтавкуНДС(СтавкаНДС) Экспорт
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление._ДемоСтавкиНДС.НДС10") Тогда
		Ставка = 10;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление._ДемоСтавкиНДС.НДС18") Тогда
		Ставка = 18;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление._ДемоСтавкиНДС.НДС20") Тогда
		Ставка = 20;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление._ДемоСтавкиНДС.НДС22") Тогда
		Ставка = 22;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление._ДемоСтавкиНДС.НДС0") Тогда
		Ставка = 0;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление._ДемоСтавкиНДС.НДС110") Тогда
		Ставка = 110;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление._ДемоСтавкиНДС.НДС118") Тогда
		Ставка = 118;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление._ДемоСтавкиНДС.НДС120") Тогда
		Ставка = 120;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление._ДемоСтавкиНДС.НДС122") Тогда
		Ставка = 122;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление._ДемоСтавкиНДС.НДС5") Тогда
		Ставка = 5;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление._ДемоСтавкиНДС.НДС7") Тогда
		Ставка = 7;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление._ДемоСтавкиНДС.НДС105") Тогда
		Ставка = 105;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление._ДемоСтавкиНДС.НДС107") Тогда
		Ставка = 107;
	Иначе
		Ставка = Неопределено;
	КонецЕсли;
	
	Возврат Ставка;
	
КонецФункции

// Функция выбирает чеки, пробитые в текущую смену и присваивает им статус Архивный.
//
// Возвращаеомое значение:
// Результат - Булево - результат записи документов.
//
Функция ЗаархивироватьДокументыПередЗакрытиемСмены() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	_ДемоЧек.Ссылка
	|ИЗ
	|	Документ._ДемоЧек КАК _ДемоЧек";
	
	ВыборкаДокументов = Запрос.Выполнить().Выгрузить();
	
	Результат = Истина;
	НачатьТранзакцию();
	Для Каждого Документ Из ВыборкаДокументов Цикл
		
		ДокОбъект = Документ.Ссылка.ПолучитьОбъект();
		ДокОбъект.Архивный = Истина;
		
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			Результат = Ложь;
			Прервать;
		КонецПопытки;
		
	КонецЦикла;
	
	Если НЕ Результат Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура возвращает ф.о "ИзолированноеПодключенияВнешнихКомпонент".
//
Процедура ИзолированноеПодключенияВнешнихКомпонент(Изолированно, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Изолированно = ПолучитьФункциональнуюОпцию("_ДемоИзолированноеПодключенияВнешнихКомпонент");
	
КонецПроцедуры           

#КонецОбласти