#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьПодключаемоеОборудование = _ДемоПодключаемоеОборудованиеВызовСервера.ИспользоватьПодключаемоеОборудование();
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

// Процедура - Обработчик события "ПриЗакрытии" формы.
//
&НаКлиенте
Процедура ПриЗакрытии()
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаОповещения" формы.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И Параметр.Свойство("Штрихкод") Тогда
			Запись.Штрихкод = Параметр.Штрихкод;
			ПолученШтрихкодИзСШК(Запись.Штрихкод);
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
КонецПроцедуры

// Процедура - обработчик события "ОбработкаПроверкиЗаполненияНаСервере" формы.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		Если Не _ДемоПодключаемоеОборудованиеВызовСервера.ПроверитьУникальностьШтрихкода(Запись.Штрихкод, Запись.ТипШтрихкода) Тогда
			ОбщегоНазначенияБПО.СообщитьПользователю("Штрихкод не уникален!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события "ПриИзменении" поля ввода Штрихкод.
//
&НаКлиенте
Процедура ШтрихкодПриИзменении(Элемент)
	
	ПолученШтрихкодИзСШК(Запись.Штрихкод);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура записывает записывает в поле ТипШтрихкода тип, полученного со сканера штрихкода.
//
&НаСервере
Процедура ПолученШтрихкодИзСШК(Штрихкод)
	
	Запись.ТипШтрихкода = _ДемоПодключаемоеОборудованиеВызовСервера.ОпределитьТипШтрихкода(Штрихкод);
	
КонецПроцедуры

#КонецОбласти