&НаСервере
Процедура НовыйПолучитьИнформациюНаСервере()
	//ИЛИ 
	//получить список не оплаченых безнальных ПН
	//накладные должны быть не оплачены или оплачены текущим днем
	Объект.ОбщийСписок.Очистить();
	Объект.Оплачено.Очистить();
	
	Если ЗначениеЗаполнено(Объект.ФильтрЗаведение) = Истина Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 

		"ВЫБРАТЬ
		|	ПриходнаяНакладная.Ссылка КАК Ссылка,
		|	ПриходнаяНакладная.Дата КАК Дата,
		|	ПриходнаяНакладная.Заведение КАК Заведение,
		|	ПриходнаяНакладная.Поставщик КАК Поставщик,
		|	ПриходнаяНакладная.ТипНакладной КАК ТипНакладной,
		|	ПриходнаяНакладная.Сумма КАК Сумма,
		|	ПриходнаяНакладная.СсылкаНаОрдер КАК СсылкаНаОрдер,
		|	ПриходнаяНакладная.ВнешнийНомер КАК ВнешнийНомер
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ГДЕ
		|	ПриходнаяНакладная.ТипНакладной = &ТипНакладной
		|	И ПриходнаяНакладная.Заведение = &Заведение
		|	И ПриходнаяНакладная.ПометкаУдаления = &ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Заведение,
		|	Поставщик,
		|	Дата";
	
		Запрос.УстановитьПараметр("ТипНакладной", Перечисления.ТипРассчетов.БезнальныйРассчет);
		Запрос.УстановитьПараметр("Заведение", Объект.ФильтрЗаведение);
		Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);

	ИначеЕсли ЗначениеЗаполнено(Объект.Фильтр) = Истина Тогда
 
		Запрос = Новый Запрос;
		Запрос.Текст = 

		"ВЫБРАТЬ
		|	ПриходнаяНакладная.Ссылка КАК Ссылка,
		|	ПриходнаяНакладная.Дата КАК Дата,
		|	ПриходнаяНакладная.Заведение КАК Заведение,
		|	ПриходнаяНакладная.Поставщик КАК Поставщик,
		|	ПриходнаяНакладная.ТипНакладной КАК ТипНакладной,
		|	ПриходнаяНакладная.Сумма КАК Сумма,
		|	ПриходнаяНакладная.СсылкаНаОрдер КАК СсылкаНаОрдер,
		|	ПриходнаяНакладная.ВнешнийНомер КАК ВнешнийНомер
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ГДЕ
		|	ПриходнаяНакладная.ТипНакладной = &ТипНакладной
		|	И ПриходнаяНакладная.Поставщик = &Поставщик
		|	И ПриходнаяНакладная.ПометкаУдаления = &ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Заведение,
		|	Поставщик,
		|	Дата";
	
		Запрос.УстановитьПараметр("ТипНакладной", Перечисления.ТипРассчетов.БезнальныйРассчет);
		Запрос.УстановитьПараметр("Поставщик", Объект.Фильтр);
		Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);

	Иначе
  		Запрос = Новый Запрос;
		Запрос.Текст = 
	

		"ВЫБРАТЬ
		|	ПриходнаяНакладная.Ссылка КАК Ссылка,
		|	ПриходнаяНакладная.Дата КАК Дата,
		|	ПриходнаяНакладная.Заведение КАК Заведение,
		|	ПриходнаяНакладная.Поставщик КАК Поставщик,
		|	ПриходнаяНакладная.ТипНакладной КАК ТипНакладной,
		|	ПриходнаяНакладная.Сумма КАК Сумма,
		|	ПриходнаяНакладная.СсылкаНаОрдер КАК СсылкаНаОрдер,
		|	ПриходнаяНакладная.ВнешнийНомер КАК ВнешнийНомер
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ГДЕ
		|	ПриходнаяНакладная.ТипНакладной = &ТипНакладной
		|	И ПриходнаяНакладная.ПометкаУдаления = &ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Заведение,
		|	Поставщик,
		|	Дата";
	
		Запрос.УстановитьПараметр("ТипНакладной", Перечисления.ТипРассчетов.БезнальныйРассчет);
		Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СсылкаНаОрдер = Документы.РасходныйКассовыйОрдер.СсылкаНаРассчет(Выборка.Ссылка);
		Если СсылкаНаОрдер = Неопределено Тогда
			НоваяСтрока = Объект.ОбщийСписок.Добавить();
			
			НоваяСтрока.Дата = Выборка.Дата;
			НоваяСтрока.Поставщик = Выборка.Поставщик;
			НоваяСтрока.Заведение = Выборка.Заведение;

			НоваяСтрока.Номер = Выборка.ВнешнийНомер;
			НоваяСтрока.Сумма = Выборка.Сумма;
			
			//НоваяСтрока.Передана
			НоваяСтрока.СсылкаНаПН = Выборка.Ссылка;
			НоваяСтрока.ДатаПодтверждения = Документы.ПодтверждениеДокумента.ДатаПолученияДок(НоваяСтрока.СсылкаНаПН);
			Если ЗначениеЗаполнено(НоваяСтрока.ДатаПодтверждения) Тогда
				НоваяСтрока.Подтверждена = Истина;
			Иначе
				НоваяСтрока.Подтверждена = Ложь;	
			КонецЕсли;
			//ссылка на оплату
			НоваяСтрока.СсылкаНаОрдер = СсылкаНаОрдер;
		
			Если ЗначениеЗаполнено(СсылкаНаОрдер)=1 Тогда
				НоваяСтрока.РассчетныйСчет = СсылкаНаОрдер.РасчетныйСчет;
				НоваяСтрока.ДатаОплаты = СсылкаНаОрдер.Дата;
			КонецЕсли;
			//статус оплачено
			Если СсылкаНаОрдер = Неопределено Тогда
				НоваяСтрока.Оплачено = Ложь;
				НоваяСтрока.СуммаНеоплаченных = Выборка.Сумма;

			Иначе
				НоваяСтрока.Оплачено = Истина;
				НоваяСтрока.СуммаОплаченных = Выборка.Сумма;

			КонецЕсли;
			
		
		
		
		ИначеЕсли НачалоДня(СсылкаНаОрдер.ДатаСозданияДокумента) = НачалоДня(Объект.Дата) Тогда
			НоваяСтрока = Объект.Оплачено.Добавить();
			
			НоваяСтрока.Дата = Выборка.Дата;
			НоваяСтрока.Поставщик = Выборка.Поставщик;
			НоваяСтрока.Заведение = Выборка.Заведение;

			НоваяСтрока.Номер = Выборка.ВнешнийНомер;
			НоваяСтрока.Сумма = Выборка.Сумма;
			
		КонецЕсли;

		
	КонецЦикла;
	
	

	
КонецПроцедуры


&НаСервере
Процедура ПолучитьИнформациюНаСервере()
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(Объект.Фильтр) Тогда 
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПриходнаяНакладная.Ссылка КАК Ссылка,
			|	ПриходнаяНакладная.Дата КАК Дата,
			|	ПриходнаяНакладная.Заведение КАК Заведение,
			|	ПриходнаяНакладная.Поставщик КАК Поставщик,
			|	ПриходнаяНакладная.Сумма КАК Сумма,
			|	ПриходнаяНакладная.ВнешнийНомер КАК ВнешнийНомер,
			|	ПриходнаяНакладная.ПометкаУдаления КАК ПометкаУдаления
			|ИЗ
			|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
			|ГДЕ
			|	ПриходнаяНакладная.ТипНакладной = &ТипНакладной
			|	И ПриходнаяНакладная.ПометкаУдаления = &ПометкаУдаления
			|	И ПриходнаяНакладная.Поставщик = &Поставщик
			|
			|УПОРЯДОЧИТЬ ПО
			|	Поставщик,
			|	Дата";
		
		Запрос.УстановитьПараметр("ТипНакладной", Перечисления.ТипРассчетов.БезнальныйРассчет);
		Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	    Запрос.УстановитьПараметр("Поставщик", Объект.Фильтр);
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПриходнаяНакладная.Ссылка КАК Ссылка,
			|	ПриходнаяНакладная.Дата КАК Дата,
			|	ПриходнаяНакладная.Заведение КАК Заведение,
			|	ПриходнаяНакладная.Поставщик КАК Поставщик,
			|	ПриходнаяНакладная.Сумма КАК Сумма,
			|	ПриходнаяНакладная.ВнешнийНомер КАК ВнешнийНомер,
			|	ПриходнаяНакладная.ПометкаУдаления КАК ПометкаУдаления
			|ИЗ
			|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
			|ГДЕ
			|	ПриходнаяНакладная.ТипНакладной = &ТипНакладной
			|	И ПриходнаяНакладная.ПометкаУдаления = &ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	Поставщик,
			|	Дата";
		
		Запрос.УстановитьПараметр("ТипНакладной", Перечисления.ТипРассчетов.БезнальныйРассчет);
		Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	КонецЕсли;


	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Документы.РасходныйКассовыйОрдер.ПроверкаОплатыПН(Выборка.Ссылка) = Ложь Тогда
			СтатусНакладной = Ложь;
		//проверка есть ли накладная в документе
		Для Каждого Выб Из ОпределениеТаблицы(Выборка.Заведение) Цикл
			Если Выборка.Ссылка = Выб.СсылкаНаПН Тогда
				СтатусНакладной = Истина;
				Прервать;	
			КонецЕсли;
		КонецЦикла;
		
		Если СтатусНакладной = Истина Тогда
		
			Продолжить;
		
		КонецЕсли;

		Если Выборка.Заведение = Перечисления.Заведение.Заболотного Тогда
			НоваяСтрока = Объект.Заболотного.Добавить();	
		ИначеЕсли Выборка.Заведение = Перечисления.Заведение.Паустовского Тогда
			НоваяСтрока = Объект.Паустовского.Добавить();	
		ИначеЕсли Выборка.Заведение = Перечисления.Заведение.Дерибасовская Тогда
			НоваяСтрока = Объект.Дерибасовская.Добавить();
		ИначеЕсли Выборка.Заведение = Перечисления.Заведение.Торговая Тогда
			НоваяСтрока = Объект.Торговая.Добавить();
		ИначеЕсли Выборка.Заведение = Перечисления.Заведение.Филатово Тогда
			НоваяСтрока = Объект.Филатово.Добавить();
		ИначеЕсли Выборка.Заведение = Перечисления.Заведение.Люстдорф Тогда
			НоваяСтрока = Объект.Люстдорф.Добавить();
		ИначеЕсли Выборка.Заведение = Перечисления.Заведение.Таирово Тогда
			НоваяСтрока = Объект.Таирово.Добавить();
		ИначеЕсли Выборка.Заведение = Перечисления.Заведение.ПицерияЗаболотного Тогда
			НоваяСтрока = Объект.Пицерия.Добавить();
		КонецЕсли;
		

		НоваяСтрока.Дата = Выборка.Дата;
		НоваяСтрока.Поставщик = Выборка.Поставщик;
		НоваяСтрока.Заведение = Выборка.Заведение;

		НоваяСтрока.Номер = Выборка.ВнешнийНомер;
		НоваяСтрока.Сумма = Выборка.Сумма;
		НоваяСтрока.СуммаНеоплаченных = Выборка.Сумма;

		//НоваяСтрока.Передана
		НоваяСтрока.СсылкаНаПН = Выборка.Ссылка;
		НоваяСтрока.ДатаПодтверждения = Документы.РасходныйКассовыйОрдер.ДатаПолученияДок(НоваяСтрока.СсылкаНаПН);
		Если ЗначениеЗаполнено(НоваяСтрока.ДатаПодтверждения) Тогда
			НоваяСтрока.Подтверждена = Истина;
		Иначе
			НоваяСтрока.Подтверждена = Ложь;	
		КонецЕсли;

		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоставкиПива()
	Объект.Пиво.Очистить();
	НачалоПрошлойНедели = НачалоНедели(НачалоДня(НачалоНедели(Объект.Дата)-10));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладная.Дата КАК Дата,
		|	ПриходнаяНакладная.Поставщик КАК Поставщик,
		|	ПриходнаяНакладная.Сумма КАК Сумма,
		|	ПриходнаяНакладная.Заведение КАК Заведение,
		|	ПриходнаяНакладная.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ГДЕ
		|	ПриходнаяНакладная.Дата МЕЖДУ &Начало И &Конец
		|	И ПриходнаяНакладная.Сумма > &Сумма
		|	И ПриходнаяНакладная.Поставщик = &Поставщик";
	
	Запрос.УстановитьПараметр("Конец", КонецДня(КонецНедели(НачалоПрошлойНедели)));
	Запрос.УстановитьПараметр("Начало", НачалоПрошлойНедели);
	Поставщик = Справочники.Поставщики.НайтиПоКоду(950);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("Сумма", 0);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Пиво.Добавить();
		НоваяСтрока.Заведение = Выборка.Заведение;
		НоваяСтрока.ДатаПоставки = Выборка.Дата;
		НоваяСтрока.Сумма = Выборка.Сумма;
		НоваяСтрока.СсылкаНаПН = Выборка.Ссылка;
		СсылкаНаПодтверждение = Документы.ПодтверждениеДокумента.СсылкаДокПодтверждения(НоваяСтрока.СсылкаНаПН);
		Если СсылкаНаПодтверждение <> Неопределено Тогда
			НоваяСтрока.Получено = Истина;
		КонецЕсли;
	КонецЦикла;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДневнойОтчетОсновнаяИнформация.Ссылка.Дата КАК Дата,
		|	ДневнойОтчетОсновнаяИнформация.Ссылка.Заведение КАК Заведение,
		|	ДневнойОтчетОсновнаяИнформация.Статья КАК Статья,
		|	ДневнойОтчетОсновнаяИнформация.Сумма КАК Сумма
		|ИЗ
		|	Документ.ДневнойОтчет.ОсновнаяИнформация КАК ДневнойОтчетОсновнаяИнформация
		|ГДЕ
		|	ДневнойОтчетОсновнаяИнформация.Ссылка.Дата МЕЖДУ &Начало И &Конец
		|	И ДневнойОтчетОсновнаяИнформация.Ссылка.Заведение = &Заведение
		|	И ДневнойОтчетОсновнаяИнформация.Статья = &Статья";
	
	Запрос.УстановитьПараметр("Заведение", Перечисления.Заведение.Люстдорф);
	Запрос.УстановитьПараметр("Конец", КонецДня(КонецНедели(НачалоПрошлойНедели)));
	Запрос.УстановитьПараметр("Начало", НачалоПрошлойНедели);
	Запрос.УстановитьПараметр("Статья", Справочники.СтатьиРасходов.ПолучитьСтатьюОрдера("22"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Пиво.Добавить();
		НоваяСтрока.Заведение = Перечисления.Заведение.Люстдорф;
		НоваяСтрока.ДатаПоставки = Выборка.Дата;
		НоваяСтрока.Сумма = Выборка.Сумма;

	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
//Запрос.УстановитьПараметр("Начало", НачалоПрошлойНедели);
//	Запрос.УстановитьПараметр("Заведние", Перечисления.Заведение.Люстдорф);
//	Запрос.УстановитьПараметр("Конец", КонецДня(КонецНедели(НачалоПрошлойНедели)));
//	Запрос.УстановитьПараметр("Статья", ПолучениеОбщейИнформации.ПолучитьСтатьюОрдера(000000022));

КонецПроцедуры // ЗаполнитьПоставкиПива()


&НаКлиенте
Процедура ПолучитьИнформацию(Команда)
	НовыйПолучитьИнформациюНаСервере();
	ЗаполнитьПоставкиПива()
	//ПолучитьИнформациюНаСервере();
	//Автосохранение();
КонецПроцедуры

&НаСервере
Функция ОпределениеТаблицы(Заведение)
	
	Если Заведение = Перечисления.Заведение.Заболотного Тогда
		ТЧ = Объект.Заболотного;
	ИначеЕсли Заведение = Перечисления.Заведение.Паустовского Тогда
		ТЧ = Объект.Паустовского;
	ИначеЕсли Заведение = Перечисления.Заведение.Торговая Тогда
		ТЧ = Объект.Торговая;
	ИначеЕсли Заведение = Перечисления.Заведение.Дерибасовская Тогда
		ТЧ = Объект.Дерибасовская;
	ИначеЕсли Заведение = Перечисления.Заведение.Филатово Тогда
		ТЧ = Объект.Филатово;
	ИначеЕсли Заведение = Перечисления.Заведение.Люстдорф Тогда
		ТЧ = Объект.Люстдорф;
	ИначеЕсли Заведение = Перечисления.Заведение.Таирово Тогда
		ТЧ = Объект.Таирово;
	ИначеЕсли Заведение = Перечисления.Заведение.ПицерияЗаболотного Тогда
		ТЧ = Объект.Пицерия;
	КонецЕсли;
	
	Возврат ТЧ;
КонецФункции

&НаСервере
Процедура  УправлениеПодтверждением(СсылкаНаПН, Статус)
	
	СсылкаНаДок = Документы.ПодтверждениеДокумента.СсылкаДокПодтверждения(СсылкаНаПН);
	
	Если Статус = Истина Тогда
		Если НЕ СсылкаНаДок = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		Документы.ПодтверждениеДокумента.СозданиеДокументаПодтверждения(СсылкаНаПН, Объект.Дата);
	КонецЕсли;
	
	Если Статус = Ложь Тогда
		Если СсылкаНаДок = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		ТекДок = СсылкаНаДок.ПолучитьОбъект();
		Если НЕ ТекДок.Дата = Объект.Дата Тогда
			Возврат;
		КонецЕсли;

		УниверсальныеОбработчикиДокументов.УдалениеДокумента(СсылкаНаДок);
	КонецЕсли;

КонецПроцедуры // УправлениеПодтверждением()


&НаСервере
Процедура ПриИзмененииНаСервереТЧ(НомерСтроки, Заведение)
	
	ТЧ = Объект.ОбщийСписок;
	Для Каждого Выборка Из ТЧ Цикл
		Если Выборка.НомерСтроки = НомерСтроки Тогда
			
		
			УправлениеПодтверждением(Выборка.СсылкаНаПН, Выборка.Подтверждена); // создает или удаляет док подтверждения
			СсылкаНаДок = Документы.ПодтверждениеДокумента.СсылкаДокПодтверждения(Выборка.СсылкаНаПН);
			Если СсылкаНаДок = Неопределено Тогда 
				Выборка.ДатаПодтверждения = "";
			Иначе
				ТекДок = СсылкаНаДок.ПолучитьОбъект();
				Выборка.ДатаПодтверждения = ТекДок.Дата;
			КонецЕсли;
			
			Если Выборка.СсылкаНаПН.Пустая() Тогда
				Выборка.СсылкаНаПН = Документы.ПриходнаяНакладная.СоздатьНакладную(Выборка.Заведение, Выборка.Дата, Выборка.Поставщик.Склад, Выборка.Поставщик, Перечисления.ТипРассчетов.БезнальныйРассчет,
							Выборка.Сумма, , Выборка.Номер, Перечисления.Заведение.Бухгалтерия);
			КонецЕсли;
			
			Если НЕ Выборка.СсылкаНаПН.Пустая() Тогда
				Документы.ПриходнаяНакладная.РедактированиеПрихДок(Выборка.СсылкаНаПН, Выборка.Заведение, Выборка.Поставщик.Склад, Выборка.Поставщик,
								Перечисления.ТипРассчетов.БезнальныйРассчет, Выборка.Номер, Выборка.Сумма);
			КонецЕсли;

			
			Если НЕ Выборка.СсылкаНаОрдер.Пустая() Тогда 
				СсылкаНаДок = Выборка.СсылкаНаОрдер.ПолучитьОбъект(); 
				СсылкаНаДок.Удалить(); 
				Выборка.СсылкаНаОрдер = "";
			КонецЕсли;

			Если Выборка.Оплачено = Ложь Тогда
				Выборка.СуммаОплаченных = 0;
				Выборка.СуммаНеоплаченных = Выборка.Сумма;
				Возврат;
			КонецЕсли;
			Статья = Справочники.СтатьиРасходов.ПолучитьСтатьюОрдера("88"); 
			Если ЗначениеЗаполнено(Выборка.ДатаОплаты) Тогда
				ДатаОрдера = Выборка.ДатаОплаты;
			Иначе
				ДатаОрдера = Объект.Дата;
			КонецЕсли;
			Выборка.СсылкаНаОрдер = Документы.РасходныйКассовыйОрдер.СоздатьРасходОрдера(ДатаОрдера, Выборка.Заведение, Справочники.Кассы.ПолучитьКассу(Перечисления.Заведение.Бухгалтерия),
												Выборка.Поставщик, Выборка.Сумма, Статья, , Выборка.СсылкаНаПН, Выборка.РассчетныйСчет, Объект.Дата); 
			Выборка.СуммаОплаченных = Выборка.Сумма;
			Выборка.СуммаНеоплаченных = 0;

		КонецЕсли;
	КонецЦикла;
КонецПроцедуры



&НаКлиенте
Процедура ЗаболотногоПриИзменении(Элемент)
	НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Заведение) Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Дата) Тогда
		Возврат;	
	КонецЕсли;
	
	
	
	ПриИзмененииНаСервереТЧ(НомерСтроки, Элемент.ТекущиеДанные.Заведение);
	Автосохранение();
КонецПроцедуры

&НаКлиенте
Процедура ПаустовскогоПриИзменении(Элемент)
	НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Заведение) Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Дата) Тогда
		Возврат;	
	КонецЕсли;

	ПриИзмененииНаСервереТЧ(НомерСтроки, Элемент.ТекущиеДанные.Заведение);
	Автосохранение();
КонецПроцедуры

&НаКлиенте
Процедура ДерибасовскаяПриИзменении(Элемент)
	НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Заведение) Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Дата) Тогда
		Возврат;	
	КонецЕсли;

	ПриИзмененииНаСервереТЧ(НомерСтроки, Элемент.ТекущиеДанные.Заведение);
	Автосохранение();
КонецПроцедуры


&НаКлиенте
Процедура ТорговаяПриИзменении(Элемент)
	НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Заведение) Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Дата) Тогда
		Возврат;	
	КонецЕсли;

	ПриИзмененииНаСервереТЧ(НомерСтроки, Элемент.ТекущиеДанные.Заведение);
	Автосохранение();
КонецПроцедуры


&НаКлиенте
Процедура ФилатовоПриИзменении(Элемент)
	НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Заведение) Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Дата) Тогда
		Возврат;	
	КонецЕсли;

	ПриИзмененииНаСервереТЧ(НомерСтроки, Элемент.ТекущиеДанные.Заведение);
	Автосохранение();
КонецПроцедуры


&НаКлиенте
Процедура ЛюстдорфПриИзменении(Элемент)
	НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Заведение) Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Дата) Тогда
		Возврат;	
	КонецЕсли;

	ПриИзмененииНаСервереТЧ(НомерСтроки, Элемент.ТекущиеДанные.Заведение);
	Автосохранение();
КонецПроцедуры


&НаКлиенте
Процедура ПицерияПриИзменении(Элемент)
	НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Заведение) Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Дата) Тогда
		Возврат;	
	КонецЕсли;

	ПриИзмененииНаСервереТЧ(НомерСтроки, Элемент.ТекущиеДанные.Заведение);
	Автосохранение();
КонецПроцедуры


&НаСервере
Процедура Автосохранение()
	Записать();	
КонецПроцедуры

&НаКлиенте
Процедура ТаировоПриИзменении(Элемент)
	НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	ПриИзмененииНаСервереТЧ(НомерСтроки, Элемент.ТекущиеДанные.Заведение);
	Автосохранение();
КонецПроцедуры


&НаСервере
Процедура ПроверкаНакладнойНаУдаление(Ссылка)
	Если Ссылка.Пустая() Тогда
		Возврат ;
	КонецЕсли;
	
	Если Документы.ПриходнаяНакладная.ВладелецДокументаПрихДок(Ссылка) = Перечисления.Заведение.Бухгалтерия Тогда
		УниверсальныеОбработчикиДокументов.УдалениеДокумента(Ссылка);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаболотногоПередУдалением(Элемент, Отказ)
	НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	ПроверкаНакладнойНаУдаление(Элемент.ТекущиеДанные.СсылкаНаПН);
КонецПроцедуры


&НаСервере
Процедура РаспечататьСписокНаСервере()
	
	ТабДок = Новый ТабличныйДокумент;

	Макет = Документы.ДневнойОтчет.ПолучитьМакет("Макет");
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка"); 
	ТабДок.Вывести(ОбластьШапка);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладная.Ссылка КАК Ссылка,
		|	ПриходнаяНакладная.Дата КАК Дата,
		|	ПриходнаяНакладная.Заведение КАК Заведение,
		|	ПриходнаяНакладная.Поставщик КАК Поставщик,
		|	ПриходнаяНакладная.Сумма КАК Сумма,
		|	ПриходнаяНакладная.ВнешнийНомер КАК ВнешнийНомер,
		|	ПриходнаяНакладная.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ГДЕ
		|	ПриходнаяНакладная.ТипНакладной = &ТипНакладной
		|	И ПриходнаяНакладная.ПометкаУдаления = &ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Поставщик,
		|	Дата";
	
	Запрос.УстановитьПараметр("ТипНакладной", Перечисления.ТипРассчетов.БезнальныйРассчет);
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Документы.РасходныйКассовыйОрдер.ПроверкаОплатыПН(Выборка.Ссылка) = Ложь Тогда

			ОбластьИнфо = Макет.ПолучитьОбласть("ДетИнфо"); 
			ОбластьИнфо.Параметры.Заведение=Выборка.Заведение;
			ОбластьИнфо.Параметры.Постащик=Выборка.Поставщик;
			ОбластьИнфо.Параметры.Дата=Выборка.Дата;
			ОбластьИнфо.Параметры.Номер=Выборка.ВнешнийНомер;
			ОбластьИнфо.Параметры.Сумма=Выборка.Сумма;


			ТабДок.Вывести(ОбластьИнфо);
		КонецЕсли;
	КонецЦикла;
	ТабДок.Показать("Список");
КонецПроцедуры


&НаКлиенте
Процедура РаспечататьСписок(Команда)
	
	РаспечататьСписокНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПаустовскогоПередУдалением(Элемент, Отказ)
		НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	ПроверкаНакладнойНаУдаление(Элемент.ТекущиеДанные.СсылкаНаПН);

КонецПроцедуры


&НаКлиенте
Процедура ДерибасовскаяПослеУдаления(Элемент)
		НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	ПроверкаНакладнойНаУдаление(Элемент.ТекущиеДанные.СсылкаНаПН);

КонецПроцедуры


&НаКлиенте
Процедура ТорговаяПослеУдаления(Элемент)
		НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	ПроверкаНакладнойНаУдаление(Элемент.ТекущиеДанные.СсылкаНаПН);

КонецПроцедуры


&НаКлиенте
Процедура ФилатовоПослеУдаления(Элемент)
		НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	ПроверкаНакладнойНаУдаление(Элемент.ТекущиеДанные.СсылкаНаПН);

КонецПроцедуры


&НаКлиенте
Процедура ЛюстдорфПередУдалением(Элемент, Отказ)
		НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	ПроверкаНакладнойНаУдаление(Элемент.ТекущиеДанные.СсылкаНаПН);

КонецПроцедуры


&НаКлиенте
Процедура ТаировоПередУдалением(Элемент, Отказ)
		НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	ПроверкаНакладнойНаУдаление(Элемент.ТекущиеДанные.СсылкаНаПН);

КонецПроцедуры


&НаКлиенте
Процедура НайтиПН(Команда)
	ОткрытьФорму("Отчет.ПоискПоНомеруПН.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ПоискЗаПериод(Команда)
	ОткрытьФорму("Отчет.ПоискЗаПериод.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОбщийСписокПриИзменении(Элемент)
	НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Заведение) Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Дата) Тогда
		Возврат;	
	КонецЕсли;
	
	
	
	ПриИзмененииНаСервереТЧ(НомерСтроки, Элемент.ТекущиеДанные.Заведение);
	Автосохранение();

КонецПроцедуры

&НаКлиенте
Процедура ФильтрПриИзменении(Элемент)
	Объект.ФильтрЗаведение = "";
	НовыйПолучитьИнформациюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрЗаведениеПриИзменении(Элемент)
	Объект.Фильтр = "";
	НовыйПолучитьИнформациюНаСервере();
КонецПроцедуры

&НаСервере
Процедура НайтиПоНомеруНаСервере()
	Если ЗначениеЗаполнено(Объект.ПоискПоНомеру)=Ложь Тогда
		Сообщить("Заполните номер накладной");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладная.Ссылка КАК Ссылка,
		|	ПриходнаяНакладная.ВнешнийНомер КАК ВнешнийНомер,
		|	РасходныйКассовыйОрдер.СсылкаНаНакладную КАК СсылкаНаНакладную,
		|	РасходныйКассовыйОрдер.Дата КАК Дата
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|		ПО ПриходнаяНакладная.Ссылка = РасходныйКассовыйОрдер.РасчетныйСчет
		|ГДЕ
		|	ПриходнаяНакладная.ВнешнийНомер = &ВнешнийНомер";
	
	Запрос.УстановитьПараметр("ВнешнийНомер", Объект.ПоискПоНомеру);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Сообщить("Накладная с номером " + Строка(Объект.ПоискПоНомеру) + " была оплачена " + Строка(Формат(Выборка.Дата,"ДФ=dd.MM")));	
		Возврат;
	КонецЦикла;
	
	Сообщить("Оплата не была найдена!");

КонецПроцедуры

&НаКлиенте
Процедура НайтиПоНомеру(Команда)
	НайтиПоНомеруНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПН(Команда)
	ОткрытьФорму("Документ.ПриходнаяНакладная.Форма.ФормаДокумента");
КонецПроцедуры

&НаСервере
Процедура Пиво1ПолученоПриИзмененииНаСервере()
		
	ТЧ = Объект.Пиво;
	Для Каждого Выборка Из ТЧ Цикл
		
		Если Выборка.Получено = Истина Тогда
			Если ЗначениеЗаполнено(Выборка.СсылкаНаПН) Тогда
				Если Документы.ПодтверждениеДокумента.СсылкаДокПодтверждения(Выборка.СсылкаНаПН) = Неопределено Тогда 
					Документы.ПодтверждениеДокумента.СозданиеДокументаПодтверждения(Выборка.СсылкаНаПН,Объект.Дата);	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Пиво1ПолученоПриИзменении(Элемент)
	
	Пиво1ПолученоПриИзмененииНаСервере();
КонецПроцедуры



