
&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияВыволненияЗадачСрезПоследних.СтатусВыполнения КАК СтатусВыполнения,
		|	ИсторияВыволненияЗадачСрезПоследних.СсылкаНаЗадачу КАК СсылкаНаЗадачу,
		|	ИсторияВыволненияЗадачСрезПоследних.Сотрудник КАК Сотрудник,
		|	ИсторияВыволненияЗадачСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ИсторияВыволненияЗадач.СрезПоследних КАК ИсторияВыволненияЗадачСрезПоследних
		|ГДЕ
		|	ИсторияВыволненияЗадачСрезПоследних.Сотрудник = &Сотрудник
		|	И ИсторияВыволненияЗадачСрезПоследних.СтатусВыполнения <> &СтатусВыполнения";
	
	Запрос.УстановитьПараметр("Сотрудник", Объект.Сотрудник);
	Запрос.УстановитьПараметр("СтатусВыполнения", Перечисления.СостояниеЗадач.Завершенно);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.СписокЗадач.Добавить();
		НоваяСтрока.СсылкаНаЗадачу = Выборка.Регистратор.СсылкаНаЗадачу.Ссылка;  
		НоваяСтрока.СостояниеЗадачи = Выборка.СтатусВыполнения;
				
	КонецЦикла;
	


КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачВыборНаКлиенте(СсылкаНаЗадачу)
	
КонецПроцедуры


&НаКлиенте
Процедура СписокЗадачВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//СписокЗадачВыборНаСервере(Элемент.ТекущиеДанные.СсылкаНаЗадачу);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаНаЗадачу",Элемент.ТекущиеДанные.СсылкаНаЗадачу); 
	
	ОткрытьФорму("Документ.ВзаимодействиеСЗадачей.Форма.ФормаДокумента",ПараметрыФормы);
КонецПроцедуры
