Функция ОстатокТовара(Номенклатура, Склад) Экспорт 

	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(Номенклатура, "СправочникСсылка.Номенклатура")	Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(Склад, "СправочникСсылка.Склады")	Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваровОстатки.Склад КАК Склад
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(, Номенклатура = &Номенклатура) КАК ОстаткиТоваровОстатки
		|ГДЕ
		|	ОстаткиТоваровОстатки.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();                      													
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
		
	Возврат Выборка.КоличествоОстаток;
	
КонецФункции