
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = Параметры.ВыводЧека > 1;
	Напечатать = Параметры.ВыводЧека;	
	Заголовок = Параметры.Заголовок;			
	
	Макет = Новый ТабличныйДокумент;	
	Область = Макет.Область("R1C1");
	Область.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
	Область.ПараметрКартинки = "Картинка";
	Область.ШиринаКолонки = Область.ШиринаКолонки * ?(Напечатать, 16, 8);
	Область.ГоризонтальноеПоложениеКартинки = ГоризонтальноеПоложение.Центр;
	Макет.Параметры.Картинка = Параметры.Картинка;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.ПолеСнизу = 0;
	ТабличныйДокумент.ПолеСлева = 0; 
	ТабличныйДокумент.ИмяПринтера = Параметры.ИмяПринтера;
	ТабличныйДокумент.Вывести(Макет);
			
	Если Параметры.ВыводЧека = 3 Тогда
		Сообщить("Операція успішно завершена.");
	КонецЕсли;
				
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Напечатать Тогда 
		ТабличныйДокумент.Напечатать();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры
