
&НаСервереБезКонтекста
функция СписокВФайлНаСервере()   
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ                             
	|	ВЫРАЗИТЬ(ДрайверыОборудования.ИдентификаторОбъекта КАК СТРОКА(100)) КАК ИдентификаторОбъекта
	|ИЗ
	|	Справочник.ДрайверыОборудования КАК ДрайверыОборудования
	|ГДЕ
	|	ДрайверыОборудования.Предопределенный
	|	И НЕ ДрайверыОборудования.СнятСПоддержки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
		Если Не ПустаяСтрока(Результат) Тогда
			Результат = Результат + Символы.ПС;
		КонецЕсли;
		Результат = Результат + ВыборкаДетальныеЗаписи.ИдентификаторОбъекта;
	КонецЦикла;                                                            
	
	Возврат Результат;
	
Конецфункции

&НаКлиенте
Процедура ВыборКаталога_Завершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Сообщить("Каталог не выбран");
	Иначе
		ИмяФайла = ВыбранныеФайлы[0] + ПолучитьРазделительПутиКлиента() + "Внешние компоненты.txt";    
		Текст = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.UTF8);
		Текст.Записать(СписокВФайлНаСервере()); 
		Текст.Закрыть();     
		Сообщить("Файл сохранен:" + ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСписокВФайл(Команда)
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 
	Оповещение = Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтотОбъект);
	ДиалогОткрытия.Показать(Оповещение);
	
КонецПроцедуры
