﻿#Область ОбработчикиHTTPСервисов

Функция mainGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки("<h1>Mobile Kasca TEST OK</h1>");
	Возврат Ответ;
КонецФункции

Функция cartGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("{\"success\": true, \"items\": []}");
	Возврат Ответ;
КонецФункции

Функция cartPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("{\"success\": true}");
	Возврат Ответ;
КонецФункции

Функция cartDELETE(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("{\"success\": true}");
	Возврат Ответ;
КонецФункции

Функция sendPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("{\"success\": true}");
	Возврат Ответ;
КонецФункции

#КонецОбласти
