//&НаСервере
//Функция ПроверкаТипаЗадачи()
//	Если Объект.ТипЗадачи = Перечисления.ТипЗадач.ШаблонДляЗаполнения Тогда
//		Возврат 1;
//	Конецесли;
//	
//	Возврат 0;	
//КонецФункции

//&НаКлиенте
//Процедура ОбновитьФорму()
//	Если ПроверкаТипаЗадачи()=1 Тогда
//		Элементы.ШаблонЗаполнения.Видимость=1;
//	Иначе
//		Элементы.ШаблонЗаполнения.Видимость=0;
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	ОбновитьФорму();
//КонецПроцедуры

//&НаКлиенте
//Процедура ПриПовторномОткрытии()
//	ОбновитьФорму();
//КонецПроцедуры

//&НаКлиенте
//Процедура ТипЗадачиПриИзменении(Элемент)
//	ОбновитьФорму();
//КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Объект.ТипЗадачи = Перечисления.ТипЗадач.Задача;
КонецПроцедуры



