#Область ПрограммныйИнтерфейс

#Область РаботаСФормойЭкземпляраОфлайнОборудования

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриСозданииНаСервере".
//
// Параметры:
//  Объект - СправочникОбъект.ОфлайнОборудование - 
//  ЭтаФорма - ФормаКлиентскогоПриложения - 
//  Отказ - Булево - Признак отказа от создания формы
//  Параметры - ДанныеФормыСтруктура - параметры формы
//  СтандартнаяОбработка - Булево - признак выполнения стандартной обработки
//
Процедура ЭкземплярОфлайнОборудованияПриСозданииНаСервере(Объект, ЭтаФорма, Отказ, Параметры, СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриЧтенииНаСервере".
//
// Параметры:
//  ТекущийОбъект - СправочникОбъект.ОфлайнОборудование - Объект, который будет прочитан.
//  ЭтаФорма - ФормаКлиентскогоПриложения
//
Процедура ЭкземплярОфлайнОборудованияПриЧтенииНаСервере(ТекущийОбъект, ЭтаФорма) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗаписьюНаСервере".
//
// Параметры:
//  Отказ - Булево - Признак отказа от записи
//  ТекущийОбъект - СправочникОбъект.ОфлайнОборудование - Записываемый объект
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
Процедура ЭкземплярОфлайнОборудованияПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриЗаписиНаСервере".
//
// Параметры:
//  Отказ - Булево - Признак отказа от записи
//  ТекущийОбъект - СправочникОбъект.ОфлайнОборудование - Записываемый объект
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
Процедура ЭкземплярОфлайнОборудованияПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПослеЗаписиНаСервере".
//
// Параметры:
//  ТекущийОбъект - СправочникОбъект.ОфлайнОборудование - Записанный объект
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
Процедура ЭкземплярОфлайнОборудованияПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ОбработкаПроверкиЗаполненияНаСервере".
//
// Параметры:
//  Объект - СправочникОбъект.ОфлайнОборудование
//  ЭтаФорма - ФормаКлиентскогоПриложения
//  Отказ - Булево - Признак отказа от создания формы
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ЭкземплярОфлайнОборудованияОбработкаПроверкиЗаполненияНаСервере(Объект, ЭтаФорма, Отказ, ПроверяемыеРеквизиты) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия при переносе элемента офлайн оборудования из справочника ПодключаемоеОборудование
// в справочник ОфлайнОборудование.
//
// Параметры:
//  СсылкаНаПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование - ссылка на перемещаемый элемент
//  СсылкаНаОфлайнОборудование - СправочникСсылка.ОфлайнОборудование - ссылка на аналогичный объект в справочнике ОфлайнОборудование
//
Процедура ОбработатьПереходСправочникаПодключаемоеОборудованиеНаОфлайнОборудование(СсылкаНаПодключаемоеОборудование, СсылкаНаОфлайнОборудование) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия для обработки объектов прикладной конфигурации при переходе на новый
// справочник "ОфлайнОборудование".
//
Процедура ДополнительнаяОбработкаОбъектовПриПереходеНаОфлайнОборудование() Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти