
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!

	// регістр ИсторияВыволненияЗадач
	Движения.ИсторияВыволненияЗадач.Записывать = Истина;
	Движение = Движения.ИсторияВыволненияЗадач.Добавить();
	Движение.Период = Дата;
	Движение.СсылкаНаЗадачу = СсылкаНаЗадачу;
	Движение.СтатусВыполнения = ТекущееСостояние;
	Движение.Сотрудник = Исполнитель;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
