
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьПодключаемоеОборудование = _ДемоПодключаемоеОборудованиеВызовСервера.ИспользоватьПодключаемоеОборудование();
	
КонецПроцедуры

// Процедура - Обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СчитывательМагнитныхКарт");
	// Конец ПодключаемоеОборудование.
	
КонецПроцедуры

// Процедура - обработчик события "ПриЗакрытии" формы.
//
&НаКлиенте
Процедура ПриЗакрытии()
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

// Процедуры - обработчик события "ОбработкаОповещения" формы.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен () Тогда
		Если ИмяСобытия = "TracksData" Тогда
			Если Параметр.СписокШаблонов <> Неопределено И Параметр.СписокШаблонов.Количество() > 0 Тогда
				Объект.НомерКарты = Параметр.СписокШаблонов[0].ДанныеДорожек[0].ЗначениеПоля;
			Иначе
				Объект.НомерКарты = Параметр.КодКарты;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
КонецПроцедуры

// Процедура - обработчик события "ОбработкаПроверкиЗаполненияНаСервере" формы.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ _ДемоПодключаемоеОборудованиеВызовСервера.ПроверитьУникальностьМагнитногоКода(
		ДанныеФормыВЗначение(Объект,Тип("СправочникОбъект._ДемоКлиенты"))) Тогда
		ТекстСообщения = НСтр("ru = 'Карта с данным номером уже зарегистрирована в системе'");
		ОбщегоНазначенияБПО.СообщитьПользователю(ТекстСообщения,Объект.Ссылка,"НомерКарты");
		Отказ = Истина;
	КонецЕсли;
	
	АдресЭП = Объект.ЭлектроннаяПочта;
	Если НЕ _ДемоПодключаемоеОборудованиеВызовСервера.ПроверитьКорректностьЗаписиАдресаЭлектроннойПочты(АдресЭП) Тогда
		ТекстСообщения = НСтр("ru = 'Указан некорректный адрес электронной почты'");
		ОбщегоНазначенияБПО.СообщитьПользователю(ТекстСообщения,Объект,"Элементы.ЭлектроннаяПочта");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события "ПриИзменении" поля ввода Электронная почта.
//
&НаКлиенте
Процедура ЭлектроннаяПочтаПриИзменении(Элемент)
	
	Объект.ЭлектроннаяПочта = СокрЛП(Объект.ЭлектроннаяПочта);
	
КонецПроцедуры

#КонецОбласти


