
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка._ДемоОтчетОПродажах") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Чек.ФормаОплаты,
		|	Чек.Товары
		|ИЗ
		|	Документ._ДемоОтчетОПродажах КАК Чек
		|ГДЕ
		|	Чек.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения.Ссылка);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			ФормаОплаты = Выборка.ФормаОплаты;
			Товары.Загрузить(Выборка.Товары.Выгрузить());
		КонецЕсли;
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;  
	
КонецПроцедуры

#КонецОбласти