#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеНоменклатуры

&НаКлиенте
Процедура ДанныеНоменклатурыШтрихКодПриИзменении(Элемент)
	ЗаполненыйШтрихКод = Элементы.ДанныеНоменклатуры.ТекущиеДанные.ШтрихКод;    
	НомерСтроки = Элементы.ДанныеНоменклатуры.ТекущаяСтрока;

	ШтрихКод = Формат(ЗаполненыйШтрихКод, "ЧРГ=' '; ЧГ=0");
	Если ШтрихКод = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Номенклатура = ПоискПоШтрихкодуНаСервере(Число(ШтрихКод));	
	Если Номенклатура = Неопределено Тогда 
		Ответ = Вопрос("Товар не был обнаружен, перейти к созданию нового товара?", РежимДиалогаВопрос.ДаНет); 
		Если Ответ = КодВозвратаДиалога.Да Тогда
			// Открытие формы
			ПараметрыФормы = Новый Структура("Штрихкод", ЗаполненыйШтрихКод);
			ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы);
		КонецЕсли;
		
		Возврат;
	КонецЕсли;	
	
	ЗаполнитьДанныеНоменклатуры(Номенклатура,НомерСтроки);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеНоменклатуры(Номенклатура, НомерСтроки)
	
	НайденнаяСтрока = Объект.ДанныеНоменклатуры.НайтиПоИдентификатору(НомерСтроки);
	Если НайденнаяСтрока = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Строка не была обнаружена!";
		Сообщение.Поле = "ДанныеНоменклатуры[" + Формат(НомерСтроки, "ЧГ=0") + "]";
		Сообщение.Сообщить();
	Иначе
		НайденнаяСтрока.Номенклатура = Номенклатура;
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			НайденнаяСтрока.Цена = Справочники.Номенклатура.ПолучитьЦенуТовара(Номенклатура);
			НайденнаяСтрока.Остаток = РегистрыНакопления.ОстаткиТоваров.ОстатокТовара(Номенклатура, Объект.Склад);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСуммы(Элемент)
	Цена = Элементы.ДанныеНоменклатуры.ТекущиеДанные.Цена;
  	Остаток = Элементы.ДанныеНоменклатуры.ТекущиеДанные.Остаток;
	Элементы.ДанныеНоменклатуры.ТекущиеДанные.Сумма = Цена * Остаток;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьДанныеЦен(Команда)
	Ответ = Вопрос("Создать документ переоценки?", РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		ОбработатьДанныеЦенНаСервере();     
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработатьДанныеЦенНаСервере()
	
	ТЗ_Переоценка = Новый ТаблицаЗначений;
	ТЗ_Переоценка.Колонки.Добавить("Номенклатура");
	ТЗ_Переоценка.Колонки.Добавить("Цена");
	
	Для Каждого Данные Из Объект.ДанныеНоменклатуры Цикл
		Если НЕ ЗначениеЗаполнено(Данные.Номенклатура) ИЛИ Данные.Цена=0 Тогда	
			Сообщить("В строка " + Данные.НомерСтроки + " заполнены не все данные!");
			Продолжить;
		КонецЕсли;   
		
		НоваяСтрока = ТЗ_Переоценка.Добавить();
		НоваяСтрока.Номенклатура = Данные.Номенклатура;
		НоваяСтрока.Цена = Данные.Цена;
		
	КонецЦикла;   
	
	Документы.Переоценка.СоздатьДокументПереоценки(ТЗ_Переоценка, ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеДанных(Команда)
	ПроверитьЗаполнениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеНаСервере(Отказ = Ложь)
  
  Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
    Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = "Заполните склад!";
    Сообщение.Поле = "Объект.Склад";
    Сообщение.УстановитьДанные(Объект);
    Сообщение.Сообщить();
    Отказ = Истина;
  КонецЕсли;
  
  // Проверяем незаполненные строки
  Для ИндексСтроки = 0 По Объект.ДанныеНоменклатуры.Количество() - 1 Цикл
    СтрокаТаблицы = Объект.ДанныеНоменклатуры[ИндексСтроки];
    НомерСтрокиСообщения = ИндексСтроки + 1;
    
    Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
      Сообщение = Новый СообщениеПользователю;
      Сообщение.Текст = "В строке " + НомерСтрокиСообщения + " не заполнена номенклатура!";
      Сообщение.Поле = "Объект.ДанныеНоменклатуры[" + ИндексСтроки + "].Номенклатура";
      Сообщение.УстановитьДанные(Объект);
      Сообщение.Сообщить();
      Отказ = Истина;
    КонецЕсли;
    
    Если Не ЗначениеЗаполнено(СтрокаТаблицы.Цена) Тогда
      Сообщение = Новый СообщениеПользователю;
      Сообщение.Текст = "В строке " + НомерСтрокиСообщения + " не заполнена цена!";
      Сообщение.Поле = "Объект.ДанныеНоменклатуры[" + ИндексСтроки + "].Цена";
      Сообщение.УстановитьДанные(Объект);
      Сообщение.Сообщить();
      Отказ = Истина;
    КонецЕсли;
    
  КонецЦикла;
  
КонецПроцедуры

//&НаСервере
//Процедура ПроверитьЗаполнениеНаСервере()
//	
//	Если Объект.Склад.Пустая() Тогда
//		Сообщение = Новый СообщениеПользователю;
//		Сообщение.Текст = "Заполните склад!";
//		Сообщение.Поле = "Объект.Склад";
//		Сообщение.УстановитьДанные(Объект.Склад);
//		Сообщение.Сообщить();   
//	КонецЕсли;
//	
//	//проверяем незаполненые
//	Для Каждого Данные Из Объект.ДанныеНоменклатуры Цикл
//		
//		Если Не ЗначениеЗаполнено(Данные.Номенклатура) Тогда
//			Сообщение = Новый СообщениеПользователю;
//			Сообщение.Текст = "Не заполнен товар в строке " + Данные.НомерСтроки;
//			Сообщение.Сообщить();    
//		КонецЕсли;
//		
//		Если Не ЗначениеЗаполнено(Данные.Цена) Тогда
//			Сообщение = Новый СообщениеПользователю;
//			Сообщение.Текст = "Не заполнена цена в строке " + Данные.НомерСтроки;
//			Сообщение.Сообщить();    
//		КонецЕсли;

//	КонецЦикла;
//КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоискПоШтрихкодуНаСервере(Штрихкод) 
	
	Возврат Справочники.Номенклатура.ГлобальныйПоискПоШтрихКоду(Штрихкод);
	
КонецФункции // ПоискПоШтрихкодуНаСервере()

&НаКлиенте
Процедура ОбработатьОстатки(Команда)
	ОбработатьОстаткиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбработатьОстаткиНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните склад!";
		Сообщение.Поле = "Объект.Склад";   
		Сообщение.УстановитьДанные(Объект.Склад);
		Сообщение.Сообщить();
		Возврат;                       
	КонецЕсли;
	
	ТЗ_Остаток = Новый ТаблицаЗначений;
	ТЗ_Остаток.Колонки.Добавить("Номенклатура");
	ТЗ_Остаток.Колонки.Добавить("Остаток");
	
	Для Каждого Данные Из Объект.ДанныеНоменклатуры Цикл
		Если НЕ ЗначениеЗаполнено(Данные.Номенклатура) ИЛИ Данные.Остаток=0 Тогда	
			Сообщить("В строка " + Данные.НомерСтроки + " заполнены не все данные!");
			Продолжить;
		КонецЕсли;   
		
		НоваяСтрока = ТЗ_Остаток.Добавить();
		НоваяСтрока.Номенклатура = Данные.Номенклатура;
		НоваяСтрока.Остаток = Данные.Остаток;
		
	КонецЦикла;   
	
	Документы.ВводОстатокТовараНаСкладе.СоздатьДокументВводОстатков(ТЗ_Остаток, Объект.Склад, ТекущаяДата());
КонецПроцедуры

#КонецОбласти






