#Область ОткрытьСмену

&НаСервере
Процедура ОбновлениеФормыСменаОткыта()
	
	Элементы.ОткрытьСмену.Доступность=Ложь;
	Объект.СменаОткрыта=Истина;
	Элементы.Страницы.Доступность=Истина;
	
КонецПроцедуры


&НаСервере
Функция УстановитьСсылкуПрошОтчета()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДневнойОтчет.Заведение КАК Заведение,
		|	ДневнойОтчет.ДатаСмены КАК ДатаСмены,
		|	ДневнойОтчет.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ДневнойОтчет КАК ДневнойОтчет
		|ГДЕ
		|	ДневнойОтчет.ДатаСмены = &ДатаСмены
		|	И ДневнойОтчет.Заведение = &Заведение";
	
	Запрос.УстановитьПараметр("ДатаСмены", НачалоДня(Объект.ДатаСмены-86400));
	Запрос.УстановитьПараметр("Заведение", Объект.Заведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
КонецФункции


&НаСервере
Процедура ЗаполнениеОбезательныхЗначений()
	
	ОбновлениеФормыСменаОткыта();
	Если Объект.Заведение.Пустая() Тогда
		Объект.Заведение=ПодготовкаДанных.ПолучениеПользователя();
	КонецЕсли;	
	Если ЗначениеЗаполнено(Объект.ДатаСмены)=0 Тогда
		Объект.ДатаСмены = ТекущаяДата();
	КонецЕсли;
	Объект.Дата=Объект.ДатаСмены;
	Объект.СсылкаНаВчерашнийОтчет = УстановитьСсылкуПрошОтчета();
	

	
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьДолгЗакупщикуНаСервере()
	
	ДолгПоЗакупке = Объект.СсылкаНаВчерашнийОтчет.ПолучитьОбъект();
	
	//получаем все долги перед закупщиком кроме прошлой смены
	Для Каждого Выборка Из ДолгПоЗакупке.ЗадолжнотиЗакупщика Цикл
		
		Если Выборка.ТекущаяЗакупка = Ложь Тогда
			Если Выборка.Неоплачено > 0 Тогда
				ЗадолжностьЗакупщика = Объект.ЗадолжнотиЗакупщика.Добавить();
				ЗадолжностьЗакупщика.Тип = Перечисления.ТипыЗадолжностей.Долг;

				ЗадолжностьЗакупщика.Дата = Выборка.Дата;
				ЗадолжностьЗакупщика.СуммаТекущейЗакупки = Выборка.Неоплачено; 
				ЗадолжностьЗакупщика.Неоплачено = Выборка.Неоплачено; 
			КонецЕсли
		КонецЕсли;
		
	КонецЦикла;
	
	//задолжность за вчерашнюю смену
	ЗадолжностьЗакупщика = Объект.ЗадолжнотиЗакупщика.Добавить();
	ЗадолжностьЗакупщика.Тип = Перечисления.ТипыЗадолжностей.Долг;

	ЗадолжностьЗакупщика.Дата = ДолгПоЗакупке.ДатаСмены;
	ЗадолжностьЗакупщика.СуммаТекущейЗакупки = ДолгПоЗакупке.ДолгПоЗакупке; 
	ЗадолжностьЗакупщика.Неоплачено = ДолгПоЗакупке.ДолгПоЗакупке;	

	Записать();
	
	
КонецПроцедуры


&НаСервере
Процедура ЗагрузкаЗадолжностейПоПиву()
	Для Каждого Выборка Из Объект.СсылкаНаВчерашнийОтчет.РассчетыПоПиву Цикл
		Если Выборка.Оплачено = Ложь Тогда
			ДобавитьДолгПоПиву(Выборка.ДатаНакладной, Выборка.Заведение, Выборка.СуммаЗадолжности);	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ЗагрузкаДолговПоЗП()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДневнойОтчетНеОплаченыеЗП.Ссылка КАК Ссылка,
		|	ДневнойОтчетНеОплаченыеЗП.Сотрудник КАК Сотрудник,
		|	ДневнойОтчетНеОплаченыеЗП.Сумма КАК Сумма
		|ИЗ
		|	Документ.ДневнойОтчет.НеОплаченыеЗП КАК ДневнойОтчетНеОплаченыеЗП
		|ГДЕ
		|	ДневнойОтчетНеОплаченыеЗП.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.СсылкаНаВчерашнийОтчет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Сумма > 0 Тогда
			ЗадолжностьПоЗП = Объект.НеОплаченыеЗП.Добавить();
			ЗадолжностьПоЗП.Сотрудник = Выборка.Сотрудник;
			ЗадолжностьПоЗП.Сумма = Выборка.Сумма;
			ЗадолжностьПоЗП.НачальнаяСумма = Выборка.Сумма;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ЗагузкаДолговыхПН()
	
	Долговые = Объект.СсылкаНаВчерашнийОтчет.ПолучитьОбъект();
	Для Каждого Выборка Из Долговые.ДолговыеНакладные Цикл
		Если Выборка.Оплачен = Ложь Тогда
			Если Выборка.Ошибка = Ложь Тогда
				Если Выборка.Сумма > 0 Тогда
					ДолговаяПН = Объект.ДолговыеНакладные.Добавить();
					ДолговаяПН.Дата=Выборка.Дата;
					ДолговаяПН.Поставщик=Выборка.Поставщик;
					ДолговаяПН.Сумма=Выборка.Сумма;
				КонецЕсли;
	 		КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Выборка Из Долговые.Накладные Цикл
		Если Выборка.Закупщик = Ложь Тогда
			Если Выборка.Оплачено = Ложь Тогда
				Если Выборка.Сумма > 0 Тогда
					ДолговаяПН = Объект.ДолговыеНакладные.Добавить();
					ДолговаяПН.Дата=Долговые.ДатаСмены;
					ДолговаяПН.Поставщик=Выборка.Поставщик;
					ДолговаяПН.Сумма=Выборка.Сумма;
				КонецЕсли;
	 		КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры


&НаСервере
Процедура ЗаполнениеРеквезитовИзШаблона()
	
	//основная информация	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныЗаполненийОсновныеСтатьи.Ссылка.Заведение КАК Заведение,
		|	ШаблоныЗаполненийОсновныеСтатьи.СтатьиРасходов КАК СтатьиРасходов
		|ИЗ
		|	Документ.ШаблоныЗаполнений.ОсновныеСтатьи КАК ШаблоныЗаполненийОсновныеСтатьи
		|ГДЕ
		|	ШаблоныЗаполненийОсновныеСтатьи.Ссылка.Заведение = &Заведение
		|
		|УПОРЯДОЧИТЬ ПО
		|	ШаблоныЗаполненийОсновныеСтатьи.НомерСтроки";
	
	Запрос.УстановитьПараметр("Заведение", Объект.Заведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОснИнф = Объект.ОсновнаяИнформация.Добавить();
		ОснИнф.Статья = Выборка.СтатьиРасходов;
	КонецЦикла;
	
	//расходы	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныЗаполненийРасходы.Ссылка.Заведение КАК Заведение,
		|	ШаблоныЗаполненийРасходы.Статья КАК Статья
		|ИЗ
		|	Документ.ШаблоныЗаполнений.Расходы КАК ШаблоныЗаполненийРасходы
		|ГДЕ
		|	ШаблоныЗаполненийРасходы.Ссылка.Заведение = &Заведение
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";

	
	Запрос.УстановитьПараметр("Заведение", Объект.Заведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Расходы = Объект.Расходы.Добавить();
		Расходы.Статья = Выборка.Статья;
	КонецЦикла;
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныЗаполненийЗакупщик.Статья КАК Статья,
		|	ШаблоныЗаполненийЗакупщик.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.ШаблоныЗаполнений.Закупщик КАК ШаблоныЗаполненийЗакупщик
		|ГДЕ
		|	ШаблоныЗаполненийЗакупщик.Ссылка.Заведение = &Заведение
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Заведение", Объект.Заведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОплЗакуп = Объект.ЗадолжнотиЗакупщика.Добавить();
		ОплЗакуп.Дата = Объект.ДатаСмены;
		ОплЗакуп.Тип = Выборка.Статья;
		ОплЗакуп.ТекущаяЗакупка = Истина;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	Если Объект.Заведение = Перечисления.Заведение.ПицерияЗаболотного Тогда
			//зп
			 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Даний фрагмент побудований конструктором.
		// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!
		Заведение = Объект.Заведение;	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ШаблоныЗаполненийЗПСписок.Ссылка.Заведение КАК Заведение,
			|	ШаблоныЗаполненийЗПСписок.Ссылка.АвтоРасчетЗП КАК АвтоРасчетЗП,
			|	ШаблоныЗаполненийЗПСписок.Сотрудник КАК Сотрудник,
			|	ШаблоныЗаполненийЗПСписок.НомерСтроки КАК НомерСтроки,
			|	ШаблоныЗаполненийЗПСписок.ПН КАК ПН,
			|	ШаблоныЗаполненийЗПСписок.ВТ КАК ВТ,
			|	ШаблоныЗаполненийЗПСписок.СР КАК СР,
			|	ШаблоныЗаполненийЗПСписок.ЧТ КАК ЧТ,
			|	ШаблоныЗаполненийЗПСписок.ПТ КАК ПТ,
			|	ШаблоныЗаполненийЗПСписок.СБ КАК СБ,
			|	ШаблоныЗаполненийЗПСписок.ВС КАК ВС
			|ИЗ
			|	Документ.ШаблоныЗаполнений.ЗПСписок КАК ШаблоныЗаполненийЗПСписок
			|ГДЕ
			|	ШаблоныЗаполненийЗПСписок.Ссылка.Заведение = &Заведение
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
		
		Запрос.УстановитьПараметр("Заведение", Объект.Заведение);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
			Пока Выборка.Следующий() Цикл

				ЗП = Объект.Зарплаты.Добавить();
				ЗП.Сотрудник = Выборка.Сотрудник;
				ЗП.Выдана = Истина;
			КонецЦикла;
		
		//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

			//накладные
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ШаблоныЗаполненийПоставщики.Ссылка КАК Ссылка,
			|	ШаблоныЗаполненийПоставщики.Поставщик КАК Поставщик,
			|	ШаблоныЗаполненийПоставщики.Закупщик КАК Закупщик
			|ИЗ
			|	Документ.ШаблоныЗаполнений.Поставщики КАК ШаблоныЗаполненийПоставщики
			|ГДЕ
			|	ШаблоныЗаполненийПоставщики.Ссылка.Заведение = &Заведение";
		
		Запрос.УстановитьПараметр("Заведение", Объект.Заведение);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ПН = Объект.Накладные.Добавить();
			ПН.Поставщик = Выборка.Поставщик;	
			ПН.Закупщик = Выборка.Закупщик;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОткрытьСменуНаСервере()
	
	ЗаполнениеОбезательныхЗначений();
	
	ЗаполнениеРеквезитовИзШаблона();
	
	Если Объект.Заведение = Перечисления.Заведение.Люстдорф Тогда
		ЗагрузитьКухоныеЗПНаСервере();		
	КонецЕсли;
	
	ЗагузкаДолговыхПН();
	
	ЗагрузитьДолгЗакупщикуНаСервере();
	
	ЗагрузкаДолговПоЗП();
	
	ЗагрузкаЗадолжностейПоПиву();
	
	ФормированиеВидаФормы();
	
	БалансНаСервере();
	
	ОбновитьДолгНаСервере();
		
	АвтосохранениеДокументаНаСервере();

КонецПроцедуры


&НаКлиенте
Процедура ОткрытьСмену(Команда)
	ОткрытьСменуНаСервере();
	Сообщить("Смена успешно открыта!");
КонецПроцедуры


#КонецОбласти


#Область РаботаСФормами

&НаСервере
Процедура ОтображениеФормыАдминистратора()
	
	Элементы.АдминПанель.Видимость=Истина;
	Элементы.НаКонецДня.Видимость=Истина;
	Элементы.СсылкаНаВчерашнийОтчет.Видимость=Истина;
	Элементы.ИнформацияНаКонецСмены.Видимость=Истина;
	Элементы.Заведение.Доступность=Истина;
	Элементы.ДатаСмены.Доступность=Истина;
	Элементы.Дата.Видимость=Истина;
	Элементы.НеОплаченыеЗП.Видимость=Истина;
	Элементы.ИнформацияПоПиву.Видимость=Истина;
	Элементы.ОтгрузкиПива.Видимость=Истина;
	Элементы.РассчетыПоПиву.Видимость=Истина;
	Элементы.КассыОфициантов.Видимость = Истина;
	Элементы.СтраницаСменаКухни.Видимость = Истина;
	Элементы.СтраницаНеоплаченныеЗП.Видимость = Истина;   
	Элементы.СтраницаОтгрузкиПива.Видимость = Истина; 
	
КонецПроцедуры

&НаСервере
Процедура ОтображениеФормыПользователя()
	
	Если Объект.Заведение = Перечисления.Заведение.Люстдорф Тогда
		Элементы.НеОплаченыеЗП.Видимость = Истина;
		Элементы.ИнформацияПоПиву.Видимость = Истина;
		Элементы.ОтгрузкиПива.Видимость = Истина;
		Элементы.РассчетыПоПиву.Видимость = Истина;
		Элементы.КассыОфициантов.Видимость = Истина;
		Элементы.СтраницаСменаКухни.Видимость = Истина;
		Элементы.СтраницаНеоплаченныеЗП.Видимость = Истина;   
		Элементы.СтраницаОтгрузкиПива.Видимость = Истина;  
	КонецЕсли;
	
	Если Объект.Заведение = Перечисления.Заведение.ПицерияЗаболотного Тогда
    	Элементы.Шапка3.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ФормаСменаОткрыта()
	
	Элементы.Страницы.Доступность=Истина;
	Элементы.ОткрытьСмену.Доступность=Ложь;
	
КонецПроцедуры


&НаСервере
Процедура ФормаСменаЗакрыта()
	
	Элементы.Страницы.Доступность=Истина;	
	
КонецПроцедуры


&НаСервере
Процедура ФормированиеВидаФормы()
	
	Если Объект.СменаОткрыта=Истина Тогда
		ФормаСменаОткрыта();	
	Иначе
		ФормаСменаЗакрыта();
	КонецЕсли;

	Если ПодготовкаДанных.ПолучениеПользователя() = Перечисления.Заведение.Администратор Тогда
		ОтображениеФормыАдминистратора();	
	Иначе
		ОтображениеФормыПользователя();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	ФормированиеВидаФормы();
	Если Объект.СменаОткрыта = Истина Тогда
		БалансНаСервере();
		
		АвтосохранениеДокументаНаСервере();
		ОбновитьДолгНаСервере();
		ОбновитьУдаленыеСчета();
	КонецЕсли;
	
	
КонецПроцедуры


&НаСервере
Функция ПроверкаПравДоступа()
	Если Объект.Заведение.Пустая() Тогда
		Возврат Истина;  
	КонецЕсли;
	
	Если ПодготовкаДанных.ПолучениеПользователя() <> Перечисления.Заведение.Администратор Тогда	
		Если ПодготовкаДанных.ПолучениеПользователя() = Объект.Заведение Тогда
			Возврат Истина;
		КонецЕсли;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
	Сообщить("Попытка открыть отчет другого заведения!  В доступе отказано!!!");
	Возврат Ложь;                                                                      
КонецФункции
	
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ЭтотОбъект.ЗаблокироватьДанныеФормыДляРедактирования();
	//Если ПроверкаПравДоступа() = Ложь Тогда
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	//
	//ПриОткрытииНаСервере();

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
КонецПроцедуры


&НаКлиенте
Процедура ПриПовторномОткрытии()
	ПриОткрытииНаСервере();
КонецПроцедуры


#КонецОбласти



#Область АвтозаполенияИПроверки

&НаСервере
Процедура ПроверкаНаЗаполнение()
	
	
	
КонецПроцедуры

#КонецОбласти


#Область РаботаСПечатнымОтчетом


&НаСервере
Функция  ИнформацияСоВчерашнегоОтчета() 
	СуммаОставленоНаЗакуп = 0;
	ОставленоНаЗакуп = Объект.СсылкаНаВчерашнийОтчет.ПолучитьОбъект();
	Для Каждого Строка Из ОставленоНаЗакуп.ОсновнаяИнформация Цикл
		
		Если Строка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.ОставленоНаЗакупку Тогда
			СуммаОставленоНаЗакуп = Строка.Сумма;
			Возврат СуммаОставленоНаЗакуп;  	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СуммаОставленоНаЗакуп;
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ДневнойОтчетИнформацияНаКонецСмены.Информация КАК Информация,
	//	|	ДневнойОтчетИнформацияНаКонецСмены.Ссылка КАК Ссылка,
	//	|	ДневнойОтчетИнформацияНаКонецСмены.Сумма КАК Сумма
	//	|ИЗ
	//	|	Документ.ДневнойОтчет.ИнформацияНаКонецСмены КАК ДневнойОтчетИнформацияНаКонецСмены
	//	|ГДЕ
	//	|	ДневнойОтчетИнформацияНаКонецСмены.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Ссылка", Объект.СсылкаНаВчерашнийОтчет);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//
	//НаКонецДня = 0;
	//НаЗакупку = 0;
	//Пока Выборка.Следующий() Цикл
	//	Если Выборка.Информация=Перечисления.СтандартнаяИнформацияОСмене.БалансНаКонецДня Тогда
	//		НаКонецДня =  Выборка.Сумма;
	//	ИначеЕсли Выборка.Информация=Перечисления.СтандартнаяИнформацияОСмене.ОставленоНаЗакупку Тогда 
	//		НаЗакупку =  Выборка.Сумма;
	//	КонецЕсли;	
	//КонецЦикла;
	//
	//Если Статья = 1 Тогда
	//	Возврат	НаКонецДня;
	//ИначеЕсли Статья = 2 Тогда
	//	Возврат НаЗакупку;	
	//Иначе
	//	Возврат 0;
	//КонецЕсли;
КонецФункции

&НаСервере
Функция ОсновнаяИнформация(Ссылка,ТабДок,Макет)
		
	СуммаОбщейИнформации = 0;
	Для Каждого Выборка Из Объект.ОсновнаяИнформация Цикл
		Если Выборка.Статья.ДенежноеДвижение=Перечисления.ТипДенежногоДвижения.ПриходныйКассовыйОрдер Тогда
			СуммаОбщейИнформации=СуммаОбщейИнформации+Выборка.Сумма;
		ИначеЕсли Выборка.Статья.ДенежноеДвижение=Перечисления.ТипДенежногоДвижения.РасходныйКассовыйОрдер Тогда
			СуммаОбщейИнформации=СуммаОбщейИнформации-Выборка.Сумма;
		КонецЕсли;
		Если Выборка.Статья.НеотображатьВОтчете = Ложь Тогда  
			
			ОбластьШапкаОсновнаяИнформация = Макет.ПолучитьОбласть("ШапкаОсновнаяИнформация");
			ТекстИнформации=Строка(Выборка.Статья)+": "+Строка(Выборка.Сумма);
			ОбластьШапкаОсновнаяИнформация.Параметры.ТекстДляВывода=ТекстИнформации;
			ТабДок.Вывести(ОбластьШапкаОсновнаяИнформация);
			
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат СуммаОбщейИнформации;
	
КонецФункции

&НаСервере
Функция ОплатаДолговЗакупщика(Ссылка,ТабДок,Макет)
	СуммаОплаченыхДолговЗакупщику = 0;
	Для Каждого Выборка Из Объект.ЗадолжнотиЗакупщика Цикл
		Если Выборка.ТекущаяЗакупка = Ложь Тогда
			Если Выборка.Сумма > 0 Тогда
				СуммаОплаченыхДолговЗакупщику=Выборка.Сумма;
				ОбластьШапкаОсновнаяИнформация = Макет.ПолучитьОбласть("ШапкаОсновнаяИнформация");
				ДатаДолга = СтрЗаменить(Формат(Выборка.Дата,"ДФ=dd.MM.yy"),".24","");
				ТекстИнформации="Отдан долг за "+Строка(ДатаДолга)+" - "+Строка(Выборка.Сумма);
				ОбластьШапкаОсновнаяИнформация.Параметры.ТекстДляВывода=ТекстИнформации;
				ТабДок.Вывести(ОбластьШапкаОсновнаяИнформация);
	        КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СуммаОплаченыхДолговЗакупщику;
	
КонецФункции

&НаСервере
Функция	НеоплаченоДолгаЗакупщика(Ссылка,ТабДок,Макет) 
	
	Для Каждого Выборка Из Объект.ЗадолжнотиЗакупщика Цикл 
		Если Выборка.ТекущаяЗакупка = Ложь Тогда
			Если Выборка.Неоплачено>0 Тогда
				ОбластьДолгЗакупщику = Макет.ПолучитьОбласть("ДолгЗакупщику");
				ОбластьДолгЗакупщику.Параметры.Текст = "Долг закупщику за " + СтрЗаменить(Строка(Формат(Выборка.Дата,"ДФ=dd.MM.yyyy")),".2025","" + " - ");
				ОбластьДолгЗакупщику.Параметры.СуммаДолга=Выборка.Неоплачено;
				ТабДок.Вывести(ОбластьДолгЗакупщику);
		 	КонецЕсли;
		Иначе
			ДолгТекущегоДня = Выборка.Неоплачено;		
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.ДолгПоЗакупке > 0 Тогда 
		ОбластьДолгЗакупщику = Макет.ПолучитьОбласть("ДолгЗакупщику");
		ОбластьДолгЗакупщику.Параметры.Текст = "Долг закупщику за " + СтрЗаменить(Строка(Формат(Объект.ДатаСмены,"ДФ=dd.MM.yyyy")),".2025","" + " - ");
		ОбластьДолгЗакупщику.Параметры.СуммаДолга=ДолгТекущегоДня;
		ТабДок.Вывести(ОбластьДолгЗакупщику);
	КонецЕсли;

КонецФункции

&НаСервере
Функция СдачаСЗакупки(СсылкаНаВчерашнийОтчет,ТекущийБаланс,ТабДок,Макет);
	
	Для Каждого Выборка Из Объект.ЗадолжнотиЗакупщика Цикл
		Если Выборка.ТекущаяЗакупка = Истина Тогда
			ОставленоНаЗакупку = Выборка.ОставленоВчера;
			ЗакупщикСуммаТекущейЗакупки = Выборка.СуммаТекущейЗакупки;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	Если ОставленоНаЗакупку = Неопределено Тогда
		Возврат ТекущийБаланс;
	КонецЕсли;
	
	//получение сдачи на сегодня
	Сдача = ОставленоНаЗакупку - ЗакупщикСуммаТекущейЗакупки;
	Если Сдача > 0 Тогда
		ТекущийБаланс = ТекущийБаланс + Сдача;	
		ОбластьШапкаОсновнаяИнформация = Макет.ПолучитьОбласть("ШапкаОсновнаяИнформация");
		ТекстИнформации="Сдача с закупки: "+Строка(Сдача);
		ОбластьШапкаОсновнаяИнформация.Параметры.ТекстДляВывода=ТекстИнформации;
		ТабДок.Вывести(ОбластьШапкаОсновнаяИнформация);
	КонецЕсли;
	
	Возврат ТекущийБаланс;
КонецФункции
	
&НаСервере
Функция	ПолучениеРасходы(Ссылка,ТекущийБаланс,ТабДок,Макет) 
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
    ТабДок.Вывести(ОбластьПустаяСтрока);

	
	ОбластьРасходыШапка = Макет.ПолучитьОбласть("РасходыШапка");
	ТабДок.Вывести(ОбластьРасходыШапка);

	СуммаРасходов=0;
	СуммаДляПодвалаРасходов=0;

	Для Каждого Выборка Из Объект.Расходы Цикл
		Если Выборка.Сумма > 0 Тогда  
			ТекущийБаланс=ТекущийБаланс-Выборка.Сумма;	
			СуммаРасходов=СуммаРасходов+Выборка.Сумма;
			СуммаДляПодвалаРасходов=СуммаДляПодвалаРасходов+Выборка.Сумма;
			ОбластьШапкаОсновнаяИнформация = Макет.ПолучитьОбласть("ШапкаОсновнаяИнформация");
			ТекстИнформации=Строка(Выборка.Статья)+" "+Выборка.Коментарий+" "+Строка(Выборка.Сумма);
			ОбластьШапкаОсновнаяИнформация.Параметры.ТекстДляВывода=ТекстИнформации;
			ТабДок.Вывести(ОбластьШапкаОсновнаяИнформация);
		КонецЕсли;
	КонецЦикла;
	
	ОбластьРасходыПодвал = Макет.ПолучитьОбласть("РасходыПодвал");
	ОбластьРасходыПодвал.Параметры.СуммаРасходов=СуммаДляПодвалаРасходов;
	ТабДок.Вывести(ОбластьРасходыПодвал);

	
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
    ТабДок.Вывести(ОбластьПустаяСтрока);

	Возврат ТекущийБаланс; 
КонецФункции

&НаСервере
Функция	ПолучениеЗП(Ссылка,ТекущийБаланс,ТабДок,Макет) 
	ОбластьЗПШапка = Макет.ПолучитьОбласть("ЗПШапка");
	ОбластьЗПШапка.Параметры.Текст="З/П";
	ТабДок.Вывести(ОбластьЗПШапка);
	
	СуммаЗП=0;
	Для Каждого Выборка Из Объект.Зарплаты Цикл
		Если Выборка.Выдана = Истина Тогда
			Если Выборка.Сумма > 0 Тогда
				ТекущийБаланс=ТекущийБаланс-Выборка.Сумма;	
				ОбластьЗПДет = Макет.ПолучитьОбласть("ЗПДет");
				ОбластьЗПДет.Параметры.Сотрудник=Выборка.Сотрудник;
				ОбластьЗПДет.Параметры.Сумма=Выборка.Сумма;
				ТабДок.Вывести(ОбластьЗПДет);
				
				СуммаЗП=СуммаЗП+Выборка.Сумма;
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;
	
	
	Для Каждого Выборка Из Объект.НеОплаченыеЗП Цикл
			
			Если Выборка.СуммаВыплаты > 0 Тогда
				ТекущийБаланс=ТекущийБаланс-Выборка.Сумма;	
				ОбластьЗПДет = Макет.ПолучитьОбласть("ЗПДет");
				ОбластьЗПДет.Параметры.Сотрудник=Выборка.Сотрудник;
				ОбластьЗПДет.Параметры.Сумма=Выборка.СуммаВыплаты;
				ТабДок.Вывести(ОбластьЗПДет);
				
				СуммаЗП=СуммаЗП+Выборка.СуммаВыплаты;
	
			КонецЕсли;
			
	КонецЦикла;

	
	ОбластьЗППодвал = Макет.ПолучитьОбласть("ЗППодвал");
	ОбластьЗППодвал.Параметры.Сумма=СуммаЗП;
	ТабДок.Вывести(ОбластьЗППодвал);
	
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
    ТабДок.Вывести(ОбластьПустаяСтрока);
	
	Если Объект.Заведение = Перечисления.Заведение.Люстдорф Тогда
		ОбластьЗПШапка = Макет.ПолучитьОбласть("ЗПШапка");
		ОбластьЗПШапка.Параметры.Текст="З/П Неоплаченые";
		ТабДок.Вывести(ОбластьЗПШапка);
		
		СуммаЗП=0;
		Для Каждого Выборка Из Объект.Зарплаты Цикл
			Если Выборка.Выдана = Ложь Тогда
				ОбластьЗПДет = Макет.ПолучитьОбласть("ЗПДет");
				ОбластьЗПДет.Параметры.Сотрудник=Выборка.Сотрудник;
				ОбластьЗПДет.Параметры.Сумма=Выборка.Сумма;
				ТабДок.Вывести(ОбластьЗПДет);
				
				СуммаЗП=СуммаЗП+Выборка.Сумма;
			КонецЕсли;
		
		КонецЦикла;
		
		
				
		ОбластьЗППодвал = Макет.ПолучитьОбласть("ЗППодвал");
		ОбластьЗППодвал.Параметры.Сумма=СуммаЗП;
		ТабДок.Вывести(ОбластьЗППодвал);
		
		ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	    ТабДок.Вывести(ОбластьПустаяСтрока);
	КонецЕсли;	

	Возврат ТекущийБаланс; 

КонецФункции

&НаСервере
Функция	РасчетДолговыхПН(Ссылка,ТекущийБаланс,Тип,СуммаПН,ТабДок,Макет) 
		
	Для Каждого Выборка Из Объект.ДолговыеНакладные Цикл
		
		Если Выборка.Оплачен = Истина Тогда
			//ОбщаяСуммаПН=ОбщаяСуммаПН+Выборка.СуммаПН;
			Если Тип = 1 Тогда
				СуммаПН=СуммаПН+Выборка.Сумма;
			КонецЕсли;
			
			Если Тип = 2 Тогда
				ТекущийБаланс=ТекущийБаланс-Выборка.Сумма;
				ИнфоПН=Строка(Выборка.Поставщик)+" "+Строка(СтрЗаменить(Формат(Выборка.Дата,"ДФ=dd.MM.yy"),".24",""));
	
				ОбластьЗакупкаДет = Макет.ПолучитьОбласть("ЗакупкаДет");
				ОбластьЗакупкаДет.Параметры.ИнфоПН=ИнфоПН;
				ОбластьЗакупкаДет.Параметры.Сумма=Выборка.Сумма;
				ТабДок.Вывести(ОбластьЗакупкаДет);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Тип = 1 Тогда
		
		Возврат СуммаПН;
		
	ИначеЕсли Тип = 2 Тогда
		
		Возврат ТекущийБаланс;
		
	КонецЕсли;
КонецФункции


&НаСервере
Функция ОплатаТекущихПН(Ссылка,ТабДок,Макет)
	ОбластьЗакупкаШапка = Макет.ПолучитьОбласть("ЗакупкаШапка");
	ТабДок.Вывести(ОбластьЗакупкаШапка);

	СуммаОплаченыхПН=0;
	Для Каждого Выборка Из Объект.Накладные Цикл
		Если Выборка.Сумма > 0 Тогда
			Если (Выборка.Закупщик = Ложь)И (Выборка.Оплачено = Истина) Тогда
				СуммаОплаченыхПН=СуммаОплаченыхПН+Выборка.Сумма;
				ОбластьЗакупщикДет  = Макет.ПолучитьОбласть("ЗакупкаДет");
				ОбластьЗакупщикДет.Параметры.ИнфоПН=Строка(Выборка.Поставщик)+" "+Строка(Выборка.Поставщик.Склад);
				ОбластьЗакупщикДет.Параметры.Сумма=Выборка.Сумма;
				ТабДок.Вывести(ОбластьЗакупщикДет);	
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;

	Возврат СуммаОплаченыхПН;

КонецФункции

&НаСервере
Функция ОплатаДолговыхПН(Ссылка,ТабДок,Макет)
	
	СуммаОплаченДолгПН=0;	
	Для Каждого Выборка Из Объект.ДолговыеНакладные Цикл 
		
		Если Выборка.Оплачен = Истина Тогда
			СуммаОплаченДолгПН = СуммаОплаченДолгПН+Выборка.Сумма;
			ОбластьЗакупщикДет  = Макет.ПолучитьОбласть("ЗакупкаДет");
			ИнфоПН=Строка(Выборка.Поставщик)+" "+Строка(СтрЗаменить(Формат(Выборка.Дата,"ДФ=dd.MM.yy"),".24","")); 
			ОбластьЗакупщикДет.Параметры.ИнфоПН=ИнфоПН;
			ОбластьЗакупщикДет.Параметры.Сумма=Выборка.Сумма;
			ТабДок.Вывести(ОбластьЗакупщикДет);
		КонецЕсли;
	
	КонецЦикла;
	Возврат СуммаОплаченДолгПН;
	
КонецФункции

&НаСервере
Функция Дозакупка(Ссылка,ТабДок,Макет)
	СуммаДозакупки = 0;
	Для Каждого Выборка Из Объект.ЗадолжнотиЗакупщика Цикл
		Если Выборка.ТекущаяЗакупка = Истина Тогда
			СуммаДозакупки = СуммаДозакупки + Выборка.Сумма;	
		КонецЕсли;
	КонецЦикла;
	
	ОбластьЗакупщикДет  = Макет.ПолучитьОбласть("ЗакупкаДет");
	ОбластьЗакупщикДет.Параметры.ИнфоПН="Дозакупка";
	ОбластьЗакупщикДет.Параметры.Сумма=СуммаДозакупки;
	ТабДок.Вывести(ОбластьЗакупщикДет);

	Возврат СуммаДозакупки; 		
КонецФункции

&НаСервере
Функция Закупщик(Ссылка,ТабДок,Макет)
	ОбластьЗакупщикШапка = Макет.ПолучитьОбласть("ЗакупщикШапка");
	ТабДок.Вывести(ОбластьЗакупщикШапка);

	СуммаЗакупщика = 0;	
	Для Каждого Выборка Из Объект.Накладные Цикл
		
		Если Выборка.Закупщик = Истина Тогда 
			СуммаЗакупщика=СуммаЗакупщика+Выборка.Сумма;
			ОбластьЗакупщикДет  = Макет.ПолучитьОбласть("ЗакупкаДет");
			ОбластьЗакупщикДет.Параметры.ИнфоПН=Выборка.Поставщик;
			ОбластьЗакупщикДет.Параметры.Сумма=Выборка.Сумма;
			ТабДок.Вывести(ОбластьЗакупщикДет);
		КонецЕсли;
	
	КонецЦикла;
		
	ОбластьЗакупщикПодвал = Макет.ПолучитьОбласть("ЗакупщикПодвал");
	ОбластьЗакупщикПодвал.Параметры.ЗакупщикСуммаОбщая=СуммаЗакупщика;

	ТабДок.Вывести(ОбластьЗакупщикПодвал);
	
КонецФункции

&НаСервере
Функция НеоплаченыеПН(Ссылка,ТабДок,Макет)
	ОбластьНезакрытыеШапка = Макет.ПолучитьОбласть("НезакрытыеШапка");
	ТабДок.Вывести(ОбластьНезакрытыеШапка);
	

	СуммаНеОплаченПН = 0;
	Для Каждого Выборка Из Объект.Накладные Цикл
		Если Выборка.Сумма > 0 Тогда

			Если (Выборка.Закупщик = Ложь)И(Выборка.Оплачено = Ложь) Тогда
				СуммаНеОплаченПН = СуммаНеОплаченПН + Выборка.Сумма;
				ОбластьЗакупщикДет  = Макет.ПолучитьОбласть("ЗакупкаДет");
				ОбластьЗакупщикДет.Параметры.ИнфоПН=Выборка.Поставщик;
				ОбластьЗакупщикДет.Параметры.Сумма=Выборка.Сумма;
				ТабДок.Вывести(ОбластьЗакупщикДет);	
			КонецЕсли;
		 КонецЕсли;
	КонецЦикла;
	
	
	ОбластьНезакрытыеПодвал = Макет.ПолучитьОбласть("НезакрытыеПодвал");
	ОбластьНезакрытыеПодвал.Параметры.СуммаНеОплаченыхПН=СуммаНеОплаченПН;
	ТабДок.Вывести(ОбластьНезакрытыеПодвал);	
	
КонецФункции


&НаСервере
Функция ОставленоНаЗакупку(Ссылка)
	
	ОставленоНаЗакупку = 0;
	Для Каждого Выборка Из Объект.ОсновнаяИнформация Цикл
		Если Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.ОставленоНаЗакупку Тогда
			ОставленоНаЗакупку = Выборка.Сумма;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОставленоНаЗакупку;
	
КонецФункции

&НаСервере
Процедура ОбновитДанныеНаКонецДня(Статья, ТекущийБаланс)
	
	Для Каждого Строка Из Объект.ИнформацияНаКонецСмены Цикл
		Если Строка.Информация = Статья Тогда
			Строка.Сумма = ТекущийБаланс; 	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьОтчетНаСервере(ТабДок,Ссылка,РежимСохранения)
	Ссылка=Объект.Ссылка;
	Макет = Документы.ДневнойОтчет.ПолучитьМакет("ОтчетПК1");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	НаНачалоСмены = Объект.СсылкаНаВчерашнийОтчет.ПолучитьОбъект();
	НаНачалоСмены = НаНачалоСмены.ТекущийБаланс;
	
	ОбластьШапка.Параметры.Дата = Формат(Объект.ДатаСмены,"ДФ=dd.MM.yy");	
	ОбластьШапка.Параметры.НаНачалоСмены = НаНачалоСмены;
	ТабДок.Вывести(ОбластьШапка);

	
	ВчерашняяДата=Ссылка.ДатаСмены-86400;
	ДатаСмены=НачалоДня(ВчерашняяДата);
	
	//**********БАЛАНС С УЧЕТОМ ОСТАТКА СО ВЧЕРАШНЕЙ КАССЫ***********************	
	
	ТекущийБаланс = НаНачалоСмены;
	//*************РАСЧЕТ ВСЕХ КАТЕГОРИЙ СО СТРАНИЦЫ ОСНОВНОЙ ИНФОРМАЦИИ****************
	СуммаОбщейИнформации = ОсновнаяИнформация(Ссылка,ТабДок,Макет);
	
	ТекущийБаланс = ТекущийБаланс + СуммаОбщейИнформации; 
	СуммаОплаченыхДолговЗакупщику = ОплатаДолговЗакупщика(Ссылка,ТабДок,Макет);
	
	ТекущийБаланс = ТекущийБаланс - СуммаОплаченыхДолговЗакупщику;
	
	НеоплаченоДолгаЗакупщика(Ссылка,ТабДок,Макет);	

	ТекущийБаланс = ПолучениеРасходы(Ссылка,ТекущийБаланс,ТабДок,Макет);
	
	ТекущийБаланс = СдачаСЗакупки(Объект.СсылкаНаВчерашнийОтчет,ТекущийБаланс,ТабДок,Макет);
		
	//РАСЧЕТ ВСЕХ КАТЕГОРИЙ СО СТРАНИЦЫ ЗП****************
	ТекущийБаланс = ПолучениеЗП(Ссылка,ТекущийБаланс,ТабДок,Макет);
	
	СуммаОплаченыхПН = ОплатаТекущихПН(Ссылка,ТабДок,Макет);
	ТекущийБаланс=ТекущийБаланс-СуммаОплаченыхПН;
	
	СуммаОплаченДолгПН = ОплатаДолговыхПН(Ссылка,ТабДок,Макет);
	ТекущийБаланс=ТекущийБаланс-СуммаОплаченДолгПН;
	
	ПредОставленоНаЗакупку = ИнформацияСоВчерашнегоОтчета(); 
	
	СуммаДозакупки = Дозакупка(Ссылка,ТабДок,Макет);	

	
	ТекущийБаланс=ТекущийБаланс-СуммаДозакупки;  
	//закупка
		
	ОбластьОставленоНаЗакупку = Макет.ПолучитьОбласть("ОставленоНаЗакупку");
	ОбластьОставленоНаЗакупку.Параметры.ОставленоНаЗакупку=ОставленоНаЗакупку(Ссылка);
	ТабДок.Вывести(ОбластьОставленоНаЗакупку);
	
	//сумма
	
	ОбластьЗакупкаПодвал = Макет.ПолучитьОбласть("ЗакупкаПодвал");
	СуммаЗакупки=Число(СуммаОплаченыхПН)+Число(СуммаОплаченДолгПН)+Число(СуммаДозакупки)+Число(ПредОставленоНаЗакупку);
	ОбластьЗакупкаПодвал.Параметры.СуммаЗакупки=СуммаЗакупки;
	ТабДок.Вывести(ОбластьЗакупкаПодвал);


	Закупщик(Ссылка,ТабДок,Макет);

	НеоплаченыеПН(Ссылка,ТабДок,Макет);

	//ОбластьПеребор = Макет.ПолучитьОбласть("Перебор");
	//ОбластьПеребор.Параметры.ПереборКухня=СуммаЗакупки;
	//ОбластьПеребор.Параметры.ПереборБар=СуммаЗакупки;
	//ОбластьПеребор.Параметры.ПереборСклад=СуммаЗакупки;
	//ТабДок.Вывести(ОбластьЗакупкаПодвал);

		
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	Если (ТекущийБаланс<2)И(ТекущийБаланс>-2) Тогда 
		ТекущийБаланс=0;
	КонецЕсли;
	//ОбластьПодвал.Параметры.ОстатокНаКонецДня=Окр(ТекущийБаланс,1,1);
	ОбластьПодвал.Параметры.ОстатокНаКонецДня=Объект.ТекущийБаланс;

	ТабДок.Вывести(ОбластьПодвал);
	РассчетЗакупок();
	ПутьКФайлу = ПодготовкаДанных.ФормированияПутьКФайлу(СокрЛП(Константы.ПапкаДляОтчетов.Получить()), Объект.ДатаСмены, Объект.Заведение); 
	//ПолучениеОбщейИнформации.ФормированияПутьКФайлу("E:\Файлы\report\", Объект.ДатаСмены);	
	Если РежимСохранения=1 Тогда	
		
		Попытка
			ТабДок.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.PDF);
		Исключение
			Сообщить(ОписаниеОшибки());	
		КонецПопытки;
		

	//	Объект.ПутьКФайлуОтчета = СокрЛП(ПутьКФайлу);
		
		
		ЗакрытьСмену(ТекущийБаланс);
		
	КонецЕсли;


КонецПроцедуры


Процедура ЗаполнитьЗадолжностьПоЗП(Сотрудик, СуммаВыплаты)
	
	Для Каждого Строка Из Объект.НеОплаченыеЗП Цикл
		Если Строка.Сотрудник = Сотрудик Тогда
			Строка.Сумма = Строка.Сумма + СуммаВыплаты;
			Строка.НачальнаяСумма = Строка.Сумма;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Задолжность = Объект.НеОплаченыеЗП.Добавить();
	Задолжность.Сотрудник = Сотрудик;
	Задолжность.Сумма = СуммаВыплаты;
	Задолжность.НачальнаяСумма = Задолжность.Сумма;
КонецПроцедуры

&НаСервере
Процедура ПереносНеоплаченыхЗП()
		
	Для Каждого Строка Из Объект.Зарплаты Цикл
		Если Строка.ЗПОбработана = Ложь Тогда
			Если Строка.Выдана = Ложь Тогда
				ЗаполнитьЗадолжностьПоЗП(Строка.Сотрудник, Строка.Сумма);	
				Строка.ЗПОбработана =  Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДолгПоПиву(ДатаНакладной, Заведение, СуммаЗадолжности)
	
	ДолгПоПиву = Объект.РассчетыПоПиву.Добавить();
	ДолгПоПиву.ДатаНакладной = ДатаНакладной;
	ДолгПоПиву.Заведение = Заведение;
	ДолгПоПиву.СуммаЗадолжности = СуммаЗадолжности;
	
	Записать();
КонецПроцедуры


&НаСервере
Процедура ПереносЗадолжностейПоПиву()
	
	Для А=1 По 7 Цикл
		Если А=1 Тогда
			Заведение = Перечисления.Заведение.Дерибасовская;		
		ИначеЕсли А=2 Тогда
			Заведение = Перечисления.Заведение.Заболотного;		
		ИначеЕсли А=3 Тогда
			Заведение = Перечисления.Заведение.Паустовского;		
		ИначеЕсли А=4 Тогда
			Заведение = Перечисления.Заведение.ПицерияЗаболотного;	
		ИначеЕсли А=5 Тогда
			Заведение = Перечисления.Заведение.Таирово;		
		ИначеЕсли А=6 Тогда
			Заведение = Перечисления.Заведение.Торговая;		
		ИначеЕсли А=7 Тогда
			Заведение = Перечисления.Заведение.Филатово;		
		КонецЕсли;
		СуммаПН = 0;	
		Для Каждого Строка Из Объект.ОтгрузкиПива Цикл
			Если Строка.Обработано = Ложь Тогда
				Если Строка.Заведение = Заведение Тогда
					СуммаПН = СуммаПН + Строка.Сумма;
					Строка.Обработано = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если СуммаПН > 0 ТОгда
			ДобавитьДолгПоПиву(Объект.ДатаСмены, Заведение, СуммаПН);	
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры


&НаСервере
Процедура ЗакрытьСмену(ТекущийБаланс)
		
	//ОбновитДанныеНаКонецДня(Перечисления.СтандартнаяИнформацияОСмене.БалансНаКонецДня,ТекущийБаланс);
		
	//ПереносДолговыхПН();
	ПереносНеоплаченыхЗП();
	ПереносЗадолжностейПоПиву();
	ВыгрузитьОтчетНаСервере();
		
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьЗПНаСервере()
	
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьЗП(Команда)
	ЗаполнитьЗПНаСервере();
КонецПроцедуры



&НаКлиенте
Процедура ПоказатьОтчет(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПоказатьОтчетНаСервере(ТабДок,Объект.Ссылка,0);
	ТабДок.Показать("Дневной ОтчетПК1");

КонецПроцедуры

//Получение сумм


&НаСервере
Процедура ПереносДолговыхПН()
	ПовторЦикла = Истина;
	Пока ПовторЦикла <> Ложь Цикл
		ПовторЦикла = Ложь;
		Для Каждого Строка Из Объект.ДолговыеНакладные Цикл
			Если Строка.Дата = Объект.ДатаСмены Тогда
				Индекс = Строка.НомерСтроки-1;
				Объект.ДолговыеНакладные.Удалить(Индекс); 
				ПовторЦикла = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;


	
	Для Каждого Выборка Из Объект.Накладные Цикл
		Если Выборка.Закупщик = Ложь Тогда
			Если Выборка.Оплачено = Ложь Тогда
				ДолговаяПН = Объект.ДолговыеНакладные.Добавить();
				ДолговаяПН.Дата = Объект.ДатаСмены;
				ДолговаяПН.Поставщик = Выборка.Поставщик;
				ДолговаяПН.Сумма = Выборка.Сумма;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


//&НаКлиенте
//Процедура ЗакрытьСмену(Команда)
//	ТабДок = Новый ТабличныйДокумент;
//	ПоказатьОтчетНаСервере(ТабДок,Объект.Ссылка,0);
//	ТабДок.Показать("Дневной ОтчетПК1");
//	//
//	////ОтправкаОтчетаВТелеграм();
//КонецПроцедуры

&НаСервере
Процедура ОтправкаОтчетаВТелеграм()
	МойToken = "7869157368:AAGi2jl5kvQ1qjVlh7BqCjL0eOFI72qz1uE"; 
	
	//"7869157368:AAGi2jl5kvQ1qjVlh7BqCjL0eOFI72qz1uE";
	АдресTelegramAPI = "api.telegram.org";
	СсылкаНаЗаведение = Справочники.Заведения.ПолучитьЗаведение(Объект.Заведение);
	Заведение = СсылкаНаЗаведение.ПолучитьОбъект();
	ЧатID = Заведение.ИД_Телеграмм;

	//ЧатID = ПолучениеОбщейИнформации.ПолучениеИДПользователя();

	ПутьКФайлу = ПодготовкаДанных.ФормированияПутьКФайлу(СокрЛП(Константы.ПапкаДляОтчетов.Получить()), Объект.ДатаСмены, Объект.Заведение);
	//ПутьКФайлу = ПолучениеОбщейИнформации.ФормированияПутьКФайлу("E:\Файлы\report\", Объект.ДатаСмены);
	
	Boundary = "----"+Строка(Новый УникальныйИдентификатор());

	Файл = Новый Файл(ПутьКФайлу);

	//Определяем массив для процедуры ОбъединитьФайлы
	МассивФайловДляОбъединения = Новый Массив;

	МассивФайловДляОбъединения.Добавить(ПолучитьИмяВременногоФайла("txt"));
	ФайлОтправкиНачало = Новый ЗаписьТекста(МассивФайловДляОбъединения[0], КодировкаТекста.UTF8);
	НачальныеДанные = "--%Разделитель%
	|Content-Disposition: form-data; name=""chat_id""
	|
	|%ЧатID%
	|--%Разделитель%
	|Content-Disposition: form-data; name=""document""; filename=""%ИмяФайла%""
	|";
	НачальныеДанные = СтрЗаменить(НачальныеДанные,"%Разделитель%",Boundary);
	НачальныеДанные = СтрЗаменить(НачальныеДанные,"%ЧатID%",ЧатID);
	НачальныеДанные = СтрЗаменить(НачальныеДанные,"%ИмяФайла%",Файл.Имя);

	ФайлОтправкиНачало.ЗаписатьСтроку(НачальныеДанные);
	ФайлОтправкиНачало.Закрыть();

	МассивФайловДляОбъединения.Добавить(ПутьКФайлу);

	МассивФайловДляОбъединения.Добавить(ПолучитьИмяВременногоФайла("txt"));
	ФайлаОтправкиКонец = Новый ЗаписьТекста(МассивФайловДляОбъединения[2], КодировкаТекста.UTF8);
	КонечныеДанные = "
	|--%Разделитель%--";
	КонечныеДанные = СтрЗаменить(КонечныеДанные,"%Разделитель%",Boundary);

	ФайлаОтправкиКонец.ЗаписатьСтроку(КонечныеДанные);
	ФайлаОтправкиКонец.Закрыть();

	ИмяИтоговогоФайла = ПолучитьИмяВременногоФайла("txt");
	ОбъединитьФайлы(МассивФайловДляОбъединения, ИмяИтоговогоФайла);

	
	СоединениеHTTP = Новый HTTPСоединение(АдресTelegramAPI,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());

	АдресЗапроса = "bot" 
	                + МойToken 
	                + "/sendDocument";
					
	ЗапросHTTP = Новый HTTPЗапрос(АдресЗапроса);
	ЗапросHTTP.Заголовки.Вставить("Connection", "keep-alive");
	ЗапросHTTP.Заголовки.Вставить("Content-Type", "multipart/form-data; boundary="+Boundary);

	ЗапросHTTP.УстановитьИмяФайлаТела(ИмяИтоговогоФайла);

	Попытка
		ОтветHTTP = СоединениеHTTP.ОтправитьДляОбработки(ЗапросHTTP);
		
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
	
	Попытка 
		УдалитьФайлы(ПодготовкаДанных.ФормированияПутьКФайлу("E:\Файлы\report\", Объект.ДатаСмены));
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры



&НаСервере
Процедура ОбновлениеОплатЗакупщика()
	Ссылка = Объект.Ссылка;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДневнойОтчетНакладные.Ссылка.Ссылка КАК Ссылка,
		|	ДневнойОтчетНакладные.Оплачено КАК Оплачено,
		|	ДневнойОтчетНакладные.СуммаПН КАК СуммаПН,
		|	ДневнойОтчетНакладные.Закупщик КАК Закупщик
		|ИЗ
		|	Документ.ДневнойОтчет.Накладные КАК ДневнойОтчетНакладные
		|ГДЕ
		|	ДневнойОтчетНакладные.Ссылка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();
	СуммаЗакпщика=0;
	ОплаченоЗакупщику=0;
	Пока Выборка.Следующий() Цикл
		Если Выборка.Закупщик = Истина Тогда
			СуммаЗакпщика=СуммаЗакпщика+Выборка.СуммаПН;
			Если Выборка.Оплачено = Истина Тогда
				ОплаченоЗакупщику=ОплаченоЗакупщику+Выборка.СуммаПН;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	Для Каждого Строка Из Объект.ЗадолжнотиЗакупщика Цикл
		Если Строка.ТекущаяЗакупка = Истина Тогда
			Строка.Неоплачено = ОплаченоЗакупщику;	
		КонецЕсли;
	КонецЦикла;
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДолгЗакупщику(Команда)
	ЗагрузитьДолгЗакупщикуНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗадолжнотиЗакупщикаОплатитьПолностьюПриИзмененииНаСервере()
	//Объект.ЗадолжнотиЗакупщика.=Объект.ЗадолжнотиЗакупщика.Неоплачено;
КонецПроцедуры


&НаКлиенте
Процедура ЗадолжнотиЗакупщикаОплатитьПолностьюПриИзменении(Элемент)
	ЗадолжнотиЗакупщикаОплатитьПолностьюПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ВыгрузитьОтчетНаСервере()
	Ссылка = Объект.Ссылка;
	СсылкаНаЗаведение = Справочники.Заведения.ПолучитьЗаведение(Объект.Заведение);
	Заведение = СсылкаНаЗаведение.ПолучитьОбъект();	
	
	Инициалы = Заведение.Инициалы_Выгрузки;
	ПутьКПапке = СокрЛП(Заведение.Путь_Выгрузки);
	ПутьКФайлу = ПутьКПапке+Инициалы+Лев(СтрЗаменить(Строка(Объект.ДатаСмены),".",""),4); 
	//выгрузка накладных
	dbf_file_1 = Новый XBase;
	
	// ==================================================================================  		  
	dbf_file_1.Поля.Добавить("Kontr","N",10,);   //код поставщика	
	dbf_file_1.Поля.Добавить("Name","S",50,);  	// Название поставщика
	dbf_file_1.Поля.Добавить("Sklad","S",10,);
	dbf_file_1.Поля.Добавить("Summa","N",10,2);   // сумма       
	dbf_file_1.Поля.Добавить("NN","S",10,0); //4 Номер накладной	 
	dbf_file_1.Поля.Добавить("BN","N",1,0);
	
	dbf_file_1.СоздатьФайл(ПутьКФайлу+"_1.dbf");
	dbf_file_1.АвтоСохранение = Истина;                             
	

	
	Для Каждого Накладная Из Объект.Накладные Цикл
		
		Если Накладная.Сумма > 0 Тогда
			dbf_file_1.Добавить();
			Если Накладная.Поставщик.ОсновнойПоставщик.Пустая()=Ложь Тогда
				dbf_file_1.Kontr=Накладная.Поставщик.ОсновнойПоставщик.Код;	
				dbf_file_1.Name=Накладная.Поставщик.ОсновнойПоставщик.Наименование;
			Иначе
				dbf_file_1.Kontr=Накладная.Поставщик.Код;
				dbf_file_1.Name=Накладная.Поставщик.Наименование;
			КонецЕсли;
			dbf_file_1.Sklad= Строка(Накладная.Поставщик.Склад);    
			dbf_file_1.Summa=Накладная.Сумма;
			dbf_file_1.NN=Формат(Накладная.Номер,"ЧРГ=' '; ЧГ=0");
			Если Накладная.БН = Истина ТОгда 
				dbf_file_1.BN=1;
			Иначе
				dbf_file_1.BN=0;
			КонецЕсли;
	 	КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Накладная Из Объект.ОсновнаяИнформация Цикл
		
		Если Накладная.Статья.СозданиеНакладной = Истина Тогда
			dbf_file_1.Добавить();
			dbf_file_1.Kontr=Накладная.Статья.ПоставщикДляЗаполнения.Код;
			dbf_file_1.Name=Накладная.Статья.ПоставщикДляЗаполнения.Наименование;
			dbf_file_1.Sklad= Строка(Накладная.Статья.ПоставщикДляЗаполнения.Склад);    
			dbf_file_1.Summa=Накладная.Сумма;
	 	КонецЕсли;
		
	КонецЦикла;


	
	//выгрузка оплат ПН

	dbf_file_2 = Новый XBase;
	
	// ==================================================================================  		  
	dbf_file_2.Поля.Добавить("Kontr","N",10,);   //код поставщика	
	dbf_file_2.Поля.Добавить("Date","S",50,);  	// Название поставщика
	dbf_file_2.Поля.Добавить("Summa","N",10,2);   // сумма       
	
	
	dbf_file_2.СоздатьФайл(ПутьКФайлу+"_2.dbf");
	dbf_file_2.АвтоСохранение = Истина;           	
	Для Каждого Накладная Из Объект.Накладные Цикл
		Если Накладная.Сумма > 0 Тогда
			Если Накладная.Оплачено = Истина ИЛИ Накладная.Закупщик = Истина Тогда
				dbf_file_2.Добавить();
				Если Накладная.Поставщик.ОсновнойПоставщик.Пустая()=Ложь Тогда
					dbf_file_2.Kontr=Накладная.Поставщик.ОсновнойПоставщик.Код;	
				Иначе
					dbf_file_2.Kontr=Накладная.Поставщик.Код;
				КонецЕсли;

				dbf_file_2.Date=СтрЗаменить(Строка(Формат(Объект.ДатаСмены,"ДФ=yyyy-MM-dd")),"-","");
				dbf_file_2.Summa=Накладная.Сумма;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Накладная Из Объект.ДолговыеНакладные Цикл
		
		Если Накладная.Оплачен = Истина Тогда
			dbf_file_2.Добавить();
			Если Накладная.Поставщик.ОсновнойПоставщик.Пустая()=Ложь Тогда
				dbf_file_2.Kontr=Накладная.Поставщик.ОсновнойПоставщик.Код;	
			Иначе
				dbf_file_2.Kontr=Накладная.Поставщик.Код;
			КонецЕсли;

			
			dbf_file_2.Date=СтрЗаменить(Строка(Формат(Накладная.Дата,"ДФ=yyyy-MM-dd")),"-","");
			dbf_file_2.Summa=Накладная.Сумма;
	 	КонецЕсли;
		
	КонецЦикла;
	//выгрузка зп
	dbf_file_3 = Новый XBase;
	
	// ==================================================================================  		  
	dbf_file_3.Поля.Добавить("Of","N",10,);   //код поставщика	
	dbf_file_3.Поля.Добавить("Summa","N",10,2);   // сумма    
	dbf_file_3.Поля.Добавить("Name","S",20,);
	
	
	dbf_file_3.СоздатьФайл(ПутьКФайлу+"_3.dbf");
	dbf_file_3.АвтоСохранение = Истина;       
	
	Для Каждого Сотрудник Из Объект.Зарплаты Цикл
		Если Сотрудник.Сумма > 0 Тогда

			Если Сотрудник.Выдана = Истина Тогда
				dbf_file_3.Добавить();
				dbf_file_3.Name=Сотрудник.Сотрудник.Наименование;
				dbf_file_3.Of=Сотрудник.Сотрудник.Код;
				dbf_file_3.Summa=Сотрудник.Сумма;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;

	//выгрузка информации
	//выгрузка зп
	dbf_file = Новый XBase;
	
	// ==================================================================================  		  
	dbf_file.Поля.Добавить("Staty","N",10,); 
	dbf_file.Поля.Добавить("Name","S",50,); 
	dbf_file.Поля.Добавить("Type","N",10,2); //код поставщика	
	dbf_file.Поля.Добавить("Summa","N",10,2);   // сумма       
	
	
	dbf_file.СоздатьФайл(ПутьКФайлу+".dbf");
	dbf_file.АвтоСохранение = Истина;       

 
	
	Для Каждого Ордер Из Объект.ОсновнаяИнформация Цикл
		Если Ордер.Сумма > 0 Тогда
			Если Ордер.Статья.ПринадлежностьКРасходам = Ложь Тогда
				Если Ордер.Статья.ДенежноеДвижение = Перечисления.ТипДенежногоДвижения.ПриходныйКассовыйОрдер Тогда
					dbf_file.Добавить();
					dbf_file.Staty=Ордер.Статья.Код;
					dbf_file.Name=Ордер.Статья.Наименование;
					dbf_file.Type=1;
					dbf_file.Summa=Ордер.Сумма;
				ИначеЕсли Ордер.Статья.ДенежноеДвижение = Перечисления.ТипДенежногоДвижения.РасходныйКассовыйОрдер Тогда
					Если Ордер.Статья.ИсключитьИзИмпорта = Ложь Тогда 
						dbf_file.Добавить();
						dbf_file.Staty=Ордер.Статья.Код;
						dbf_file.Name=Ордер.Статья.Наименование;
						dbf_file.Type=2;
						dbf_file.Summa=Ордер.Сумма;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	Для Каждого Расход Из Объект.Расходы Цикл
		Если Расход.Сумма > 0 Тогда

			dbf_file.Добавить();
			dbf_file.Staty=Расход.Статья.Код;
			dbf_file.Name=Расход.Статья.Наименование;
			dbf_file.Type=2;
			dbf_file.Summa=Расход.Сумма;
		КонецЕсли;
	КонецЦикла;

	dbf_file.ЗакрытьФайл(); 
	dbf_file_1.ЗакрытьФайл(); 
	dbf_file_2.ЗакрытьФайл(); 
	dbf_file_3.ЗакрытьФайл(); 

	Сообщить("Документы успешер выгружены!");  
КонецПроцедуры


&НаКлиенте
Процедура ВыгрузитьОтчет(Команда)
	ВыгрузитьОтчетНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура СохранитьОтчет(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПоказатьОтчетНаСервере(ТабДок,Объект.Ссылка,1);
	
	//
	ОтправкаОтчетаВТелеграм();
	ОтправитьОтчетСОтменами();
	ОтправкаПеребораНаСервер();	
	ВыгрузитьОтчетНаСервере();
	Сообщить("Смена успешно закрыта!");
КонецПроцедуры


&НаСервере
Процедура АвтосохранениеДокументаНаСервере()
	Записать();
	////ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
	//ЭтотОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//Объект.НовыйБаланс = ПолучениеОбщейИнформации.АктуальныйБаланс(Объект.Заведние);
КонецПроцедуры


&НаСервере
Процедура АвтоОбновлениеИтоговыхДанных()
	
	//ОбновитДанныеНаКонецДня(Перечисления.СтандартнаяИнформацияОСмене.ОставленоНаЗакупку, ОставленоНаЗакупку(Объект.Ссылка));
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьДолгНаСервере()
	
	ДолгПоТекущейЗакупке = 0;
	Для Каждого Оплата Из Объект.ЗадолжнотиЗакупщика Цикл
		
		Если Оплата.ТекущаяЗакупка = Истина И Оплата.Тип <> Перечисления.ТипыЗадолжностей.ОтданоВТеченииДня Тогда
			ДолгПоТекущейЗакупке = Оплата.Неоплачено;	
		КонецЕсли;
		
	КонецЦикла;
	
	Объект.СуммаЗакупщика = ДолгПоТекущейЗакупке; 
	Объект.ДолгПоЗакупке = ДолгПоТекущейЗакупке;	
КонецПроцедуры

&НаСервере
Процедура РассчетЗакупок()
	СуммаЗакупкиКухни = 0;
	Для Каждого ПН Из Объект.Накладные Цикл
		Если ПН.Поставщик.Склад =Перечисления.Склады.Кухня Тогда
			СуммаЗакупкиКухни = СуммаЗакупкиКухни + ПН.Сумма;	
		КонецЕсли;
	КонецЦикла;
	
	СуммаЗакупкиБар = 0;
	Для Каждого ПН Из Объект.Накладные Цикл
		Если ПН.Поставщик.Склад =Перечисления.Склады.Бар Тогда
			СуммаЗакупкиБар = СуммаЗакупкиБар + ПН.Сумма;	
		КонецЕсли;
	КонецЦикла;
	
	СуммаХозки = 0;
	Для Каждого ПН Из Объект.Накладные Цикл
		Если ПН.Поставщик.Склад =Перечисления.Склады.Хозтовары Тогда
			СуммаХозки = СуммаХозки + ПН.Сумма;	
		КонецЕсли;
	КонецЦикла;
	Объект.ЗакупкаКухни = СуммаЗакупкиКухни;
	Объект.ЗакупкаБар = СуммаЗакупкиБар;
	Объект.Хозка = СуммаХозки;

КонецПроцедуры

&НаКлиенте
Процедура АвтосохранениеДокумента(Команда)
	БалансНаСервере();
	РассчетЗакупок();
	ОбновитьДолгНаСервере();
	ОбновитьУдаленыеСчета();
	АвтосохранениеДокументаНаСервере();
	//АвтоОбновлениеИтоговыхДанных();
КонецПроцедуры


&НаСервере
Процедура НакладныеПриИзмененииНаСервере(НомерСтроки)

	Для Каждого Выборка Из Объект.Накладные Цикл
		Если Выборка.НомерСтроки = НомерСтроки Тогда
			Если НЕ Выборка.СсылкаНаНакладную.Пустая() Тогда
				СсылкаНаДок = Выборка.СсылкаНаНакладную.ПолучитьОбъект(); 
				СсылкаНаРассчет = СсылкаНаДок.ПолучитьОбъект();
				СсылкаНаРассчет.Удалить();
				
				СсылкаНаДок.Удалить(); 
				Выборка.СсылкаНаНакладную = "";
			КонецЕсли;
			
			Склад = Справочники.Склады.ПолучитьСклад(Объект.Заведение, Выборка.Поставщик.Склад); 
			Если Выборка.Поставщик.ОсновнойПоставщик.Пустая()=Ложь Тогда
				Поставщик = Выборка.Поставщик.ОсновнойПоставщик;	
			Иначе
				Поставщик = Выборка.Поставщик;
			КонецЕсли;
			Выборка.СсылкаНаНакладную = Документы.ПриходнаяНакладная.СоздатьНакладную(Объект.Заведение, Объект.ДатаСмены,Склад, 
											Поставщик, Выборка.БН, Выборка.Сумма, Объект.Ссылка, Выборка.Номер, Объект.Заведение); 
														
											
											
			СуммаЗакупщика = 0;
			//получаем сумму всех накладных закупщика
			Для Каждого Накл Из Объект.Накладные Цикл
				Если Накл.Закупщик = Истина Тогда
					СуммаЗакупщика = СуммаЗакупщика + Накл.Сумма;	
				КонецЕсли;
			КонецЦикла;
			
			СсылкаНаНаклЗакупщ = Документы.ПриходнаяНакладная.СсылкаНаДокЗакупщика(Объект.Заведение, Объект.ДатаСмены);
			Если СсылкаНаНаклЗакупщ = Неопределено Тогда
				Документы.ПриходнаяНакладная.СоздатьНакладную(Объект.Заведение, Объект.ДатаСмены,, 
										Справочники.СистемныеПоставщики.ПолучитьСистемногоПоставщика(Объект.Заведение), Выборка.БН, Выборка.Сумма, Объект.Ссылка, Выборка.Номер, Объект.Заведение); 
				Возврат;
			КонецЕсли;
			ТекДок = СсылкаНаНаклЗакупщ.ПолучитьОбъект();
			ТекДок.Сумма = СуммаЗакупщика;
			ТекДок.Записать(РежимЗаписиДокумента.Проведение);
			
			//СОЗДАЕМ РАСХОРДЕР
			Если Выборка.Оплачено = Истина Тогда
				Документы.РасходныйКассовыйОрдер.СоздатьРасходОрдера(Объект.ДатаСмены,Объект.Заведение, Справочники.Кассы.ПолучитьКассу(Объект.Заведение),
					Выборка.Поставщик, Выборка.Сумма,,,Выборка.СсылкаНаНакладную,);
			КонецЕсли;
		КонецЕсли;	
										

	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура НакладныеПриИзменении(Элемент)
	БалансНаСервере();
	РассчетЗакупок();
	ОбновитьДолгНаСервере();
	АвтосохранениеДокументаНаСервере();

	//НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	//НакладныеПриИзмененииНаСервере(НомерСтроки);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьПрограму(Команда)
	БалансНаСервере();
	РассчетЗакупок();
	ОбновитьДолгНаСервере();
	ОбновитьУдаленыеСчета();
	АвтосохранениеДокументаНаСервере();
	ПрекратитьРаботуСистемы(Ложь);
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуКассы(Касса)
	Ссылка = Объект.Ссылка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДневнойОтчетОсновнаяИнформация.Ссылка КАК Ссылка,
		|	ДневнойОтчетОсновнаяИнформация.Статья КАК Статья,
		|	ДневнойОтчетОсновнаяИнформация.Сумма КАК Сумма
		|ИЗ
		|	Документ.ДневнойОтчет.ОсновнаяИнформация КАК ДневнойОтчетОсновнаяИнформация
		|ГДЕ
		|	ДневнойОтчетОсновнаяИнформация.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	СуммаКассы = 0;
	Пока Выборка.Следующий() Цикл
		Если Выборка.Статья.СтандартнаяСтатья = Касса Тогда
			СуммаКассы = Выборка.Сумма;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СуммаКассы;
КонецФункции

&НаСервере
Функция РассчитатьЗП(Сотрудники)
	Заведение = Объект.Заведение;
	
	СуммаЗП=0;
	МинимальнаяВыплата=0;
	КассаРасчета=0;
	ДопВыплата=0;
	//Процент=0;

	Для А=1 По 4 Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ШаблоныЗаполненийЗПРасчет.Ссылка.Заведение КАК Заведение,
			|	ШаблоныЗаполненийЗПРасчет.Сотрудники КАК Сотрудники,
			|	ШаблоныЗаполненийЗПРасчет.Касса КАК Касса,
			|	ШаблоныЗаполненийЗПРасчет.ТИП КАК ТИП,
			|	ШаблоныЗаполненийЗПРасчет.СуммаКассы КАК СуммаКассы,
			|	ШаблоныЗаполненийЗПРасчет.СуммаВыплаты КАК СуммаВыплаты,
			|	ШаблоныЗаполненийЗПРасчет.Процент КАК Процент
			|ИЗ
			|	Документ.ШаблоныЗаполнений.ЗПРасчет КАК ШаблоныЗаполненийЗПРасчет
			|ГДЕ
			|	ШаблоныЗаполненийЗПРасчет.Ссылка.Заведение = &Заведение
			|	И ШаблоныЗаполненийЗПРасчет.Сотрудники = &Сотрудники";
		
		Запрос.УстановитьПараметр("Заведение", Заведение);
		Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если А=1 Тогда
			//получаем кассу и сумму кассы	
				Если Выборка.ТИП = Перечисления.РазновидностьЗПРасчетов.Касса Тогда
					КассаРасчета=ПолучитьСуммуКассы(Выборка.Касса);
					Прервать;
				КонецЕсли;
			ИначеЕсли А=2 Тогда 
				//Минималка
				Если Выборка.ТИП = Перечисления.РазновидностьЗПРасчетов.МинимальнаяСтавка Тогда
					МинимальнаяВыплата=Выборка.СуммаВыплаты;
					СуммаЗП=МинимальнаяВыплата;
					Прервать;
				КонецЕсли;	
			ИначеЕсли А=3 Тогда
				//доп. выпдата
				Если Выборка.ТИП = Перечисления.РазновидностьЗПРасчетов.ДополнительныеНачисления Тогда
					ДопВыплата=Выборка.СуммаВыплаты;
					Прервать;
				КонецЕсли;
			ИначеЕсли А=4 Тогда
				Если Выборка.ТИП = Перечисления.РазновидностьЗПРасчетов.УсловиеРасчета Тогда
				//получаем сумму ЗП
				//1. определяем проценник он или нет
					Если Выборка.Процент = Истина Тогда
						СуммаЗП=КассаРасчета*Выборка.СуммаВыплаты/100;
						Если СуммаЗП<МинимальнаяВыплата Тогда
							СуммаЗП=МинимальнаяВыплата;
						КонецЕсли;
						Прервать;
					КонецЕсли;
					//2.определяем меняеться зп по условию или нет
					Если Выборка.Процент = Ложь Тогда
						Если Выборка.СуммаКассы=0 Тогда
							СуммаЗП=Выборка.СуммаВыплаты; //без условия кассы
						Иначе
							//определяем 
							Если Выборка.СуммаКассы<КассаРасчета Тогда
								СуммаЗП=Выборка.СуммаВыплаты;
								Продолжить;
							Иначе
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

		КонецЦикла;
	КонецЦикла;
	СуммаЗП=СуммаЗП+ДопВыплата;
	Возврат СуммаЗП;			
КонецФункции

&НаСервере
Процедура ЗагрузитьЗПНаСервере()
	Заведение = Объект.Заведение;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныЗаполненийЗПСписок.Ссылка.Заведение КАК Заведение,
		|	ШаблоныЗаполненийЗПСписок.Ссылка.АвтоРасчетЗП КАК АвтоРасчетЗП,
		|	ШаблоныЗаполненийЗПСписок.Сотрудник КАК Сотрудник,
		|	ШаблоныЗаполненийЗПСписок.НомерСтроки КАК НомерСтроки,
		|	ШаблоныЗаполненийЗПСписок.ПН КАК ПН,
		|	ШаблоныЗаполненийЗПСписок.ВТ КАК ВТ,
		|	ШаблоныЗаполненийЗПСписок.СР КАК СР,
		|	ШаблоныЗаполненийЗПСписок.ЧТ КАК ЧТ,
		|	ШаблоныЗаполненийЗПСписок.ПТ КАК ПТ,
		|	ШаблоныЗаполненийЗПСписок.СБ КАК СБ,
		|	ШаблоныЗаполненийЗПСписок.ВС КАК ВС
		|ИЗ
		|	Документ.ШаблоныЗаполнений.ЗПСписок КАК ШаблоныЗаполненийЗПСписок
		|ГДЕ
		|	ШаблоныЗаполненийЗПСписок.Ссылка.Заведение = &Заведение
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Заведение", Заведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ДеньНедели(Объект.ДатаСмены)=1 Тогда
			День = Выборка.ПН;	
		ИначеЕсли ДеньНедели(Объект.ДатаСмены)=2 Тогда
			День = Выборка.ВТ;		
		ИначеЕсли ДеньНедели(Объект.ДатаСмены)=3 Тогда
			День = Выборка.СР;		
		ИначеЕсли ДеньНедели(Объект.ДатаСмены)=4 Тогда	
			День = Выборка.ЧТ;		
		ИначеЕсли ДеньНедели(Объект.ДатаСмены)=5 Тогда
			День = Выборка.ПТ;		
		ИначеЕсли ДеньНедели(Объект.ДатаСмены)=6 Тогда
			День = Выборка.СБ;		
		Иначе
			День = Выборка.ВС;		
		КонецЕсли;

		Если День = Истина Тогда
			ЗП = Объект.Зарплаты.Добавить();
			ЗП.Сотрудник = Выборка.Сотрудник;
			ЗП.Сумма = РассчитатьЗП(Выборка.Сотрудник);
			Если Выборка.АвтоРасчетЗП = Истина Тогда
				ЗП.Выдана = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Выручка Из Объект.КассыОфициантов Цикл
		Если Выручка.Сумма > 0 Тогда
			ЗП = Объект.Зарплаты.Добавить();
			ЗП.Сотрудник = Выручка.Официант;
			ЗП.Сумма = Выручка.Сумма / 100 * 5 ;
  		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗП(Команда)
	ЗагрузитьЗПНаСервере();
КонецПроцедуры

&НаСервере
Функция УдалитьСтрокуНаСервере()
	ПовторЦикла = Истина;
	Пока ПовторЦикла <> Ложь Цикл
		ПовторЦикла = Ложь;
		Для Каждого Строка Из Объект.ДолговыеНакладные Цикл
			Если Строка.Ошибка = Истина Тогда
				Индекс = Строка.НомерСтроки-1;
				Объект.ДолговыеНакладные.Удалить(Индекс); 
				ПовторЦикла = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	УдалитьСтрокуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВзаимодействиеСТаблицамиНаСервере()
	Накладные = Объект.Накладные;
	
	Для Каждого Строка Из Накладные Цикл
		Сообщить("");	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВзаимодействиеСТаблицами(Команда)
	ВзаимодействиеСТаблицамиНаСервере();
КонецПроцедуры

&НаСервере
Функция  БалансНаСервере()
	//получение остатка со вчера
	ТекущийБаланс = 0;
	
	//БалансНаКонецПрошлогоДня = ИнформацияСоВчерашнегоОтчета(1);
	//ОставленоВчераНаЗакупку = ИнформацияСоВчерашнегоОтчета(2);
	
	БалансНаКонецПрошлогоДня = Объект.СсылкаНаВчерашнийОтчет.ПолучитьОбъект();
	БалансНаКонецПрошлогоДня = БалансНаКонецПрошлогоДня.ТекущийБаланс;
	
	ОставленоВчераНаЗакупку = ИнформацияСоВчерашнегоОтчета();

	
	ТекущийБаланс = ТекущийБаланс + БалансНаКонецПрошлогоДня;
	
	ОсновнаяИнформация = Объект.ОсновнаяИнформация;
	Для Каждого Строка Из ОсновнаяИнформация Цикл
		Если Строка.Статья.ДенежноеДвижение = Перечисления.ТипДенежногоДвижения.ПриходныйКассовыйОрдер Тогда
			ТекущийБаланс = ТекущийБаланс + Строка.Сумма;	
		ИначеЕсли Строка.Статья.ДенежноеДвижение = Перечисления.ТипДенежногоДвижения.РасходныйКассовыйОрдер Тогда
			ТекущийБаланс = ТекущийБаланс - Строка.Сумма;	
		КонецЕсли;
	КонецЦикла;
	
	Расходы = Объект.Расходы;
	Для Каждого Строка Из Расходы Цикл
		ТекущийБаланс = ТекущийБаланс - Строка.Сумма;	
	КонецЦикла;
	
	ЗакупщикСуммаТекущейЗакупки = 0;
	Накладные = Объект.Накладные;
	Для Каждого Строка Из Накладные Цикл
		Если (Строка.Оплачено = Истина) И (Строка.Закупщик = Ложь) Тогда
			ТекущийБаланс = ТекущийБаланс - Строка.Сумма;
		КонецЕсли;
		
		Если Строка.Закупщик = Истина Тогда
			ЗакупщикСуммаТекущейЗакупки = ЗакупщикСуммаТекущейЗакупки + Строка.Сумма; 	
		КонецЕсли;
	КонецЦикла;
	
	ОбновлениеСуммЗакупщика(ЗакупщикСуммаТекущейЗакупки,ОставленоВчераНаЗакупку);
	
	ЗП = Объект.Зарплаты;
	Для Каждого Строка Из ЗП Цикл
		Если Строка.Выдана = Истина Тогда
			ТекущийБаланс = ТекущийБаланс - Строка.Сумма;
		КонецЕсли;
	КонецЦикла;

	ДолговыеПН = Объект.ДолговыеНакладные;
	Для Каждого Строка Из ДолговыеПН Цикл
		Если Строка.Оплачен = Истина Тогда
			ТекущийБаланс = ТекущийБаланс - Строка.Сумма;
		КонецЕсли;
	КонецЦикла;

	ОплатаЗакупщика = Объект.ЗадолжнотиЗакупщика;
	Для Каждого Строка Из ОплатаЗакупщика Цикл
		Если Строка.ОплатитьПолностью = Истина Тогда
			ТекущийБаланс = ТекущийБаланс - Строка.Неоплачено;
		ИначеЕсли Строка.Сумма > 0 Тогда
			ТекущийБаланс = ТекущийБаланс - Строка.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	
	Для Каждого Строка Из Объект.НеОплаченыеЗП Цикл
		
		Если Строка.СуммаВыплаты > 0 Тогда
			ТекущийБаланс = ТекущийБаланс - Строка.СуммаВыплаты;	
		КонецЕсли;
		
	КонецЦикла;
	//получение сдачи на сегодня
	Сдача = ОставленоВчераНаЗакупку - ЗакупщикСуммаТекущейЗакупки;
	Если Сдача > 0 Тогда
		ТекущийБаланс = ТекущийБаланс + Сдача;	
	КонецЕсли;
	
	Объект.ТекущийБаланс = ТекущийБаланс;
	
	Возврат ТекущийБаланс; 
КонецФункции


&НаСервере
Процедура ОбновлениеСуммЗакупщика(СуммаЗакупки,ОставленоНаЗакупку)
	ТекущаяОплата = 0;
	Для Каждого Строка Из Объект.ЗадолжнотиЗакупщика Цикл
		Если Строка.ОплатитьПолностью = Истина Тогда
			Строка.Сумма = Строка.Неоплачено;
			Строка.Неоплачено = 0;
			Строка.ОплатитьПолностью = Ложь;
		КонецЕсли;

		Если Строка.ТекущаяЗакупка = Истина Тогда
			
			Строка.ОставленоВчера = ОставленоНаЗакупку;
			Строка.СуммаТекущейЗакупки = СуммаЗакупки; 
			//проверка на наличие оплаты в течении дня
			КОплате = СуммаЗакупки-ОставленоНаЗакупку-ТекущаяОплата;
			Если КОплате > 0 Тогда
				Строка.Неоплачено = СуммаЗакупки-ОставленоНаЗакупку;
				Строка.Неоплачено = Окр(Строка.Неоплачено,1);
			Иначе 
				Строка.Неоплачено = 0;
			КонецЕсли;
			
			
			
			Строка.Неоплачено = КОплате - Строка.Сумма;
					
		    Если Строка.Неоплачено<0 Тогда
				Строка.Сумма = Строка.Сумма + Строка.Неоплачено; 
				Строка.Неоплачено = 0;
			КонецЕсли;
			
			ТекущаяОплата = ТекущаяОплата + Строка.Сумма; 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Баланс(Команда)
	БалансНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправкаПеребораНаСервер()
	Если ПодготовкаДанных.ДниДляОтчетов(Объект.ДатаСмены) = Истина Тогда
		СуммаПеребора = Документы.ДневнойОтчет.ПолучениеПеребора(Объект.Заведение,Объект.ДатаСмены);
		ТекстСообщения = "Сумма Перебора по " + Строка(Объект.Заведение) + " за период с " + Строка(Формат(НачалоНедели(Объект.ДатаСмены),"ДФ=dd.MM")) + 
			" по " + Строка(Формат(Объект.ДатаСмены,"ДФ=dd.MM")) + " - " + Строка(СуммаПеребора) + "грн.";
		Telegram.SendMessage(Константы.ИдВладельца.Получить(), ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтчет(Команда)
	ОтправкаОтчетаВТелеграм();
КонецПроцедуры

&НаСервере
Процедура НеОплаченыеЗПВыданаПриИзмененииНаСервере()
	
	Для Каждого Строка Из Объект.НеОплаченыеЗП Цикл
		
		Если Строка.Выдана = Истина Тогда
			Если Строка.Сумма > 0 Тогда
				Строка.СуммаВыплаты = Строка.НачальнаяСумма;
				Строка.Сумма = 0;
			Иначе
				Строка.Сумма = Строка.НачальнаяСумма;
				Строка.СуммаВыплаты = 0;
			КонецЕсли;
			Строка.Выдана = Ложь;
		КонецЕсли;
		
		Если Строка.СуммаВыплаты > Строка.НачальнаяСумма Тогда 
			Строка.СуммаВыплаты  = Строка.НачальнаяСумма	
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из Объект.НеОплаченыеЗП Цикл
		
		Строка.Сумма = Строка.НачальнаяСумма - Строка.СуммаВыплаты;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура НеОплаченыеЗПВыданаПриИзменении(Элемент)
	НеОплаченыеЗПВыданаПриИзмененииНаСервере();
	АвтосохранениеДокументаНаСервере();
	БалансНаСервере();
	ОбновитьДолгНаСервере();

КонецПроцедуры

&НаСервере
Процедура ИнформацияПоПивуПриИзмененииНаСервере()
	
	Для Каждого Строка Из Объект.ИнформацияПоПиву Цикл
		Строка.Сумма = Строка.Количество * Константы.ЦенаЗаЛПива.Получить();	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияПоПивуПриИзменении(Элемент)
	ИнформацияПоПивуПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтгрузкиПиваПриИзмененииНаСервере()
	
	Для Каждого Строка Из Объект.ОтгрузкиПива Цикл
		Если Строка.Заведение = Перечисления.Заведение.ПицерияЗаболотного Тогда
			Строка.Сумма = Строка.Количество * Константы.ЦенаЗаПиваБутылка.Получить();	
		Иначе
			Строка.Сумма = Строка.Количество * Константы.ЦенаЗаЛПива.Получить();	
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкиПиваПриИзменении(Элемент)
	
	ОтгрузкиПиваПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТестКнопка(Команда)
	ПереносЗадолжностейПоПиву();
КонецПроцедуры

&НаСервере
Процедура НакладныеЗакупщикПриИзмененииНаСервере()
	Для Каждого Строка Из Объект.Накладные Цикл
		Если Строка.Закупщик = Истина Тогда
			Строка.Оплачено = Ложь;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НакладныеЗакупщикПриИзменении(Элемент)
	НакладныеЗакупщикПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НакладныеОплаченоПриИзмененииНаСервере()
	Для Каждого Строка Из Объект.Накладные Цикл
		Если Строка.Оплачено = Истина Тогда
			Строка.Закупщик = Ложь;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура НакладныеОплаченоПриИзменении(Элемент)
	НакладныеОплаченоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДолгПННаСервере()
	
	Выборка = Объект.СсылкаНаВчерашнийОтчет.ПолучитьОбъект();
	
	Для Каждого Строка Из Выборка.Накладные Цикл
		
		Если Строка.Оплачено = Ложь И Строка.Закупщик = Ложь Тогда
			Долговые = Объект.ДолговыеНакладные.Добавить();
			Долговые.Дата = Выборка.ДатаСмены;
			Долговые.Поставщик = Строка.Поставщик;
			Долговые.Сумма = Строка.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДолгПН(Команда)
	ЗагрузитьДолгПННаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ОсновнаяИнформацияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	//Если Элемент.ТекущиеДанные.Статья = Неопределено ИЛИ Элемент.ТекущиеДанные.Сумма = 0 Тогда
	//	Сообщить("Во вкладке ОСНОВНАЯ ИНФОРМАЦИЯ в " + Строка(Элемент.ТекущиеДанные.НомерСтроки) + " строке заполнены не все данные!");	
	//КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РасходыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	//Если Элемент.ТекущиеДанные.Статья = Неопределено ИЛИ Элемент.ТекущиеДанные.Сумма = 0 Тогда
	//	Сообщить("Во вкладке РАСХОДЫ в " + Строка(Элемент.ТекущиеДанные.НомерСтроки) + " строке заполнены не все данные!");	
	//КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура НакладныеПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	//Если Элемент.ТекущиеДанные.Поставщик = Неопределено ИЛИ Элемент.ТекущиеДанные.СуммаПН = 0 Тогда
	//	Сообщить("Во вкладке НАКЛАДНЫЕ в " + Строка(Элемент.ТекущиеДанные.НомерСтроки) + " строке заполнены не все данные!");	
	//КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ЗарплатыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	//Если Элемент.ТекущиеДанные.Сотрудник = Неопределено ИЛИ Элемент.ТекущиеДанные.Сумма = 0 Тогда
	//	Сообщить("Во вкладке ЗАРПЛАТЫ в " + Строка(Элемент.ТекущиеДанные.НомерСтроки) + " строке заполнены не все данные!");	
	//КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОтгрузкиПиваСортПеречислениеПриИзмененииНаСервере()
	
	Для Каждого Продажа Из Объект.ОтгрузкиПива Цикл
		
		Сорт = Справочники.Товари.НайтиПоРеквизиту("Сорт", Продажа.СортПеречисление);
		Продажа.СортПива = Сорт;
		
	КонецЦикла;
	
	Записать();
КонецПроцедуры


&НаКлиенте
Процедура ОтгрузкиПиваСортПеречислениеПриИзменении(Элемент)
	ОтгрузкиПиваСортПеречислениеПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьИнфСоВчераНаСервере()
	Выборка = Объект.СсылкаНаВчерашнийОтчет.ПолучитьОбъект();
	
	Для Каждого Строка Из Выборка.Накладные Цикл
		
		Если Строка.Оплачено = Ложь И Строка.Закупщик = Ложь Тогда
			Долговые = Объект.ДолговыеНакладные.Добавить();
			Долговые.Дата = Выборка.ДатаСмены;
			Долговые.Поставщик = Строка.Поставщик;
			Долговые.Сумма = Строка.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
	
		
	Для Каждого Строка Из Выборка.ДолговыеНакладные Цикл
		
		Если Строка.Оплачен = Ложь И Строка.Ошибка = Ложь Тогда
			Долговые = Объект.ДолговыеНакладные.Добавить();
			Долговые.Дата = Строка.Дата;
			Долговые.Поставщик = Строка.Поставщик;
			Долговые.Сумма = Строка.Сумма;
		КонецЕсли;
		
	КонецЦикла;

		
	Для Каждого Строка Из Выборка.ЗадолжнотиЗакупщика Цикл
		
		Если Строка.Неоплачено > 0 Тогда
			ЗадолжнотиЗакупщика = Объект.ЗадолжнотиЗакупщика.Добавить();
			ЗадолжнотиЗакупщика.Дата = Строка.Дата;
			ЗадолжнотиЗакупщика.Тип = Перечисления.ТипыЗадолжностей.Долг;
			ЗадолжнотиЗакупщика.Неоплачено = Строка.Неоплачено;   
			ЗадолжнотиЗакупщика.СуммаТекущейЗакупки = Строка.Неоплачено;
		КонецЕсли;
		
	КонецЦикла;

	
	Для Каждого Строка Из Выборка.НеОплаченыеЗП Цикл
		
		Если Строка.Сумма > 0 Тогда
			ЗадолжностьЗП = Объект.НеОплаченыеЗП.Добавить();
			ЗадолжностьЗП.Сотрудник = Строка.Сотрудник;
			ЗадолжностьЗП.НачальнаяСумма = Строка.НачальнаяСумма;
			ЗадолжностьЗП.Сумма = Строка.НачальнаяСумма;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из Выборка.РассчетыПоПиву Цикл
		
		Если Строка.Оплачено = Ложь Тогда
			РассчетыПоПиву = Объект.РассчетыПоПиву.Добавить();
			РассчетыПоПиву.ДатаНакладной = Строка.ДатаНакладной;
			РассчетыПоПиву.Заведение = Строка.Заведение;
			РассчетыПоПиву.СуммаЗадолжности = Строка.СуммаЗадолжности;
		КонецЕсли;
		
	КонецЦикла;


КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьИнфСоВчера(Команда)
	ЗагрузитьИнфСоВчераНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуОплатыЗакупщика()
	
	Для Каждого Строка Из Объект.ОсновнаяИнформация Цикл
		Если Строка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.ОставленоЗакупщику Тогда
			Возврат Строка.Сумма; 		
		КонецЕсли;
	КонецЦикла;
	 Возврат 0;	
КонецФункции


&НаСервере
Процедура РассчитатьЗакупщикаНаСервере()
	ТекстСообщения = "Автоматически было оплачено: " + Символы.ПС;
	Если Объект.Заведение <> Перечисления.Заведение.Торговая Тогда
		//оплата долгов
		Если Объект.ТекущийБаланс > 0 Тогда
			Для Каждого Строка Из Объект.ЗадолжнотиЗакупщика Цикл
				Если Строка.Тип = Перечисления.ТипыЗадолжностей.Долг Тогда
					Если Строка.Неоплачено > 0 Тогда
						СуммаОплаты = 0;
						Если Объект.ТекущийБаланс - Строка.Неоплачено > 0 Тогда 
							СуммаОплаты = Строка.Неоплачено;
							Строка.Неоплачено = 0;
							ТекстСообщения = ТекстСообщения + Строка(Строка.Тип) + " " + Формат(Строка.Дата,"ДФ=dd.MM") + " - " + Строка(СуммаОплаты) + "грн." + Символы.ПС;
						Иначе
							СуммаОплаты = Объект.ТекущийБаланс; 
							Строка.Неоплачено = Строка.Неоплачено - СуммаОплаты;
							ТекстСообщения = ТекстСообщения + Строка(Строка.Тип) + " " + Формат(Строка.Дата,"ДФ=dd.MM") + " - " + Строка(СуммаОплаты) + "грн." + Символы.ПС;
						КонецЕсли;
						Строка.Сумма = СуммаОплаты;
						Объект.ТекущийБаланс = Объект.ТекущийБаланс - СуммаОплаты; 
						Записать();
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		//оплата текущей закупки
		Если Объект.ТекущийБаланс > 0 Тогда
			Для Каждого Строка Из Объект.ЗадолжнотиЗакупщика Цикл
				Если Строка.Тип <> Перечисления.ТипыЗадолжностей.ОтданоВТеченииДня Тогда
					Если Строка.Неоплачено > 0 Тогда
						СуммаОплаты = 0;
						Если Объект.ТекущийБаланс - Строка.Неоплачено > 0 Тогда 
							СуммаОплаты = Строка.Неоплачено;
							Строка.Неоплачено = 0;
							ТекстСообщения = ТекстСообщения + Строка(Строка.Тип) + " " + Формат(Строка.Дата,"ДФ=dd.MM") + " - " + Строка(СуммаОплаты) + "грн." + Символы.ПС;
						Иначе
							СуммаОплаты = Объект.ТекущийБаланс; 
							Строка.Неоплачено = Строка.Неоплачено - СуммаОплаты;
							ТекстСообщения = ТекстСообщения + Строка(Строка.Тип) + " " + Формат(Строка.Дата,"ДФ=dd.MM") + " - " + Строка(СуммаОплаты) + "грн." + Символы.ПС;
						КонецЕсли;
						Строка.Сумма = СуммаОплаты;
						Объект.ТекущийБаланс = Объект.ТекущийБаланс - СуммаОплаты; 
						Если Строка.ТекущаяЗакупка = Истина Тогда
							Объект.ДолгПоЗакупке = Объект.ДолгПоЗакупке - СуммаОплаты;
						КонецЕсли;	
						
						Записать();
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//на закупку
		Если Объект.ТекущийБаланс > 0 Тогда
			Статья = Справочники.СтатьиРасходов.НайтиПоРеквизиту("СтандартнаяСтатья",Перечисления.СтандартныеСтатьи.ОставленоНаЗакупку);
			
			НаЗакупку = Объект.ОсновнаяИнформация.Добавить();
			НаЗакупку.Статья = Статья;
			НаЗакупку.Сумма = Объект.ТекущийБаланс;
			
			БалансНаСервере();
			АвтосохранениеДокументаНаСервере();
			ТекстСообщения = ТекстСообщения + Строка(Статья) + " - " + Строка(НаЗакупку.Сумма) + "грн."
		КонецЕсли;
	КонецЕсли;
	//для торговой	
	Если Объект.Заведение = Перечисления.Заведение.Торговая Тогда
		СуммаНаРассчет = ПолучитьСуммуОплатыЗакупщика();
		Если СуммаНаРассчет > 0 Тогда
			Для Каждого Строка Из Объект.ЗадолжнотиЗакупщика Цикл
				Если Строка.Тип <> Перечисления.ТипыЗадолжностей.ОтданоВТеченииДня Тогда
					Если Строка.Неоплачено > 0 Тогда
						СуммаОплаты = 0;
						Если СуммаНаРассчет - Строка.Неоплачено > 0 Тогда 
							СуммаОплаты = Строка.Неоплачено;
							Строка.Неоплачено = 0;
							ТекстСообщения = ТекстСообщения + Строка(Строка.Тип) + " " + Формат(Строка.Дата,"ДФ=dd.MM") + " - " + Строка(СуммаОплаты) + "грн." + Символы.ПС;
						Иначе
							СуммаОплаты = СуммаНаРассчет; 
							Строка.Неоплачено = Строка.Неоплачено - СуммаОплаты;
							ТекстСообщения = ТекстСообщения + Строка(Строка.Тип) + " " + Формат(Строка.Дата,"ДФ=dd.MM") + " - " + Строка(СуммаОплаты) + "грн." + Символы.ПС;
						КонецЕсли;
						Строка.Сумма = СуммаОплаты;
						СуммаНаРассчет = СуммаНаРассчет - СуммаОплаты; 
						Если Строка.ТекущаяЗакупка = Истина Тогда
							Объект.ДолгПоЗакупке = Объект.ДолгПоЗакупке - СуммаОплаты;
						КонецЕсли;	
						
						Записать();
					КонецЕсли;
				КонецЕсли;
				
				
			КонецЦикла;
		КонецЕсли;
		
		Если СуммаНаРассчет > 0 Тогда
			Статья = Справочники.СтатьиРасходов.НайтиПоРеквизиту("СтандартнаяСтатья",Перечисления.СтандартныеСтатьи.ОставленоНаЗакупку);
			
			НаЗакупку = Объект.ОсновнаяИнформация.Добавить();
			НаЗакупку.Статья = Статья;
			НаЗакупку.Сумма = СуммаНаРассчет;
			
			БалансНаСервере();
			АвтосохранениеДокументаНаСервере();
			ТекстСообщения = ТекстСообщения + Строка(Статья) + " - " + Строка(НаЗакупку.Сумма) + "грн."
		КонецЕсли;
	    БалансНаСервере();
	КонецЕсли;
	

	Сообщить(ТекстСообщения);
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьЗакупщика(Команда)
	РассчитатьЗакупщикаНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОплатитьВсеДолговыеНаСервере()
	Для Каждого Строка Из Объект.ДолговыеНакладные Цикл
		Если Строка.Ошибка = Ложь Тогда 
			Если Строка.Оплачен = Ложь Тогда
				Если Объект.ТекущийБаланс - Строка.Сумма > 0 Тогда
					Строка.Оплачен = Истина;
					БалансНаСервере();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ОплатитьВсеДолговые(Команда)
	ОплатитьВсеДолговыеНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПросмотрДругихОтчетовНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДневнойОтчет.ДатаСмены КАК ДатаСмены,
		|	ДневнойОтчет.Заведение КАК Заведение,
		|	ДневнойОтчет.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ДневнойОтчет КАК ДневнойОтчет
		|ГДЕ
		|	ДневнойОтчет.Заведение = &Заведение
		|	И ДневнойОтчет.ДатаСмены = &ДатаСмены";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Заведение", Объект.Заведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СсылкаНаОтчет = Выборка.Ссылка;
	КонецЦикла;
	
	Отчет = СсылкаНаОтчет.ПолучитьОбъект();
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	НовыйОтчет = Отчет.Скопировать();
	//осн инф
	//Отчет.ОсновнаяИнформация.Очистить();
	//Для Каждого Строка Из Отчет.ОсновнаяИнформация Цикл
	//	Инф = Объект.ОсновнаяИнформация.Добавить();
	//	Инф.Статья = Строка.Статья;
	//	Инф.Сумма = Строка.Сумма;
	//КонецЦикла;
	//расходы
	//ПН
	//ЗП
	//долг ПН
	//закупщик
		
КонецПроцедуры


&НаКлиенте
Процедура ПросмотрДругихОтчетов(Команда)
	ПросмотрДругихОтчетовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПереносЗПКухня()
	Для Каждого Строка Из Объект.СменаКухни Цикл
		Если Строка.Сумма > 0 Тогда
			ЗП = Объект.Зарплаты.Добавить();
			ЗП.Сотрудник = Строка.Сотрудник;
			ЗП.Сумма = Строка.Сумма;
	 	КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДозагрузитьЗПНаСервере()
	ЗагрузкаДолговПоЗП();
	//формирование зп из продаж официантов
	Для Каждого Касса Из Объект.КассыОфициантов Цикл
		Если Касса.Сумма > 0 Тогда
			ЗП = Объект.Зарплаты.Добавить();
			ЗП.Сотрудник = Касса.Официант;
			ЗП.Сумма = Касса.Сумма/100*5;
		КонецЕсли;
	КонецЦикла;
	ПереносЗПКухня();
	ПереносНеоплаченыхЗП();
КонецПроцедуры


&НаКлиенте
Процедура ДозагрузитьЗП(Команда)
	ДозагрузитьЗПНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьКухоныеЗПНаСервере()
	СпрРодитель = Справочники.Сотрудники.НайтиПоНаименованию("Кухня");	
	Парам = Новый Структура;
	Парам.Вставить("Родитель",СпрРодитель);
	Сотрудник = Справочники.Сотрудники.ПолучитьДанныеВыбора(Парам);
	Для Каждого Строка Из Сотрудник Цикл
		
		Если Строка.Значение.Родитель.Наименование = СпрРодитель.Наименование Тогда
			Смена = Объект.СменаКухни.Добавить();
			Смена.Сотрудник = Строка.Значение.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Записать();
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьКухоныеЗП(Команда)
	ЗагрузитьКухоныеЗПНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучениеСтавкиСотрудника(Должность,ПолнаяСмена)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтавкиКухня.ПолнаяСмена КАК ПолнаяСмена,
		|	СтавкиКухня.Сумма КАК Сумма,
		|	СтавкиКухня.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.СтавкиКухня КАК СтавкиКухня
		|ГДЕ
		|	СтавкиКухня.ПолнаяСмена = &ПолнаяСмена
		|	И СтавкиКухня.Должность = &Должность";
	
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.УстановитьПараметр("ПолнаяСмена", ПолнаяСмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Сумма;
	КонецЦикла;
	
	
КонецФункции

&НаСервере
Процедура СменаКухниНаСменеПриИзмененииНаСервере()
	Для Каждого Сотрудник Из Объект.СменаКухни Цикл
		
		Если Сотрудник.НаСмене = Истина Тогда
			Если Сотрудник.ПолнаяСмена = Истина Тогда
				Сотрудник.Сумма = ПолучениеСтавкиСотрудника(Сотрудник.Сотрудник.Должность,Истина);
			Иначе
				Сотрудник.Сумма = ПолучениеСтавкиСотрудника(Сотрудник.Сотрудник.Должность,Ложь);
			КонецЕсли;
		Иначе
			Сотрудник.Сумма = 0;	
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СменаКухниНаСменеПриИзменении(Элемент)
	СменаКухниНаСменеПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура СменаКухниПолнаяСменаПриИзменении(Элемент)
	СменаКухниНаСменеПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриЗакрытииНаСервере()

КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ПриЗакрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДозагрузкаТолькоДолговыхЗП(Команда)
	ЗагрузкаДолговПоЗП();
КонецПроцедуры

&НаКлиенте
Процедура РассчетЗакупок1(Команда)
 	РассчетЗакупок();
КонецПроцедуры

&НаСервере
Процедура ЗадолжнотиЗакупщикаСуммаОплатыПриИзмененииНаСервере()
	Для Каждого Выборка Из Объект.ЗадолжнотиЗакупщика Цикл
		Если Выборка.Сумма > Выборка.СуммаТекущейЗакупки Тогда
			Выборка.Сумма = Выборка.СуммаТекущейЗакупки;
		КонецЕсли;
		Выборка.Неоплачено = Выборка.СуммаТекущейЗакупки - Выборка.Сумма;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадолжнотиЗакупщикаСуммаОплатыПриИзменении(Элемент)
	ЗадолжнотиЗакупщикаСуммаОплатыПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Шесть(Команда)
	РедактированиеСумм("6");
КонецПроцедуры

Процедура РедактированиеСумм(Число)
	Если Элементы.Страницы.ТекущаяСтраница.Заголовок = "Основная информация" Тогда
		ТекСтрока = Элементы.ОсновнаяИнформация.ТекущаяСтрока;
		ЗначенияСтроки = Объект.ОсновнаяИнформация.НайтиПоИдентификатору(ТекСтрока);
	
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница.Заголовок = "Расходы" Тогда
		ТекСтрока = Элементы.Расходы.ТекущаяСтрока;
		ЗначенияСтроки = Объект.Расходы.НайтиПоИдентификатору(ТекСтрока);
	
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница.Заголовок = "Накладные" Тогда
		ТекСтрока = Элементы.Накладные.ТекущаяСтрока;
		ЗначенияСтроки = Объект.Накладные.НайтиПоИдентификатору(ТекСтрока);
	
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница.Заголовок = "Зарплаты" Тогда
		ТекСтрока = Элементы.Зарплаты.ТекущаяСтрока;
		ЗначенияСтроки = Объект.Зарплаты.НайтиПоИдентификатору(ТекСтрока);
	
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница.Заголовок = "Долговые накладные" Тогда
		ТекСтрока = Элементы.ДолговыеНакладные.ТекущаяСтрока;
		ЗначенияСтроки = Объект.ДолговыеНакладные.НайтиПоИдентификатору(ТекСтрока);
	
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница.Заголовок = "Оплаты закупщика" Тогда
		ТекСтрока = Элементы.ОплатыЗакупщика.ТекущаяСтрока;
		ЗначенияСтроки = Объект.ЗадолжнотиЗакупщика.НайтиПоИдентификатору(ТекСтрока);
	
	КонецЕсли;
	
	ТекущееЗначение = ЗначенияСтроки.Сумма;
	Если Число = "*" Тогда
		ЗначенияСтроки.Сумма = 0;	
	ИначеЕсли Число = "." Тогда
		НовоеЗначение=Число(Строка(ТекущееЗначение)+Число+"0001");	
	Иначе	
		НовоеЗначение=Число(Строка(ТекущееЗначение)+Число);
	КонецЕсли;
	
	ЗначенияСтроки.Сумма = НовоеЗначение;
	
	АвтосохранениеДокументаНаСервере();
КонецПроцедуры


&НаСервере
Процедура СтраницыПриСменеСтраницыНаСервере()
	//Объект.АктивСтраниц=
	
КонецПроцедуры


&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	СтраницыПриСменеСтраницыНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура Восемь(Команда)
	РедактированиеСумм("8");

КонецПроцедуры


&НаКлиенте
Процедура Два(Команда)
	РедактированиеСумм("2");

КонецПроцедуры


&НаКлиенте
Процедура Девять(Команда)
	РедактированиеСумм("9");

КонецПроцедуры


&НаКлиенте
Процедура ОчиститьПоле(Команда)
	РедактированиеСумм("*");
	
КонецПроцедуры


&НаКлиенте
Процедура Ноль(Команда)
	РедактированиеСумм("0");

КонецПроцедуры


&НаКлиенте
Процедура Один(Команда)
	РедактированиеСумм("1");

КонецПроцедуры


&НаКлиенте
Процедура Пять(Команда)
	РедактированиеСумм("5");

КонецПроцедуры


&НаКлиенте
Процедура Семь(Команда)
	РедактированиеСумм("7");

КонецПроцедуры


&НаКлиенте
Процедура Точка(Команда)
	РедактированиеСумм(",");

КонецПроцедуры


&НаКлиенте
Процедура Три(Команда)
	РедактированиеСумм("3");

КонецПроцедуры


&НаКлиенте
Процедура Четыри(Команда)
	РедактированиеСумм("4");

КонецПроцедуры

&НаСервере
Процедура ОбновитьНакладные() 
	Для Каждого Выборка Из Объект.Накладные Цикл
		Если НЕ Выборка.СсылкаНаНакладную.Пустая() Тогда
			СсылкаНаДок = Выборка.СсылкаНаНакладную.ПолучитьОбъект(); 
			СсылкаНаДок.Удалить(); 
			Выборка.СсылкаНаНакладную = "";
		КонецЕсли;
		Склад = Справочники.Склады.ПолучитьСклад(Объект.Заведение, Выборка.Поставщик.Склад); 
		Выборка.СсылкаНаНакладную = Документы.ПриходнаяНакладная.СоздатьНакладную(Объект.Заведение, Объект.ДатаСмены,Склад, 
										Выборка.Поставщик, Выборка.БН, Выборка.Сумма, Объект.Ссылка, Выборка.Номер); 

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНакладные1(Команда)
	ОбновитьНакладные();
КонецПроцедуры


&НаСервере
Процедура НакладныеПриОкончанииРедактированияНаСервере(НомерСтроки,ИзминенноеПоле)

	Для Каждого Выборка Из Объект.Накладные Цикл
		Если Выборка.НомерСтроки = НомерСтроки Тогда
			//вариант 1 (накладная новая)
			//создаем накладную полностью
			Если Выборка.СсылкаНаНакладную.Пустая() Тогда
				//Сообщить("Документ будет создан");
				Склад = Справочники.Склады.ПолучитьСклад(Объект.Заведение,Выборка.Поставщик.Склад); 
				Выборка.СсылкаНаНакладную = Документы.ПриходнаяНакладная.СоздатьНакладную(Объект.Заведение,Объект.ДатаСмены,
					Склад,Выборка.Поставщик,Выборка.БН, Выборка.Сумма,,Выборка.Номер,Объект.Заведение);
			КонецЕсли;
			//вариант 2 (накладная уже существует)
			//изминяем только поле что было изминенено
			Если НЕ Выборка.СсылкаНаНакладную.Пустая() Тогда
				НазвРеквезит = СтрЗаменить(СтрЗаменить(ИзминенноеПоле,"Накладные",""),"ПН","");
				Если НазвРеквезит="Оплачено" Тогда
					Если Выборка.Оплачено = Истина Тогда
						//проверка есть ли текущая оплата
						СсылкаНаОрдер = Документы.РасходныйКассовыйОрдер.СсылкаНаРассчет(Выборка.СсылкаНаНакладную);
						Если СсылкаНаОрдер = Неопределено Тогда
							Касса = Справочники.Кассы.ПолучитьКассу(Объект.Заведение);
							Статья = Справочники.СтатьиРасходов.ПолучитьСтатьюОрдера("84"); 
							//Выборка.СсылкаНаРассчет = СозданиеОбъектов.СоздатьРасходОрдера(Объект.ДатаСмены, Объект.Заведние, Касса,
							//	Выборка.Поставщик, Выборка.Сумма, Статья,,Выборка.СсылкаНаНакладную,);
						КонецЕсли;
					КонецЕсли;
					
					Если Выборка.Оплачено = Ложь Тогда
						СсылкаНаОрдер = Документы.РасходныйКассовыйОрдер.СсылкаНаРассчет(Выборка.СсылкаНаНакладную);	
						Если СсылкаНаОрдер = Неопределено Тогда
							Возврат;
						Иначе
							УниверсальныеОбработчикиДокументов.УдалениеДокумента(СсылкаНаОрдер);	
							Выборка.СсылкаНаРассчет = "";
						КонецЕсли;
					КонецЕсли;
					
					Возврат;
				КонецЕсли;

				
				Парам = Новый Структура;
				НазвРеквезит = СтрЗаменить(СтрЗаменить(ИзминенноеПоле,"Накладные",""),"ПН","");
				Парам.Вставить("Реквизит",НазвРеквезит);
				Если НазвРеквезит="Поставщик" Тогда
					Значение=Выборка.Поставщик;	
				ИначеЕсли НазвРеквезит="Номер" Тогда
					Значение=Выборка.Номер;	
				ИначеЕсли НазвРеквезит="Сумма" Тогда
					Значение=Выборка.Сумма;	
				ИначеЕсли НазвРеквезит="Закупщик" Тогда
					Значение=Выборка.Закупщик;	
				ИначеЕсли НазвРеквезит="БН" Тогда
					Значение=Выборка.БН;	
				КонецЕсли;
				Парам.Вставить("Значение",Значение);
				Документы.ПриходнаяНакладная.РедактированиеПрихДок_В2(Выборка.СсылкаНаНакладную,Парам);

//НакладныеНомер
//НакладныеСуммаПН
//НакладныеОплачено
//НакладныеЗакупщик
//НакладныеБН
//НакладныеПоставщик
				
			КонецЕсли;
		КонецЕсли;	
										

	КонецЦикла;

КонецПроцедуры




&НаСервере
Процедура НакладныеПередУдалениемНаСервере(НомерСтроки) 
	Для Каждого Выборка Из Объект.Накладные Цикл
		Если Выборка.НомерСтроки = НомерСтроки Тогда
			УдалениеЗависимыхДокументов(Выборка.СсылкаНаДок);
			//Если ЗначениеЗаполнено(Выборка.СсылкаНаДок)=Истина Тогда
			//	СсылкаНаОрдер = ПолучениеОбщейИнформации.СсылкаНаРассчет(Выборка.СсылкаНаДок);
			//	Если НЕ СсылкаНаОрдер = Неопределено Тогда
			//		Работа_С_Объектами.УдалениеРасходОрдера(Выборка.СсылкаНаДок);	
			//	КонецЕсли;
			//	Если ЗначениеЗаполнено(Выборка.СсылкаНаДок)=Истина Тогда
			//		Работа_С_Объектами.УдалениеПрихДок(Выборка.СсылкаНаДок);
			//	КонецЕсли;
			//	Возврат;
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры



&НаКлиенте
Процедура НакладныеПередУдалением(Элемент, Отказ)
	НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	НакладныеПередУдалениемНаСервере(НомерСтроки);
КонецПроцедуры


&НаСервере
Процедура ПроверитьКонтрагента()
	//ТекСтрока = Элементы.Накладные.ТекущаяСтрока;
	//ЗначенияСтроки = Объект.Накладные.НайтиПоИдентификатору(ТекСтрока);
	//Если ЗначениеЗаполнено(ЗначенияСтроки.Поставщик)=Истина Тогда 
	//	Если ЗначенияСтроки.Поставщик.Запрет = Истина Тогда
	//		Сообщить("Данного поставщика нельзя выбрать!!!");
	//		ЗначенияСтроки.Поставщик = "";
	//	КонецЕсли;
	//	АвтосохранениеДокументаНаСервере();
	//КонецЕсли;
КонецПроцедуры // ПроверитьКонтрагента()


&НаКлиенте
Процедура НакладныеПоставщикПриИзменении(Элемент)
	
	//ПроверитьКонтрагента();

КонецПроцедуры

&НаСервере
Процедура СоздатьНовуюПН(НомерСтроки)
	Для Каждого Выборка Из Объект.Накладные Цикл
		Если Выборка.НомерСтроки = НомерСтроки Тогда
			Если ЗначениеЗаполнено(Выборка.СсылкаНаДок) = Ложь Тогда
		
				Склад = Справочники.Склады.ПолучитьСклад(Объект.Заведение,Выборка.Поставщик.Склад); 
				Выборка.СсылкаНаДок = Документы.ПриходнаяНакладная.СоздатьНакладную(Объект.Заведение,Объект.ДатаСмены,
					Склад,Выборка.Поставщик,Выборка.БН, Выборка.Сумма,,Выборка.Номер,Объект.Заведение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура НакладныеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	ИзминенноеПоле = Элемент.ТекущийЭлемент.Имя;
	НакладныеПриОкончанииРедактированияНаСервере(НомерСтроки, ИзминенноеПоле);
	
	////редактирование
	//ИмяТабличнойЧасти = Элемент.Имя;
	//ТекущаяСтрока = Элементы.Накладные.ТекущиеДанные.НомерСтроки;
	//
	////ссылка на ПН отсуствует
	//СоздатьНовуюПН(ТекущаяСтрока); //ПН будет создана если отсуствует ссылка в отчете на нее
	//Если НоваяСтрока = Ложь Тогда	
	//	ПроверкаИзминений(ИмяТабличнойЧасти, ТекущаяСтрока);
	//КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПроверкаИзминений(ИмяТабличнойЧасти, ТекущаяСтрока)
	ТекущийОбъект = ПолучитьОбъектПоНазванию(ИмяТабличнойЧасти);
	
	ТекущиеДанные = ТекущийОбъект.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    //СтруктураСтроки = Новый Структура;
    // Получаем метаданные табличной части
    РеквизитыТабличнойЧасти = ПолучитьМетаданныеТЧ(ИмяТабличнойЧасти);
	
	СтруктураСтроки = ПодготовкаДанных.СтруктураИзТЧДокумента(РеквизитыТабличнойЧасти,ТекущиеДанные);
	УниверсальныеОбработчикиДокументов.ОбновитьДокументПоСтруктуре(СтруктураСтроки, СтруктураСтроки["СсылкаНаДок"]);

КонецПроцедуры // ПроверкаНаИзминения()



&НаСервере
Функция ПолучитьМетаданныеТЧ(НазваниеТЧ)

	СтруктураТЧ = Новый Структура;
	СтруктураТЧ.Вставить("ОсновнаяИнформация",Метаданные.Документы.ДневнойОтчет.ТабличныеЧасти.ОсновнаяИнформация.Реквизиты);                     
	СтруктураТЧ.Вставить("Расходы", Метаданные.Документы.ДневнойОтчет.ТабличныеЧасти.Расходы.Реквизиты);  
	СтруктураТЧ.Вставить("Накладные", Метаданные.Документы.ДневнойОтчет.ТабличныеЧасти.Накладные.Реквизиты);  
	СтруктураТЧ.Вставить("Зарплаты", Метаданные.Документы.ДневнойОтчет.ТабличныеЧасти.Зарплаты.Реквизиты);  
	СтруктураТЧ.Вставить("ДолговыеНакладные", Метаданные.Документы.ДневнойОтчет.ТабличныеЧасти.ДолговыеНакладные.Реквизиты);  
	СтруктураТЧ.Вставить("ЗадолжнотиЗакупщика", Метаданные.Документы.ДневнойОтчет.ТабличныеЧасти.ЗадолжнотиЗакупщика.Реквизиты);  
	СтруктураТЧ.Вставить("НеОплаченыеЗП", Метаданные.Документы.ДневнойОтчет.ТабличныеЧасти.НеОплаченыеЗП.Реквизиты);  
	
	Возврат СтруктураТЧ[НазваниеТЧ];

КонецФункции // НазваниеТЧВСтруктуру()`


&НаСервере
Функция ПолучитьОбъектПоНазванию(НазваниеТЧ)

	СтруктураТЧ = Новый Структура;
	СтруктураТЧ.Вставить("ОсновнаяИнформация",Объект.ОсновнаяИнформация);                       
	СтруктураТЧ.Вставить("Расходы", Объект.Расходы);  
	СтруктураТЧ.Вставить("Накладные", Объект.Накладные);  
	СтруктураТЧ.Вставить("Зарплаты", Объект.Зарплаты);  
	СтруктураТЧ.Вставить("ДолговыеНакладные", Объект.ДолговыеНакладные);  
	СтруктураТЧ.Вставить("ЗадолжнотиЗакупщика", Объект.ЗадолжнотиЗакупщика);  
	СтруктураТЧ.Вставить("НеОплаченыеЗП", Объект.НеОплаченыеЗП);  
	
	Возврат СтруктураТЧ[НазваниеТЧ];

КонецФункции // НазваниеТЧВСтруктуру()


&НаСервере
Процедура УдалениеЗависимыхДокументов(СсылкаНаДокумент)

//    // Проверяем, что передана корректная ссылка
//    Если Не ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
//        Сообщить("Ошибка: Ссылка на документ не заполнена!");
//        Возврат;
//    КонецЕсли;

//    // Получаем массив ссылок на документы, где используется СсылкаНаДокумент
//    МассивСсылок = НайтиСсылки(СсылкаНаДокумент);

//    // Если ссылок нет, выводим сообщение
//    Если МассивСсылок.Количество() = 0 Тогда
//        Сообщить("Документы, содержащие ссылку, не найдены.");
//        Возврат;
//    КонецЕсли;

//    // Перебираем найденные ссылки
//    Для Каждого ЭлементСсылки Из МассивСсылок Цикл
//        Ссылка = ЭлементСсылки.Ссылка;
//        
//        // Проверяем, что это документ
//        Если Не ОбщегоНазначения.ЭтоДокумент(Ссылка.Метаданные()) Тогда
//            Продолжить;
//        КонецЕсли;

//        Попытка
//            // Получаем объект документа
//            ДокументОбъект = Ссылка.ПолучитьОбъект();
//            
//            // Проверяем, существует ли объект
//            Если ДокументОбъект = Неопределено Тогда
//                Сообщить("Документ " + Ссылка + " не существует.");
//                Продолжить;
//            КонецЕсли;

//            // Удаляем документ
//            ДокументОбъект.Удалить();
//            Сообщить("Удален документ: " + Ссылка);

//        Исключение
//            // Логируем ошибку
//            Сообщить("Ошибка при удалении документа " + Ссылка + ": " + ОписаниеОшибки());
//        КонецПопытки;
//    КонецЦикла;

//    Сообщить("Обработка завершена.");
КонецПроцедуры

&НаСервере
Функция ПроверкаУдаленияСчета()
	ТекСтрока = Элементы.СчетаНаУдаление.ТекущаяСтрока;
	ЗначенияСтроки = Объект.СчетаНаУдаление.НайтиПоИдентификатору(ТекСтрока);
	
	Возврат Документы.ЗапросНаУдалениеСчета.ПроверкаНаУдалениеСчета(Справочники.Заведения.ПолучитьЗаведение(Объект.Заведение), ЗначенияСтроки.НомерСчета);	
	
КонецФункции

&НаКлиенте
Процедура СчетаНаУдалениеПередУдалением(Элемент, Отказ)
	Отказ = ПроверкаУдаленияСчета();
	Если Отказ = Истина Тогда
		Сообщить("Отказ удаления. Счет удален на ресторане!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьОтчетСОтменами()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.ИД_Телеграма КАК ИД_Телеграма,
		|	Сотрудники.Рассылка КАК Рассылка,
		|	Сотрудники.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Рассылка = &Рассылка";
	
	Запрос.УстановитьПараметр("Рассылка", Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Получатель = Число(Выборка.ИД_Телеграма);
		Если Объект.СчетаНаУдаление.Количество() > 0 Тогда	
			ТекстСообщения = "";
			ТекстСообщения = "Отмены " + Строка(Объект.Заведение) + ": " + Строка(Формат(Объект.ДатаСмены,"ДФ=dd.MM")) + Символы.ПС + Символы.ПС;
			Для Каждого ТекСтрока Из Объект.СчетаНаУдаление Цикл
				ТекстСообщения = ТекстСообщения + ТекСтрока.НомерСтроки + ") Счет " + Формат(ТекСтрока.НомерСчета,"ЧРГ=' '; ЧГ=0") + " - " + ТекСтрока.Сумма + " " + ТекСтрока.ПричинаОтказа.Наименование + 
						" (" + СокрЛП(ТекСтрока.Коментарий) + ")" + Символы.ПС;
			КонецЦикла;
			Telegram.SendMessage(Получатель, ТекстСообщения);	
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьУдаленыеСчета()
	
	Для Каждого Счет Из Объект.СчетаНаУдаление Цикл
		Если Счет.НомерСчета = 0 Или Счет.Сумма = 0 Или ЗначениеЗаполнено(Счет.ПричинаОтказа) = Ложь Тогда
			Сообщить("Заполнены не все данные для удаления счета в строке " + Строка(Счет.НомерСтроки));
			Продолжить;
		КонецЕсли;
		Счет.Статус = Документы.ЗапросНаУдалениеСчета.ПроверкаНаУдалениеСчета(Справочники.Заведения.ПолучитьЗаведение(Объект.Заведение),Счет.НомерСчета);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтмены(Команда)
	ОтправитьОтчетСОтменами();
КонецПроцедуры

&НаКлиенте
Процедура СчетаНаУдалениеПередНачаломИзменения(Элемент, Отказ)
	Если ПроверкаУдаленияСчета() = Истина Тогда
		Сообщить("Данные не могут быть измененны. Счет удален на ресторане!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СчетаНаУдалениеПриИзменении(Элемент)
	АвтосохранениеДокументаНаСервере();
КонецПроцедуры


