
&НаСервере
Процедура ПолучитьНаСервере()
	Объект.ТЧ.Очистить();

	Отчет = Документы.ДневнойОтчет.Выбрать(Объект.НачДата,Объект.КонДата);
	Пока Отчет.Следующий() Цикл
		
		Для Каждого Выборка Из Отчет.Накладные Цикл
			Если ЗначениеЗаполнено(Объект.Поставщик) Тогда
				Если Выборка.Поставщик = Объект.Поставщик Тогда
					Запись = Объект.ТЧ.Добавить();
					Запись.Заведение = Строка(Отчет.Заведение); 
					Запись.Дата = Отчет.ДатаСмены;
					Запись.Сумма = Строка(Выборка.Сумма);
				КонецЕсли;
			Иначе
				Запись = Объект.ТЧ.Добавить();
				Запись.Заведение = Строка(Отчет.Заведение); 
				Запись.Дата = Отчет.ДатаСмены;
				Запись.Сумма = Строка(Выборка.Сумма);
				Запись.Склад = Выборка.Поставщик.Склад;
				Запись.Поставщик = Выборка.Поставщик;

			КонецЕсли;
		КонецЦикла;
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Получить(Команда)
	ПолучитьНаСервере();
КонецПроцедуры
