
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьДанныеФормы();		
КонецПроцедуры


&НаСервере
Процедура ОбновитьДанныеФормы()
	//получаем ссылку на документ.
	СсылкаНаДок = Константы.ДокументНаТест.Получить();	//заполняем данные из документа
	
	Отчет = СсылкаНаДок.ПолучитьОбъект();
	//Осн.инф
	Для Каждого Запись Из Отчет.ОсновнаяИнформация Цикл
		НовЗапись = Объект.ОсновнаяИнформация.Добавить();
		НовЗапись.Статья = Запись.Статья;
		НовЗапись.Сумма = Запись.Сумма;
	КонецЦикла;
	
	//расходы
	Для Каждого Запись Из Отчет.Расходы Цикл
		НовЗапись = Объект.Расходы.Добавить();
		НовЗапись.Статья = Запись.Статья;
		НовЗапись.Сумма = Запись.Сумма;
		НовЗапись.Коментарий = Запись.Коментарий;
	КонецЦикла;
	
	//зарплаты
	Для Каждого Запись Из Отчет.Зарплаты Цикл
		НовЗапись = Объект.Зарплаты.Добавить();
		НовЗапись.Сотрудник = Запись.Сотрудник;
		НовЗапись.Сумма = Запись.Сумма;
		НовЗапись.Выдана = Запись.Выдана;	
	КонецЦикла;
	
	//накладные
	Для Каждого Запись Из Отчет.Накладные Цикл
		НовЗапись = Объект.Накладные.Добавить();
		НовЗапись.Поставщик = Запись.Поставщик;
		НовЗапись.Оплачено = Запись.Оплачено;
		НовЗапись.Сумма = Запись.Сумма;
		НовЗапись.Закупщик = Запись.Закупщик;
		НовЗапись.Номер = Запись.Номер;
		НовЗапись.ТипНакладной = Запись.ТипНакладной;
	КонецЦикла;
	
	//долговые ПН
	Для Каждого Запись Из Отчет.ДолговыеНакладные Цикл
		НовЗапись = Объект.ДолговыеНакладные.Добавить();
		НовЗапись.Дата = Запись.Дата;
		НовЗапись.Поставщик = Запись.Поставщик;
		НовЗапись.Сумма = Запись.Сумма;
		НовЗапись.Оплачен = Запись.Оплачен;
		НовЗапись.Номер = Запись.Номер;
		НовЗапись.Ошибка = Запись.Ошибка;
	КонецЦикла;
	
	//оплаты закупщика
	Для Каждого Запись Из Отчет.ЗадолжнотиЗакупщика Цикл
		НовЗапись = Объект.ЗадолжнотиЗакупщика.Добавить();
		НовЗапись.Дата = Запись.Дата;
		НовЗапись.Сумма = Запись.Сумма;	
	КонецЦикла;
	//рассчеты по ЗП
	
КонецПроцедуры
