
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр АтрибутыЗадачи
	Движения.АтрибутыЗадачи.Записывать = Истина;
	Движение = Движения.АтрибутыЗадачи.Добавить();
	Движение.Период = Дата;
	Движение.Задача = Задача;
	Движение.Атрибут = Атрибут;
	Движение.Значение = Значение;
	Движение.Автор = Автор;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
