
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьПодключаемоеОборудование = _ДемоПодключаемоеОборудованиеВызовСервера.ИспользоватьПодключаемоеОборудование();
	
	ТипыОборудования = МенеджерОборудования.ПараметрыТипыОборудования();
	ТипыОборудования.СканерШтрихкода = Истина;
	МенеджерОборудования.ПриСозданииНаСервере(ЭтаФорма, ТипыОборудования);
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Асинх Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	Результаты = Ждать МенеджерОборудованияКлиент.ПодключитьОборудованиеПриОткрытииФормыАсинх(ЭтаФорма);
	Для каждого Результат Из Результаты Цикл
		Если Не Результат.Результат Тогда
			Сообщить(СтрШаблон(НСтр("ru = 'Ошибка: %1 %2'"),Результат.ИдентификаторУстройства, Результат.ОписаниеОшибки));
		КонецЕсли;
	КонецЦикла;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

// Процедура - обработчик события "ПриЗакрытии" формы.
//
&НаКлиенте
Асинх Процедура ПриЗакрытии()
	
	// ПодключаемоеОборудование
	Результат = Ждать МенеджерОборудованияКлиент.ОтключитьОборудованиеПриЗакрытииФормыАсинх(ЭтаФорма);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаОповещения" формы.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И Параметр.Свойство("Штрихкод") Тогда
			Если Не ОбработатьПолученныйШКНаКлиенте(Параметр.Штрихкод) Тогда
				СообщитьОбОшибке(Параметр.Штрихкод)
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция обрабатывает полученный штрихкод от сканера штрихкодов на сервере.
//
&НаСервере
Функция ОбработатьПолученныйШКНаСервере(ТекКод)
	
	КодЭлемента = _ДемоПодключаемоеОборудованиеВызовСервера.ПоискПоШтрихкоду(ТекКод, Истина);
	Если КодЭлемента.Количество() Тогда
		Результат = КодЭлемента[0].Код;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

// Функция обрабатывает полученный штрихкод от сканера штрихкодов на клиенте.
//
&НаКлиенте
Функция ОбработатьПолученныйШКНаКлиенте(ТекКод)
	
	Результат = Истина;
	КодЭлемента = ОбработатьПолученныйШКНаСервере(ТекКод);
	Если КодЭлемента <> Неопределено Тогда
		Элемент = НайтиЭлементСправочникаНаСервере(КодЭлемента);
		ПараметрыОткрытия = Новый Структура("Ключ", Элемент);
		ОткрытьФорму("Справочник._ДемоНоменклатура.Форма.ФормаЭлемента",ПараметрыОткрытия);
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает элемент справочника (СправочникСсылка.Номенклатура).
//
&НаСервере
Функция НайтиЭлементСправочникаНаСервере(КодЭлемента)
	
	Возврат Справочники._ДемоНоменклатура.НайтиПоКоду(КодЭлемента);
	
КонецФункции

&НаКлиенте
Процедура СообщитьОбОшибке(ТекКод)
	
	ТекстСообщения = НСтр("ru = 'Позиция номенклатуры не найдена'");
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти
