
&НаСервере
Процедура СоздатьЗадачуНаСервере()
	//Создаем документ задачи  \
	ДокЗадача = Документы.Задача.СоздатьДокумент();
	ДокЗадача.Дата = Объект.Дата;
	ДокЗадача.ОписаниеЗадачи = Объект.ОписаниеЗадачи;
	ДокЗадача.СрокВыполнения = Объект.СрокВыполнения;
	
	ДокЗадача.Записать();
	
	Объект.СсылкаНаЗадачу = ДокЗадача.Ссылка;
	//Проводим текущийДокумент
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачу(Команда)
	СоздатьЗадачуНаСервере();   
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ТекущееСостояние = Перечисления.СостояниеЗадач.Создано;
	//Заказщик
	Объект.Приоритет = Перечисления.Приоритет.Средний;
КонецПроцедуры
