
&НаСервере
Процедура СоздатьНаСервере()
	ТекДата = Объект.НачалоНедели;
	Конец = КонецНедели(ТекДата);
	
	Пока ТекДата <= Конец Цикл
	    СсылкаНаЗадачу = Документы.ПланРабот.СозданиеДокументаПланаРабот(ТекДата,,Формат(ТекДата,"ДФ=dd.MM"),Объект.Ответственный,Перечисления.СтатусВыполнения.Создано,
				,,Перечисления.ТипПланаРабот.Главный,Объект.Объект,Перечисления.ФункциональныйТипПлана.ПланЗадача,Объект.КласификацияЗадачи);
		Документы.СменаСтатуса.СменаСтатуса(,,СсылкаНаЗадачу,Перечисления.СтатусВыполнения.Создано,);

		ТекДата = ТекДата + 86400;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	СоздатьНаСервере();
КонецПроцедуры
