Функция ОтправитьHTTPЗапрос(Токен, Метод, ПараметрыМетода) Экспорт 
	СоединениеHTTP = Новый HTTPСоединение("api.telegram.org",443,,,,,Новый ЗащищенноеСоединениеOpenSSL(),);
	МойToken = "6713646445:AAHUf_rZFTeumMEjLA0hl-VqkTpd983U8Pg"; 	
	ЗапросHTTP = Новый HTTPЗапрос;
	ЗапросHTTP.Заголовки.Вставить("Сontent-type", "application/json");
	//ЗапросHTTP.АдресРесурса = "bot"+Константы.TokenTelegram.Получить()+"/"+Метод+"?"+ПараметрыМетода[0];
	ЗапросHTTP.АдресРесурса = "bot"+МойToken+"/"+Метод+"?"+ПараметрыМетода[0]+"&"+ПараметрыМетода[1];

	//api.telegram.org/bot7869157368:AAGi2jl5kvQ1qjVlh7BqCjL0eOFI72qz1uE/getUpdates?chat_id=279240913&text="Новое сообщение"
	ОтветHTTP = СоединениеHTTP.Получить(ЗапросHTTP);
	
	Если ОтветHTTP.КодСостояния = 200 Тогда
		РезультатЗапроса = ОтветHTTP.ПолучитьТелоКакСтроку();	
	КонецЕсли;
	
	Возврат РезультатЗапроса;
КонецФункции                               