Функция СоздатьНакладную(Заведение, ДатаНакладной, Склад, Поставщик, ТипНакладной, Сумма, Ссылка, ВнешнийНомер, ВладелецДокумента) Экспорт
	
	ПрихДок = Документы.ПриходнаяНакладная.СоздатьДокумент();
	ПрихДок.Дата =  ДатаНакладной;
	ПрихДок.Заведение = Заведение;
	ПрихДок.Склад = Склад;
	ПрихДок.Поставщик = Поставщик;
	ПрихДок.ДокументСоздан = ВладелецДокумента;

	Если ТипНакладной = Истина Тогда
		ПрихДок.ТипНакладной = Перечисления.ТипРассчетов.БезнальныйРассчет;
	Иначе
		ПрихДок.ТипНакладной = Перечисления.ТипРассчетов.Наличные;
	КонецЕсли;
	ПрихДок.Сумма = Сумма;
	ПрихДок.СсылкаНаОтчет = Ссылка;
	ПрихДок.ВнешнийНомер = ВнешнийНомер;

	ПрихДок.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ПрихДок.Ссылка;
	
КонецФункции

Процедура РедактированиеПрихДок(Ссылка, Заведение, Склад, Поставщик, ТипНакладной, ВнешнийНомер, Сумма) Экспорт 
	
	ПрихДок = Ссылка.ПолучитьОбъект();
	ПрихДок.Заведение = Заведение; 
	ПрихДок.Склад = Справочники.Склады.ПолучитьСклад(Заведение, Склад); 
	ПрихДок.Поставщик = Поставщик;
	ПрихДок.ТипНакладной = ТипНакладной;
	ПрихДок.ВнешнийНомер = ВнешнийНомер;
	ПрихДок.Сумма = Сумма;

	ПрихДок.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура РедактированиеПрихДок_В2(Ссылка, ПараметрыРедактирования) Экспорт  //в параметрах структура: поле редактирования, новое значение
	
	
	ПрихДок = Ссылка.ПолучитьОбъект();
	ПолеРедактирования = ПараметрыРедактирования.Реквизит;
	Значение = ПараметрыРедактирования.Значение;
	
	Если ПолеРедактирования = "Заведение" Тогда
		ПрихДок.Заведение = Значение; 	
	ИначеЕсли ПолеРедактирования = "Поставщик" Тогда
		ПрихДок.Поставщик = Значение;
		ПрихДок.Склад = Справочники.Склады.ПолучитьСклад(ПрихДок.Заведение, ПрихДок.Поставщик.Склад);	
	ИначеЕсли ПолеРедактирования = "БН" Тогда
		Если Значение = Истина Тогда
			ПрихДок.ТипНакладной = Перечисления.ТипРассчетов.БезнальныйРассчет;
		Иначе
			 ПрихДок.ТипНакладной = Перечисления.ТипРассчетов.Наличные;
		КонецЕсли;
	ИначеЕсли ПолеРедактирования = "Номер" Тогда
		ПрихДок.ВнешнийНомер = Значение;
	ИначеЕсли ПолеРедактирования = "Сумма" Тогда
		ПрихДок.Сумма = Значение;
		ИначеЕсли ПолеРедактирования = "Закупщик" Тогда
		ПрихДок.Закупщик = Значение;
	КонецЕсли; 
	//НакладныеНомер
//НакладныеСуммаПН
//НакладныеОплачено
//НакладныеЗакупщик
//НакладныеБН
//НакладныеПоставщик
			
	ПрихДок.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Функция СсылкаНаНакладную(Заведение, ДатаСмены,ИндексСтраницы, ИндексСтроки) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладная.Дата КАК Дата,
		|	ПриходнаяНакладная.Заведение КАК Заведение,
		|	ПриходнаяНакладная.ИндексСтроки КАК ИндексСтроки,
		|	ПриходнаяНакладная.ИндексСтраницы КАК ИндексСтраницы,
		|	ПриходнаяНакладная.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ГДЕ
		|	ПриходнаяНакладная.Дата = &Дата
		|	И ПриходнаяНакладная.Заведение = &Заведение
		|	И ПриходнаяНакладная.ИндексСтроки = &ИндексСтроки
		|	И ПриходнаяНакладная.ИндексСтраницы = &ИндексСтраницы";
	
	Запрос.УстановитьПараметр("Дата", ДатаСмены);
	Запрос.УстановитьПараметр("Заведение", Заведение);
	Запрос.УстановитьПараметр("ИндексСтраницы", ИндексСтраницы);
	Запрос.УстановитьПараметр("ИндексСтроки", ИндексСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();		
		
	Возврат Выборка.Ссылка;	
	
КонецФункции

Функция ВладелецДокументаПрихДок(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладная.Ссылка КАК Ссылка,
		|	ПриходнаяНакладная.ДокументСоздан КАК ДокументСоздан
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ГДЕ
		|	ПриходнаяНакладная.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.ДокументСоздан;
	
КонецФункции

Функция СсылкаНаДокЗакупщика(Заведение, ДатаОтчета) Экспорт
	
	Поставщик = Справочники.СистемныеПоставщики.ПолучитьСистемногоПоставщика(Заведение);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладная.Поставщик КАК Поставщик,
		|	ПриходнаяНакладная.Дата КАК Дата,
		|	ПриходнаяНакладная.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ГДЕ
		|	ПриходнаяНакладная.Поставщик = &Поставщик
		|	И ПриходнаяНакладная.Дата = &Дата";
	
	Запрос.УстановитьПараметр("Дата", ДатаОтчета);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
    Возврат Выборка.Ссылка
	

КонецФункции // СсылкаНаДокЗакупщика()

