
&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	//1. Сохраняем документ
	Записать();
	Если Объект.СсылкаНаПланРабот.Пустая() = Ложь Тогда
		Сообщить("Текущий заказ обработан ранее!");
		Возврат;
	КонецЕсли;
	СсылкаНаЗаказКлиент=Объект.Ссылка;
	
	//2. Сформировать план выполнения работ
	ДатаДок = Объект.Дата;
	СсылкаНаЗаказКлиент = СсылкаНаЗаказКлиент;
	Заказ = Объект.Заказ;   //надо передать текст
	Ответственный = Объект.Ответственный;
	СтатусВыполнения = Перечисления.СтатусВыполнения.Создано;
	СрокВыполнения = Объект.СрокВыполнения;
	СсылкаНаПланРабот = "";
	ТипПланаРабот = Перечисления.ТипПланаРабот.Главный;
	ОбъектКлиента = Объект.Объект;
	ФункциональныйТип = Перечисления.ФункциональныйТипПлана.ПланПроект;
	Задача = Объект.ТипЗадачи;
	Объект.СсылкаНаПланРабот = Документы.ПланРабот.СозданиеДокументаПланаРабот(ДатаДок,СсылкаНаЗаказКлиент,Заказ,Ответственный,
													СтатусВыполнения,СрокВыполнения,СсылкаНаПланРабот,ТипПланаРабот,ОбъектКлиента,ФункциональныйТип,Задача);
	Записать();
	
	Документы.СменаСтатуса.СменаСтатуса(Объект.Ссылка,Неопределено,Объект.СсылкаНаПланРабот,Перечисления.СтатусВыполнения.Создано,ФункциональныйТип);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроект(Команда)
	Если Объект.СсылкаНаПланРабот.Пустая() = Истина Тогда
		Сообщить("Проект еще не создан!");
		Сообщить("Необходимо обработать заказ!");
		Возврат;
	КонецЕсли;
	
	Парам = Новый Структура;
	Парам.Вставить("Ключ",Объект.СсылкаНаПланРабот);
	
	ОткрытьФорму("Документ.ПланРабот.Форма.ФормаДокумента", Парам);
КонецПроцедуры
