&НаСервере
Процедура ОбновитьДанныеТовара(Индификатор)
	ПолученыеЗначения = Объект.ТЧ.НайтиПоИдентификатору(Индификатор);
	ПолученыеЗначения.ШтрихКод = ПолученыеЗначения.Номенклатура.ШтрихКод;
	ПолученыеЗначения.ЕдиницаИзмирения = ПолученыеЗначения.Номенклатура.ЕдиницаИзмирения;
	ПолученыеЗначения.НаОстатке = ПолучениеИнформации.ПолучитьОстаток(ПолученыеЗначения.Номенклатура);
	
	Если ПолученыеЗначения.НаОстатке < ПолученыеЗначения.Количество Тогда
		ПолученыеЗначения.Количество = ПолученыеЗначения.НаОстатке;
		Сообщить("На остатке нет такого количества товара!");
	КонецЕсли;
	
	ПолученыеЗначения.Цена = ПолучениеИнформации.ПолучитьЦену(ПолученыеЗначения.Номенклатура);
	ПолученыеЗначения.Сумма = ПолученыеЗначения.Количество * ПолученыеЗначения.Цена;
КонецПроцедуры


 

&НаКлиенте
Процедура ТЧПриИзменении(Элемент)
	ОбновитьДанныеТовара(Элементы.ТЧ.ТекущаяСтрока);
КонецПроцедуры
