Функция ПолучитьЗаведение(Заведение) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заведения.Ссылка КАК Ссылка,
		|	Заведения.Заведение КАК Заведение
		|ИЗ
		|	Справочник.Заведения КАК Заведения
		|ГДЕ
		|	Заведения.Заведение = &Заведение";
	
	Запрос.УстановитьПараметр("Заведение", Заведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий(); 	
	
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция ПолучитьИмяХоста(Заведение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заведения.Ссылка КАК Ссылка,
		|	Заведения.Заведение КАК Заведение,
		|	Заведения.АдрессХоста КАК АдрессХоста
		|ИЗ
		|	Справочник.Заведения КАК Заведения
		|ГДЕ
		|	Заведения.Заведение = &Заведение";
	
	Запрос.УстановитьПараметр("Заведение", Заведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	ИмяХоста=СокрЛП(Выборка.АдрессХоста);
	Возврат ИмяХоста;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецФункции
