&НаСервере
Функция ДанныеВыделенойСтроки()
	
	//ТекСтрока = Элементы.СписокЗадач.ТекущаяСтрока;
	//ЗначенияСтроки = Объект.УчетныеЗаписи.НайтиПоИдентификатору(ТекСтрока);	
	//
	//Возврат ЗначенияСтроки; 
	//
КонецФункции



&НаСервере
Процедура СписокЗадач_Колонки_ПриИзминении(Колонка)


КонецПроцедуры // СписокЗадач_Колонки_ПриИзминении()


&НаКлиенте
Процедура УчетныеЗаписиПоказатьПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

//&НаСервере
//Функция ДанныеВыбСтрокиВ_Структуре(ТекСтрока, Колонка,НазваниеТЧ)
//	
//	ЗначенияСтроки = Объект.ДополнительнаяИнформация.НайтиПоИдентификатору(ТекСтрока);
//	МасивТЧ = Объект.ДополнительнаяИнформация.Выгрузить();
//	
//	Колонки = Новый Структура;
//	Для Каждого Колонка Из МасивТЧ.Колонки Цикл
//		Колонки.Вставить(НазваниеТЧ+Колонка, ЗначенияСтроки[Колонка.Имя]); 
//	КонецЦикла;

//	Возврат Колонки;

//КонецФункции


&НаСервере
Функция ДанныеВыбСтрокиВ_Структуре(ТекСтрока, НазваниеКолонки, НазваниеТЧ)
	////надо вернуть только выраное значение
	////объект получаем из заполненого соответствия
	////название колонки можно передать массивом, если надо получить несколько значений
	//ЗначенияСтроки = Объект.УчетныеЗаписи.НайтиПоИдентификатору(ТекСтрока);
	//НазваниеКолонки = СтрЗаменить(НазваниеКолонки, НазваниеТЧ, ""); 
	//ТекущееЗначение = ЗначенияСтроки[НазваниеКолонки];
	////МасивТЧ = Объект.ДополнительнаяИнформация.Выгрузить();
	////
	////из таблицы значений получаю название колонок
	////найти по ключу
	////Колонки = Новый Структура;
	////Для Каждого Колонка Из МасивТЧ.Колонки Цикл
	////	Колонки.Вставить(НазваниеТЧ+Колонка, ЗначенияСтроки[Колонка.Имя]); 
	////КонецЦикла;

	//Возврат ТекущееЗначение;

КонецФункции


&НаСервере
Процедура ДополнительнаяИнформация_Колонки_ПриИзминении(Колонка,НазваниеТЧ)
	////ПОЛУЧИТЬ НОВОЕ ЗНАЧЕНИЕ
	//ТекСтрока = Элементы.ДополнительнаяИнформация.ТекущаяСтрока;

	//ВыбраноеЗначение = ДанныеВыбСтрокиВ_Структуре(ТекСтрока,Колонка,НазваниеТЧ);
	//
	//
	//Значение = Неопределено;
	//
	////СтрокаВСтруктуре.Свойства(Колонка, Значение);

	//
	//////ПРОВЕРИТЬ ИЗМИНЕНИЕ
	//////ВНЕСТИ ПРИ НЕОБХОДИМОСТИ
	////СоответствиеТЧ = КолонкиВСтруктуру();
	////ТекущийАтрибут = СоответствиеТЧ.Получить(Колонка);
	////
	////Если ТекущийАтрибут = Ложь Тогда
	////	//проверить и обновить вид задачи	
	////	//надо получить ссылку на задачу
	////	Данные = ДанныеВыделенойСтроки();
	////	Задача = Данные.Задача;
	////	ВидЗаписи = Данные.ВидЗаписи;
	////	ПолучениеИнформации_1.ПроверитьИОбновить_ВидЗаписи(Задача, ВидЗаписи);
	////	
	////Иначе
	////	ПроверкаИЗаписьАтрибутаВТЧ(ТекущийАтрибут);
	////КонецЕсли;


КонецПроцедуры 


&НаКлиенте
Процедура УчетныеЗаписиВидУчетнойЗаписиПриИзменении(Элемент)
	//ДополнительнаяИнформация_Колонки_ПриИзминении(Элемент.Имя, Элемент.Родитель.Имя);
КонецПроцедуры

