Функция ЗагрузитьСообщениеИзТелеграм()  Экспорт 
	РезультатЗапроса = GetUpdates(1);
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(РезультатЗапроса);
	СтруктураJson = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Если СтруктураJson.ok = Истина Тогда
		Для Каждого Сообщение Из СтруктураJson.result Цикл
			Константы.ПоследнийНомерСообщения.Установить(Сообщение.update_id);
			SendMessage(279240913,"Сообщение получено!");
			Сообщить("Пришло новое сообщени от "+Сообщение.message.from.first_name);
		КонецЦикла;
	КонецЕсли;
КонецФункции

Функция GetUpdates(offset=0, limit=0, timeout=0) Экспорт 
	ПараметрыМетода = Новый Массив;
	
	Если ЗначениеЗаполнено(offset) Тогда
		ПараметрыМетода.Добавить("offset="+Формат(offset,"ЧРГ=' '; ЧГ=" ));
	КонецЕсли;
	
	Результат = WEBHTTP.ОтправитьHTTPЗапрос(-1002745535324, "getUpdates", ПараметрыМетода);
	
	Возврат Результат;
КонецФункции

Функция SendMessage(chat_id, text) Экспорт 
	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(chat_id, "Число") Тогда
		Возврат Неопределено;
	КонецЕсли;   
	
	ПараметрыМетода = Новый Массив;
	
	ПараметрыМетода.Добавить("chat_id="+Формат(chat_id,"ЧРГ=' '; ЧГ=" ));
	ПараметрыМетода.Добавить("text="+СокрЛП(text));
	
	МойToken = "7869157368:AAGi2jl5kvQ1qjVlh7BqCjL0eOFI72qz1uE";
	//езультат = WEBHTTP.ОтправитьHTTPЗапрос(Константы.TokenTelegram.Получить(), "Sendmessage", ПараметрыМетода);
	Результат = WEBHTTP.ОтправитьHTTPЗапрос(МойToken, "Sendmessage", ПараметрыМетода);	
	Возврат Результат;       
	
КонецФункции 

Функция ОтправитьСообщениеВТелеграм(chat_id, text) Экспорт 

	
КонецФункции

Функция ПолучитьПараметрыЗапроса_SendMessage()
	
КонецФункции       

Функция ФайлУжеЗагружен(FileID)

	Возврат Ложь;

КонецФункции // ФайлУжеЗагружен()
