Функция АктуальныйСтатусЗадачи(Задача) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыЗадач_1СрезПоследних.Задача КАК Задача,
		|	СтатусыЗадач_1СрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыЗадач_1.СрезПоследних(, Задача = &Задача) КАК СтатусыЗадач_1СрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий(); 
	
	Возврат Выборка.Статус;
	
КонецФункции

Функция ХарактеристикаПоКоду(Код) Экспорт 
	Спр = Справочники.ХарактеристикиДатЗадач.НайтиПоКоду(Код);
	
	Возврат Спр;
КонецФункции

Функция ДатаСобытия(Задача, Код) Экспорт 
		
	ХарактеристикаДаты = Справочники.ХарактеристикиДатЗадач.НайтиПоКоду(Код);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыЗадачиСрезПоследних.Задача КАК Задача,
		|	ДатыЗадачиСрезПоследних.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.ДатыЗадачи.СрезПоследних(
		|			,
		|			ХарактеристикаДаты = &ХарактеристикаДаты
		|				И Задача = &Задача) КАК ДатыЗадачиСрезПоследних";
	
	Запрос.УстановитьПараметр("ХарактеристикаДаты", ХарактеристикаДаты);
	Запрос.УстановитьПараметр("Задача", Задача);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Дата;
	
КонецФункции

Функция ПроверкаСвязиОбъектов(Родитель, Подчиненный) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвязьОбъектов.Родитель КАК Родитель,
		|	СвязьОбъектов.Подчиненный КАК Подчиненный
		|ИЗ
		|	РегистрСведений.СвязьОбъектов КАК СвязьОбъектов
		|ГДЕ
		|	СвязьОбъектов.Родитель = &Родитель
		|	И СвязьОбъектов.Подчиненный = &Подчиненный";
	
	Запрос.УстановитьПараметр("Подчиненный", Подчиненный);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	
	
КонецФункции

Функция ТекущееЗначениеАтрибутаЗадачи(Задача, Атрибут) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АтрибутыЗадачиСрезПоследних.Задача КАК Задача,
		|	АтрибутыЗадачиСрезПоследних.Атрибут КАК Атрибут,
		|	АтрибутыЗадачиСрезПоследних.Значение КАК Значение,
		|	АтрибутыЗадачиСрезПоследних.Автор КАК Автор
		|ИЗ
		|	РегистрСведений.АтрибутыЗадачи.СрезПоследних(
		|			,
		|			Задача = &Задача
		|				И Атрибут = &Атрибут) КАК АтрибутыЗадачиСрезПоследних";
	
	Запрос.УстановитьПараметр("Атрибут", Атрибут);
	Запрос.УстановитьПараметр("Задача", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Значение;
	
КонецФункции



Функция ТекущийРодительЗадачи(Задача) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РодительЗадачиСрезПоследних.Родитель КАК Родитель
		|ИЗ
		|	РегистрСведений.РодительЗадачи.СрезПоследних(, Задача = &Задача) КАК РодительЗадачиСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Родитель;
	
КонецФункции

Функция ПроцентВыполненияЗадачи(Задача) Экспорт 
	//проверяем задачу
	//если  это задача подчиненых то проверяем на выполнение
	
	//если есть подчиненые рекурсивно вызываем 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РодительЗадачиСрезПоследних.Задача КАК Задача,
		|	РодительЗадачиСрезПоследних.Родитель КАК Родитель
		|ИЗ
		|	РегистрСведений.РодительЗадачи.СрезПоследних КАК РодительЗадачиСрезПоследних
		|ГДЕ
		|	РодительЗадачиСрезПоследних.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ОбщееКолЗадач = 0;
	ПрогресВыполнения = 0;
	ЗадачаРодитель = Ложь;
	
	Пока Выборка.Следующий() Цикл
		ЗадачаРодитель = Истина;
		//сюда мы можем попасть только если есть какие то задачи внутри

		ОбщееКолЗадач = ОбщееКолЗадач + 1;
		ПрогресВыполнения = ПрогресВыполнения + Документы.ПланРабот.ПроцентВыполненияЗадачи(Выборка.Задача);
		
	КонецЦикла;
	

	Если ЗадачаРодитель = Истина Тогда
			
		Если ОбщееКолЗадач = 0 Тогда
			ОбщееКолЗадач = 1;
		КонецЕсли;

		Возврат ПрогресВыполнения/ОбщееКолЗадач; 

	КонецЕсли;
	
	//сюда попадаем если задач нижнего уровня
	АктуальныйСтатус = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Задача, Перечисления.АтрибутыЗадачи.СтатусВыполнения);		
	
	Если АктуальныйСтатус = Перечисления.СтатусВыполнения.Завершено Тогда
		Возврат 100;
	Иначе
		Возврат 0;
	КонецЕсли;


КонецФункции 

Функция СформироватьСтрокуПрогрессБара(Задача, ЧислоДеления) Экспорт 
	
	ПроцентВыполнения = Документы.ПланРабот.ПроцентВыполненияЗадачи(Задача);	
	
	СтрокаПолных = "";
	СтрокаПустых = "";
	ПолныхСимволов = ПроцентВыполнения/ЧислоДеления;
	ПустыхСимволов = 25 - ПолныхСимволов;
	Для Сч = 1 По ПолныхСимволов Цикл
		СтрокаПолных = СтрокаПолных + "█";
	КонецЦикла;
	Для Сч = 1 По ПустыхСимволов Цикл
		СтрокаПустых = СтрокаПустых + "░";
	КонецЦикла;
	
	СтрокаПрогрессБара = СтрокаПолных + СтрокаПустых + " " + Формат(ПроцентВыполнения, "ЧЦ=3; ЧРГ=' '; ЧН=") + "%";

	Возврат СтрокаПрогрессБара; 
	
КонецФункции

Функция АктуальныйВидЗаписи(Задача) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КласификацияЗаписейСрезПоследних.Задача КАК Задача,
		|	КласификацияЗаписейСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.КласификацияЗаписей.СрезПоследних(, Задача = &Задача) КАК КласификацияЗаписейСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий(); 
	
	Возврат Выборка.Значение;

КонецФункции // АктуальныйВидЗаписи()

Функция ПроверитьИОбновить_ВидЗаписи(Задача, ВидЗаписи) Экспорт

	ТекущийВидЗаписи = АктуальныйВидЗаписи(Задача);
	Если ТекущийВидЗаписи <> ВидЗаписи Тогда
		НовыеЗаписиВ_Регистры.ЗаписьВидаЗадачи_В_Регистр(Задача, ВидЗаписи, ПодготовкаДанных.ПолучитьТекущегоПользователя()); 	
	КонецЕсли;

КонецФункции // Проверить()

Функция СтрокаТаблицыЗначенийВСтруктуру(СтрокаТЗ) Экспорт 

	Структура = Новый Структура;
	Для Каждого Колонка Из СтрокаТЗ.Владелец().Колонки Цикл
		Структура.Вставить(Колонка.Имя, СтрокаТЗ[Колонка.Имя]);	
	КонецЦикла;

	Возврат Структура;
	
КонецФункции // СтрокаТаблицыЗначенийВСтруктуру()


Функция АктульноеЗначениеАтрибутаОборудования(Оборудование, Атрибут) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АтрибутыОборудованияСрезПоследних.Оборудование КАК Оборудование,
		|	АтрибутыОборудованияСрезПоследних.ХарактеристикаДанных КАК ХарактеристикаДанных,
		|	АтрибутыОборудованияСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.АтрибутыОборудования.СрезПоследних(, Оборудование = &Оборудование) КАК АтрибутыОборудованияСрезПоследних
		|ГДЕ
		|	АтрибутыОборудованияСрезПоследних.ХарактеристикаДанных = &ХарактеристикаДанных";
	
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	Запрос.УстановитьПараметр("ХарактеристикаДанных", Атрибут);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Значение;
	
КонецФункции // АктульноеЗначениеАтрибутаОборудования()



Процедура  ПроверитьИОбновить_АтрибутовОборудования(Оборудование, Атрибут, НовоеЗначение) Экспорт 
	
	АктульноеЗначение = АктульноеЗначениеАтрибутаОборудования(Оборудование, Атрибут);
	
	Если АктульноеЗначение = НовоеЗначение Тогда
		Возврат;	
	КонецЕсли;
	
	НовыеЗаписиВ_Регистры.ЗаписьАтрибутаОборудования_В_Регистр(Оборудование, Атрибут, 
															НовоеЗначение, ПодготовкаДанных.ПолучитьТекущегоПользователя());
															
КонецПроцедуры         
														
													