&НаСервере
Функция СтатусПроведения()

	Возврат Объект.Проведен;

КонецФункции // СтатусПроведения()

&НаКлиенте
Процедура РедактированиеФормы()
	
	Если СтатусПроведения() = Истина Тогда	
		Элементы.СтандартныеРеквезиты.Доступность = Ложь;
		Элементы.ДанныеПН.Доступность = Ложь;
		Элементы.ТЧ.Доступность = Ложь;
	Иначе	
		Элементы.СтандартныеРеквезиты.Доступность = Истина;
		Элементы.ДанныеПН.Доступность = Истина;
		Элементы.ТЧ.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры // РедактированиеФормы()


&НаСервере
Процедура ТЧПриИзмененииНаСервере()
	Товары = Объект.ТЧ;
	Объект.СуммаНакладной = 0;
	Для Каждого ТМЦ Из Товары Цикл
		ТМЦ.ЕдиницаИзмирения = ТМЦ.Номенклатура.ЕдиницаИзмирения;	
		Если ТМЦ.СтараяЦена = 0 Тогда
			ТМЦ.СтараяЦена = ПолучениеИнформации.ПолучитьЦену(ТМЦ.Номенклатура);
			ТМЦ.Остаток = ПолучениеИнформации.ПолучитьОстаток(ТМЦ.Номенклатура);
		КонецЕсли;
		Объект.СуммаНакладной = Объект.СуммаНакладной + ТМЦ.Сумма; 
	КонецЦикла;
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧПриИзменении(Элемент)
	ТЧПриИзмененииНаСервере();
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Склад = Константы.СкладПоУмолчанию.Получить();
	Объект.Контрагент = Константы.КонтрагентПоУмолчанию.Получить();

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии()
	РедактированиеФормы();
КонецПроцедуры

&НаСервере
Процедура ИзменениеСуммыНаСервере()
	Товары = Объект.ТЧ;
	Для Каждого ТМЦ Из Товары Цикл
		ТМЦ.Сумма = ТМЦ.Количество * ТМЦ.Цена;	
	КонецЦикла;
	Записать();

КонецПроцедуры

&НаКлиенте
Процедура ТЧКоличествоПриИзменении(Элемент)
	ИзменениеСуммыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТЧЦенаПриИзменении(Элемент)
	ИзменениеСуммыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТЧСуммаПриИзмененииНаСервере()
	Товары = Объект.ТЧ;
	Для Каждого ТМЦ Из Товары Цикл
		ТМЦ.Цена = ТМЦ.Сумма / ТМЦ.Количество;	
	КонецЦикла;
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ТЧСуммаПриИзменении(Элемент)
	ТЧСуммаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТЧШтрихКодПриИзмененииНаСервере()
	
	ТекСтрокаИд = Элементы.ТЧ.ТекущаяСтрока;
	
	ТекСтрокаТовары = Объект.ТЧ.НайтиПоИдентификатору(ТекСтрокаИд);
	НайденыйТовар = Справочники.Номенклатура.НайтиПоРеквизиту("ШтрихКод",ТекСтрокаТовары.ШтрихКод);
	ТекСтрокаТовары.Номенклатура = НайденыйТовар;

КонецПроцедуры

&НаКлиенте
Процедура ТЧШтрихКодПриИзменении(Элемент)
	ТЧШтрихКодПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция  ПроверкаЗаполненияПолей()
	Если Объект.Контрагент.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого ТМЦ Из Объект.ТЧ Цикл
		//Если ТМЦ.Количество = 0 Тогда
		//	Возврат Ложь;
		//ИначеЕсли ТМЦ.Цена = 0 Тогда
		//	Возврат Ложь;
		//ИначеЕсли ТМЦ.Сумма = 0 Тогда
		//	Возврат Ложь;
		//ИначеЕсли ТМЦ.ЦенаНаПродажу = 0 Тогда
		//	Возврат Ложь;	
		//КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ПроверкаЗаполненияПолей() = Ложь Тогда
		Сообщить("В документе присутствуют незаполненые поля!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	РедактированиеФормы();
КонецПроцедуры
