
&НаСервере
Процедура ПолучитьОтчетаНаСервере()
	ОбщаяКасса=0;
	СуммаДесертов=0;
	СуммаХлеба=0;
	СуммаДизеля=0;
	СуммаРасходов=0;
	СуммаПеребора=0;
	СуммаПроцентов=0;
	
	
	Заведние = Объект.Заведение;
	ДатаС=Объект.ДатаС;
	ДатаПо=Объект.ДатаПо;
	
	
	Отчет = Документы.ДневнойОтчет.Выбрать(ДатаС,ДатаПо);
	
	Пока Отчет.Следующий() Цикл
		ТекущийОтчет = Отчет.ПолучитьОбъект();
		Если ТекущийОтчет.Заведение = Объект.Заведение Тогда
			Для Каждого Выборка Из ТекущийОтчет.ОсновнаяИнформация Цикл 
				Если Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.ОбщаяКасса Тогда
					ОбщаяКасса=ОбщаяКасса+Выборка.Сумма;
					
				ИначеЕсли Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.Десерты Тогда
					СуммаДесертов=СуммаДесертов+Выборка.Сумма;	
				ИначеЕсли Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.Хлеб Тогда
					СуммаХлеба=СуммаХлеба+Выборка.Сумма;	
				ИначеЕсли Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.Дизель Тогда	
					СуммаДизеля=СуммаДизеля+Выборка.Сумма;	
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого Выборка Из ТекущийОтчет.Расходы Цикл
				СуммаРасходов=СуммаРасходов+Выборка.Сумма;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	

//	
//	Пока Выборка.Следующий() Цикл
//		СуммаРасходов=СуммаРасходов+Выборка.СуммаРасхода;	
//	КонецЦикла;
//	
//		
	СуммаПроцентов=(ОбщаяКасса-СуммаХлеба-СуммаДесертов)*0.2;
	СуммаПеребора=СуммаПроцентов-(СуммаРасходов+СуммаДизеля);
	Сообщить("Общая касса "+Строка(ОбщаяКасса)+", сумма хлеба "+Строка(СуммаХлеба)+", сумма десертов "+Строка(СуммаДесертов)
		+", сумма дизеля "+Строка(СуммаДизеля)+", сумма расходов "+Строка(СуммаРасходов)+", сумма процентов "+Строка(СуммаПроцентов)
		+", сумма перебора "+Строка(СуммаПеребора));

	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОтчета(Команда)
	ПолучитьОтчетаНаСервере();
КонецПроцедуры
