
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеПараметров = Параметры.ПараметрыОборудования;
	
	ОбновитьЗначениеПараметров(ЗначениеПараметров);
	
	Параметры.Свойство("Идентификатор", Идентификатор);
	Параметры.Свойство("ДрайверОборудования", ДрайверОборудования);
	
	ТребуетсяПереустановка = Идентификатор.ТребуетсяПереустановка;
	ПоставляетсяДистрибутивом = ДрайверОборудования.ПоставляетсяДистрибутивом;
	ВерсияДрайвераВМакете = ДрайверОборудования.ВерсияДрайвера;
	СчитывательМагнитныхКарт = ДрайверОборудования.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СчитывательМагнитныхКарт;
	
	Если СчитывательМагнитныхКарт Тогда
		
		ВремПараметрыДорожек = Неопределено;
		
		Если Не ЗначениеПараметров.Свойство("ПараметрыДорожек", ВремПараметрыДорожек) Тогда
			ВремПараметрыДорожек = Новый Массив();
			Для Индекс = 1 По 3 Цикл
				НоваяСтрока = Новый Структура();
				НоваяСтрока.Вставить("НомерДорожки", Индекс);
				НоваяСтрока.Вставить("Префикс", 0);
				НоваяСтрока.Вставить("Суффикс", ?(Индекс = 2, 13, 0));
				НоваяСтрока.Вставить("Использовать", ?(Индекс = 2, Истина, Ложь));
				ВремПараметрыДорожек.Добавить(НоваяСтрока);
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого СтрокаДорожки Из ВремПараметрыДорожек Цикл
			НоваяСтрока = ПараметрыДорожек.Добавить();
			НоваяСтрока.НомерДорожки = СтрокаДорожки.НомерДорожки;
			НоваяСтрока.Префикс = СтрокаДорожки.Префикс;
			НоваяСтрока.Суффикс = СтрокаДорожки.Суффикс;
			НоваяСтрока.Использовать = СтрокаДорожки.Использовать;
		КонецЦикла;
		
	КонецЕсли;
	
	Заголовок = "Устаткування:" + Символы.НПП + Строка(Идентификатор);
	
	ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	ЦветИнфо = ЦветаСтиля.ЦветФонаВыделенияПоля;
	ЦветОшибки = ЦветаСтиля.ЦветОтрицательногоЧисла;
	
	ТекущееРабочееМесто = (ПараметрыСеанса.РабочееМестоКлиента = Идентификатор.РабочееМесто);
	Элементы.ТестУстройства.Видимость = ТекущееРабочееМесто;
	Элементы.СтатусДрайвера.Видимость = ТекущееРабочееМесто;
	Элементы.ДополнительныеДействия.Видимость = ТекущееРабочееМесто;
	Элементы.ИнтеграционныйКомпонентУстановлен.ЦветТекста = ЦветИнфо;
		
	ОпределитьТипСтавкаНДС();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьИнформациюОДрайвере(Истина);
	
	ЗаполнитьСпискиВыбора(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ОчиститьСообщения();
	
	ВремНастройки = ПолучитьНастройки();
	
	Если СчитывательМагнитныхКарт Тогда
		
		НастроеноДорожек = 0;
		ДорожкаСПустымСуффиксом = Ложь;
		ВремПараметрыДорожек = Новый Массив();
		ПрефиксДрайвера = -1;
		СуффиксДрайвера = -1;
		
		Для Индекс = 1 По 3 Цикл
			Если ПараметрыДорожек[3 - Индекс].Использовать Тогда
				ДорожкаСПустымСуффиксом = ДорожкаСПустымСуффиксом Или (ПараметрыДорожек[3 - Индекс].Суффикс = 0);
				НастроеноДорожек = НастроеноДорожек + 1;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ДорожкаСПустымСуффиксом Тогда
			
			Для Индекс = 1 По 3 Цикл
				НоваяСтрока = Новый Структура();
				НоваяСтрока.Вставить("НомерДорожки", ПараметрыДорожек[Индекс - 1].НомерДорожки);
				НоваяСтрока.Вставить("Использовать", ПараметрыДорожек[Индекс - 1].Использовать);
				НоваяСтрока.Вставить("Префикс", ПараметрыДорожек[Индекс - 1].Префикс);
				НоваяСтрока.Вставить("Суффикс", ПараметрыДорожек[Индекс - 1].Суффикс);
				ВремПараметрыДорожек.Добавить(НоваяСтрока);
			КонецЦикла;
			
			Для Индекс = 1 По 3 Цикл
				Если ВремПараметрыДорожек[Индекс - 1].Использовать Тогда
					ПрефиксДрайвера = ВремПараметрыДорожек[Индекс - 1].Префикс;
					ПрефиксДрайвера = ?(ПрефиксДрайвера = 0, -1, ПрефиксДрайвера);
					ВремНастройки.ПараметрыОборудования.Вставить("P_Prefix", ПрефиксДрайвера);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Для Индекс = 1 По 3 Цикл
				Если ВремПараметрыДорожек[3 - Индекс].Использовать Тогда
					СуффиксДрайвера = ВремПараметрыДорожек[3 - Индекс].Суффикс;
					СуффиксДрайвера = ?(СуффиксДрайвера = 0, -1, СуффиксДрайвера);
					ВремНастройки.ПараметрыОборудования.Вставить("P_Suffix", СуффиксДрайвера);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ВремНастройки.ПараметрыОборудования.Вставить("ПараметрыДорожек", ВремПараметрыДорожек);
			
		КонецЕсли;
		
		Если ПрефиксДрайвера > 0 И СуффиксДрайвера > 0 И ПрефиксДрайвера = СуффиксДрайвера Тогда
			ТекстСообщения = "Префікс першої доріжки, що використовується, збігається з суфікс останньої доріжки, що використовується";
			Сообщить(ТекстСообщения);
		ИначеЕсли НастроеноДорожек > 0 И Не ДорожкаСПустымСуффиксом Тогда
			Закрыть(ВремНастройки);
		ИначеЕсли НастроеноДорожек = 0 Тогда
			ТекстСообщения = "Необхідно вказати використання хоча б однієї доріжки для зчитувача";
			Сообщить(ТекстСообщения);
		ИначеЕсли ДорожкаСПустымСуффиксом Тогда
			ТекстСообщения = "Для кожної доріжки, що використовується, повинен бути вказаний суфікс";
			Сообщить(ТекстСообщения);
		КонецЕсли;
		
	Иначе
		Закрыть(ВремНастройки);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаДрайвераЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДрайвер(Команда)
	
	Если ИнтеграционныйКомпонент Тогда
		Текст = "Для переходу на сайт виробника необхідно підключення до Інтернету.
		|Продовжити виконання операції?";
		Оповещение = Новый ОписаниеОповещения("УстановкаДрайвераЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет);
	Иначе
		ОчиститьСообщения();
		ОповещенияДрайверИзДистрибутиваПриЗавершении = Новый ОписаниеОповещения("УстановитьДрайверИзДистрибутиваПриЗавершении", ЭтотОбъект);
		ОповещенияДрайверИзАрхиваПриЗавершении = Новый ОписаниеОповещения("УстановитьДрайверИзАрхиваПриЗавершении", ЭтотОбъект);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереустановитьДрайвер(Команда)
	
	ТребуетсяПереустановка = Истина;
	ОбновитьСтатусПереустановкиДрайвера();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезапуститьПрограмму(Команда)
	
	ЗавершитьРаботуСистемы(Истина, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДрайверИзАрхиваПриЗавершении(Результат) Экспорт 
	
	Сообщить("Встановлення драйвера завершена."); 
	ОбновитьИнформациюОДрайвере(Истина);
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьДрайверИзДистрибутиваПриЗавершении(Результат, Параметры) Экспорт 
	
	Если Результат Тогда
		Сообщить("Встановлення драйвера завершена."); 
		ОбновитьИнформациюОДрайвере(Истина);
	Иначе
		Сообщить("При встановленні драйвера з дистрибутива сталася помилка."); 
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ТестУстройстваЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ТолькоПросмотр = Ложь;
	Элементы.КоманднаяПанельЛево.Доступность = Истина;
	
	ДополнительноеОписание = "";
	ВыходныеПараметры = РезультатВыполнения.ВыходныеПараметры;
	
	Если ТипЗнч(ВыходныеПараметры) = Тип("Массив") Тогда
		
		Если ВыходныеПараметры.Количество() >= 2 Тогда
			ДополнительноеОписание = ВыходныеПараметры[1];
		КонецЕсли;
		
		Если ВыходныеПараметры.Количество() >= 3 И Не ПустаяСтрока(ВыходныеПараметры[2]) Тогда
			ДемонстрационныйРежим = ВыходныеПараметры[2];
			Элементы.ГруппаДемонстрационныйРежим.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстСообщения = ?(РезультатВыполнения.Результат, "Тест успішно виконаний. %ДополнительноеОписание%", "Тест не пройдено. %ДополнительноеОписание%");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ?(ПустаяСтрока(ДополнительноеОписание), "", ДополнительноеОписание));
	Сообщить(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестУстройства(Команда)
	
	ОчиститьСообщения();
	
	РезультатТеста = Неопределено;
	ДемонстрационныйРежим = "";
	
	ТолькоПросмотр = Истина;
	Элементы.КоманднаяПанельЛево.Доступность = Ложь;
	
	ВходныеПараметры = Неопределено;
	ВыходныеПараметры = Неопределено;
	ПараметрыУстройства = ПолучитьНастройки().ПараметрыОборудования;
	
	Оповещение = Новый ОписаниеОповещения("ТестУстройстваЗавершение", ЭтотОбъект);
	НачатьВыполнениеДополнительнойКоманды(Оповещение, "CheckHealth", ВходныеПараметры, Идентификатор, ПараметрыУстройства);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительноеДействиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ТекстСообщения = ?(РезультатВыполнения.Результат, "Операція виконана успішно.",	"Помилка виконання операції." + Символы.НПП + РезультатВыполнения.ВыходныеПараметры[1]);
	Сообщить(ТекстСообщения);
	
	ОчиститьНастраиваемыйИнтерфейс();
	
	ОбновитьИнформациюОДрайвере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительноеДействие(Команда)
	
	ОчиститьСообщения();
	
	ВыходныеПараметры = Неопределено;
	ВходныеПараметры = Новый Массив();
	ВходныеПараметры.Добавить(Сред(Команда.Имя, 3)); 
	Оповещение = Новый ОписаниеОповещения("ДополнительноеДействиеЗавершение", ЭтотОбъект);
	
	НачатьВыполнениеДополнительнойКоманды(Оповещение, "DoAdditionalAction", ВходныеПараметры, Идентификатор, ПолучитьНастройки());
	
КонецПроцедуры

&НаСервере
Функция ОчиститьНастраиваемыйИнтерфейс()
	
	Пока Элементы.Страницы.ПодчиненныеЭлементы.Количество() > 0 Цикл
		Элементы.Удалить(Элементы.Страницы.ПодчиненныеЭлементы.Получить(0));
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ПолучитьНастройки()
	
	ПараметрыДрайвера = ПолучитьРеквизиты();
	
	НовыеЗначениеПараметров = Новый Структура;
	Для Каждого Параметр Из ПараметрыДрайвера Цикл
		Если Лев(Параметр.Имя, 2) = "P_" Тогда
			Если Параметр.Имя = "P_CorrespondenceTable" Тогда
				Результат = Новый Массив;
				Для Каждого Строка Из ЭтотОбъект[Параметр.Имя] Цикл
					Элемент = Новый Массив(3);
					Элемент[0] = Строка.НалоговаяГруппаРРО;
					Элемент[1] = ПодключаемоеОборудованиеВчасноКасаВызовСервера.ПолучитьСтавкуНДССтрокой(Элементы.P_CorrespondenceTableСтавкаНДС.ОграничениеТипа.ПривестиЗначение(Строка.СтавкаНДС));
					Элемент[2] = Строка.ПодакцизныйТовар;
					Результат.Добавить(Элемент);
				КонецЦикла;
				НовыеЗначениеПараметров.Вставить(Параметр.Имя, ?(Результат.Количество(), Результат, Неопределено));
			ИначеЕсли Параметр.Имя = "P_AdvancedOutput" Тогда
				Результат = Новый Массив;
				Для Каждого Строка Из ЭтотОбъект[Параметр.Имя] Цикл
					Элемент = Новый Массив(5);
					Элемент[0] = Строка.ФискальноеЗадание;
					Элемент[1] = Строка.ВыводЧека;
					Элемент[2] = Строка.Принтер;
					Элемент[3] = Строка.Принтер1;
					Элемент[4] = Строка.Принтер2;
					Результат.Добавить(Элемент);
				КонецЦикла;
				НовыеЗначениеПараметров.Вставить(Параметр.Имя, ?(Результат.Количество(), Результат, Неопределено));
			Иначе
				НовыеЗначениеПараметров.Вставить(Параметр.Имя, ЭтотОбъект[Параметр.Имя]);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", Идентификатор);
	Результат.Вставить("ПараметрыОборудования", НовыеЗначениеПараметров);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьНастраиваемыйИнтерфейс(ОписаниеИнтерфейса, ДополнительныеДействия, ПервыйЗапуск)
	
	Суффикс = Ложь;
	Префикс = Ложь;
	БазоваяГруппа = Неопределено;
	Элемент = Неопределено;
	ИндексГруппы = 0;
	КоличествоСтраниц = 0;
	ТекущаяСтраница = Элементы.ОсновнаяСтраница;
	
	ЧтениеXML = Новый ЧтениеXML; 
	ЧтениеXML.УстановитьСтроку(ОписаниеИнтерфейса);
	ЧтениеXML.ПерейтиКСодержимому();
	
	Если ЧтениеXML.Имя = "Settings" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
		Пока ЧтениеXML.Прочитать() Цикл
			
			Если ЧтениеXML.Имя = "Parameter" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				
				ТолькоЧтение = ?(ВРег(ЧтениеXML.ЗначениеАтрибута("ReadOnly")) = "TRUE", Истина, Ложь) Или ?(ВРег(ЧтениеXML.ЗначениеАтрибута("ReadOnly")) = "ИСТИНА", Истина, Ложь);
				ОригинальноеИмя = ЧтениеXML.ЗначениеАтрибута("Name");
				ПараметрИмя = ?(ТолькоЧтение, "R_", "P_") + ОригинальноеИмя;
				ПараметрЗаголовок = ЧтениеXML.ЗначениеАтрибута("Caption");
				ПараметрТип = ВРег(ЧтениеXML.ЗначениеАтрибута("TypeValue"));
				ПараметрТип = ?(Не ПустаяСтрока(ПараметрТип), ПараметрТип, "STRING");
				ПараметрЗначение = ЧтениеXML.ЗначениеАтрибута("DefaultValue");
				ПараметрОписание = ЧтениеXML.ЗначениеАтрибута("Description");
				
				Если СчитывательМагнитныхКарт Тогда
					Суффикс = ВРег(ОригинальноеИмя) = "SUFFIX" Или ?(ВРег(ЧтениеXML.ЗначениеАтрибута("Suffix")) = "TRUE", Истина, Ложь);
					Префикс = ВРег(ОригинальноеИмя) = "PREFIX" Или ?(ВРег(ЧтениеXML.ЗначениеАтрибута("Prefix")) = "TRUE", Истина, Ложь);
				КонецЕсли;
				
				ПараметрСуществует = Ложь;
				ПараметрыДрайвера = ПолучитьРеквизиты();
				Для Каждого ПараметрДрайвера Из ПараметрыДрайвера Цикл
					Если ПараметрДрайвера.Имя = ПараметрИмя Тогда
						ПараметрСуществует = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Не ПараметрСуществует Тогда
					
					Если ПараметрТип = "NUMBER" Тогда 
						Реквизит = Новый РеквизитФормы(ПараметрИмя, Новый ОписаниеТипов("Число"), , ПараметрЗаголовок, Истина);
					ИначеЕсли ПараметрТип = "BOOLEAN" Тогда 
						Реквизит = Новый РеквизитФормы(ПараметрИмя, Новый ОписаниеТипов("Булево"), , ПараметрЗаголовок, Истина);
					Иначе
						Реквизит = Новый РеквизитФормы(ПараметрИмя, Новый ОписаниеТипов("Строка"), , ПараметрЗаголовок, Истина);
					КонецЕсли;
					
					ДобавляемыеРеквизиты = Новый Массив;
					ДобавляемыеРеквизиты.Добавить(Реквизит);
					ИзменитьРеквизиты(ДобавляемыеРеквизиты);
					
				КонецЕсли;
				
				Если Суффикс Тогда 
					Элемент = Элементы.ПараметрыДорожекСуффикс;
				ИначеЕсли Префикс Тогда
					Элемент = Элементы.ПараметрыДорожекПрефикс;
				ИначеЕсли Элементы.Найти(ПараметрИмя) = Неопределено Тогда
					Если БазоваяГруппа = Неопределено Тогда
						БазоваяГруппа = Элементы.Добавить("БазоваяГруппа" + КоличествоСтраниц, Тип("ГруппаФормы"), ТекущаяСтраница);
						БазоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
						БазоваяГруппа.Отображение = Элементы.ДрайверИВерсия.Отображение;
						БазоваяГруппа.РастягиватьПоГоризонтали = Истина;
						БазоваяГруппа.Заголовок = "Параметри";
						БазоваяГруппа.Группировка = Элементы.ДрайверИВерсия.Группировка;
					КонецЕсли;
					Элемент = Элементы.Добавить(ПараметрИмя, Тип("ПолеФормы"), БазоваяГруппа);
					Если ПараметрТип = "BOOLEAN" Тогда 
						Элемент.Вид = ВидПоляФормы.ПолеФлажка;
					Иначе
						Элемент.Вид = ВидПоляФормы.ПолеВвода;
						Элемент.АвтоМаксимальнаяШирина = Ложь;
					КонецЕсли;
					Элемент.ПутьКДанным = ПараметрИмя;
					Элемент.Подсказка = ПараметрОписание;
					Элемент.ТолькоПросмотр = ТолькоЧтение;					
				КонецЕсли;
				
				ХранимоеЗначение = Неопределено;
				Если ЗначениеПараметров.Свойство(ПараметрИмя, ХранимоеЗначение) Тогда
					ПараметрЗначение = ХранимоеЗначение;
				Иначе
					Если Не ПустаяСтрока(ПараметрЗначение) Тогда
						Если ПараметрТип = "BOOLEAN" Тогда
							ПараметрЗначение = ?(ВРег(ПараметрЗначение) = "TRUE", Истина, Ложь) Или ?(ВРег(ПараметрЗначение) = "ИСТИНА", Истина, Ложь);
						ИначеЕсли ПараметрТип = "STRING" Тогда
							ПараметрЗначение = Строка(ПараметрЗначение);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Если ПараметрИмя = "P_CorrespondenceTable" Тогда
					ЭтотОбъект[ПараметрИмя].Очистить();
					Если ПараметрЗначение = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					Для Каждого Элемент Из ПараметрЗначение Цикл
						Строка = ЭтотОбъект[ПараметрИмя].Добавить();
						Строка.НалоговаяГруппаРРО = Элемент[0];
						Строка.СтавкаНДС = ПодключаемоеОборудованиеВчасноКасаВызовСервера.ПолучитьПоСтрокеСтавкуНДС(Элемент[1]);
						Строка.ПодакцизныйТовар = Элемент[2];
					КонецЦикла;
				ИначеЕсли ПараметрИмя = "P_AdvancedOutput" Тогда
					ЭтотОбъект[ПараметрИмя].Очистить();
					Если ПараметрЗначение = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					Для Каждого Элемент Из ПараметрЗначение Цикл
						Строка = ЭтотОбъект[ПараметрИмя].Добавить();
						Строка.ФискальноеЗадание = Элемент[0];
						Строка.ВыводЧека = Элемент[1];
						Строка.Принтер = Элемент[2];
						Строка.Принтер1 = Элемент[3];
						Строка.Принтер2 = Элемент[4];
					КонецЦикла;
				Иначе
					ЭтотОбъект[ПараметрИмя] = ПараметрЗначение;     
				КонецЕсли;				
				МастерПараметр = ЧтениеXML.ЗначениеАтрибута("MasterParameterName");
				МастерПараметрЗначение = ЧтениеXML.ЗначениеАтрибута("MasterParameterValue");
				МастерПараметрОперация = ЧтениеXML.ЗначениеАтрибута("MasterParameterOperation");
				
			КонецЕсли;
			
			Если ЧтениеXML.Имя = "ChoiceList" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
				
				Если Не (Элемент = Неопределено) И Не (Элемент.Вид = ВидПоляФормы.ПолеФлажка) Тогда 
					Элемент.РежимВыбораИзСписка = Истина; 
					Элемент.ВысотаСпискаВыбора = 10;
					Элемент.РедактированиеТекста = Ложь; 
					Если Суффикс Или Префикс Тогда
						Элемент.СписокВыбора.Добавить(0, "<NONE>");
					КонецЕсли;
				КонецЕсли;
				
				Пока ЧтениеXML.Прочитать() И Не (ЧтениеXML.Имя = "ChoiceList") Цикл 
					
					Если ЧтениеXML.Имя = "Item" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
						ЗначениеАтрибута = ЧтениеXML.ЗначениеАтрибута("Value"); 
						Если ЧтениеXML.Прочитать() Тогда
							ПредставлениеАтрибута = ЧтениеXML.Значение;
						КонецЕсли;
						Если ПустаяСтрока(ЗначениеАтрибута) Тогда
							ЗначениеАтрибута = ПредставлениеАтрибута;
						КонецЕсли;
						
						Если Суффикс Или Префикс Тогда
							Если Число(ЗначениеАтрибута) > 0 Тогда
								Элемент.СписокВыбора.Добавить(Число(ЗначениеАтрибута), ПредставлениеАтрибута);
							КонецЕсли;
						ИначеЕсли ПараметрТип = "NUMBER" Тогда 
							Элемент.СписокВыбора.Добавить(Число(ЗначениеАтрибута), ПредставлениеАтрибута);
						Иначе
							Элемент.СписокВыбора.Добавить(ЗначениеАтрибута, ПредставлениеАтрибута)
						КонецЕсли;
					КонецЕсли;
				КонецЦикла; 
				
			КонецЕсли;
			
			Если ЧтениеXML.Имя = "Page" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				
				ЗаголовокСтраницы = ЧтениеXML.ЗначениеАтрибута("Caption");
				ЗаголовокСтраницы = ?(ПустаяСтрока(ЗаголовокСтраницы), "Параметри", ЗаголовокСтраницы);
				
				КоличествоСтраниц = КоличествоСтраниц + 1;
				Если КоличествоСтраниц > 1 Тогда
					Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
					ТекущаяСтраница = Элементы.Добавить("Страница" + КоличествоСтраниц, Тип("ГруппаФормы"), Элементы.Страницы);
					БазоваяГруппа = Неопределено;
				КонецЕсли;
				ТекущаяСтраница.Заголовок = ЗаголовокСтраницы;
				
			КонецЕсли;
			
			Если ЧтениеXML.Имя = "Group" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				
				ЗаголовокГруппы = ЧтениеXML.ЗначениеАтрибута("Caption");
				ЗаголовокГруппы = ?(ПустаяСтрока(ЗаголовокГруппы), "Параметри", ЗаголовокГруппы);
				
				БазоваяГруппа = Элементы.Добавить("Группа" + ИндексГруппы, Тип("ГруппаФормы"), ТекущаяСтраница);
				БазоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				БазоваяГруппа.Отображение = Элементы.ДрайверИВерсия.Отображение;
				БазоваяГруппа.РастягиватьПоГоризонтали = Истина;
				БазоваяГруппа.Группировка = Элементы.ДрайверИВерсия.Группировка;
				БазоваяГруппа.Заголовок = ЗаголовокГруппы;
				ИндексГруппы = ИндексГруппы + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЧтениеXML.Закрыть(); 
	
	Если ПервыйЗапуск И Не ПустаяСтрока(ДополнительныеДействия) Тогда
		
		ЧтениеXML = Новый ЧтениеXML; 
		ЧтениеXML.УстановитьСтроку(ДополнительныеДействия);
		ЧтениеXML.ПерейтиКСодержимому();
		
		Если ЧтениеXML.Имя = "Actions" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Пока ЧтениеXML.Прочитать() Цикл
				Если ЧтениеXML.Имя = "Action" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
					
					ДействиеИмя = "M_" + ЧтениеXML.ЗначениеАтрибута("Name");
					ДействиеЗаголовок = ЧтениеXML.ЗначениеАтрибута("Caption");
					
					Команда = Команды.Добавить("A_" + ЧтениеXML.ЗначениеАтрибута("Name"));
					Команда.Заголовок = ДействиеЗаголовок;
					Команда.Действие = "ДополнительноеДействие";
					
					ПунктМеню = Элементы.Добавить(ДействиеИмя, Тип("КнопкаФормы"), Элементы.ДополнительныеДействия);
					ПунктМеню.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
					ПунктМеню.Заголовок = ДействиеЗаголовок;
					ПунктМеню.ИмяКоманды = "A_" + ЧтениеXML.ЗначениеАтрибута("Name");
					
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		ЧтениеXML.Закрыть(); 
		
	КонецЕсли;
	
	Элементы.ПрефиксыИСуффиксыДорожек.Видимость = СчитывательМагнитныхКарт;
	
	Если Не P_AdvancedOutput.Количество() Тогда
		P_AdvancedOutput.Добавить().ФискальноеЗадание = 1;
		P_AdvancedOutput.Добавить().ФискальноеЗадание = 2;
		P_AdvancedOutput.Добавить().ФискальноеЗадание = 3;
		P_AdvancedOutput.Добавить().ФискальноеЗадание = 4;
		P_AdvancedOutput.Добавить().ФискальноеЗадание = 10;
		P_AdvancedOutput.Добавить().ФискальноеЗадание = 11;
		P_AdvancedOutput.Добавить().ФискальноеЗадание = 12;
		P_AdvancedOutput.Добавить().ФискальноеЗадание = 13;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыполнениеДополнительнойКомандыЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если Не ТипЗнч(РезультатВыполнения) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ПервыйЗапуск = ?(Параметры.Свойство("ПервыйЗапуск"), Параметры.ПервыйЗапуск, Истина);
	ВыходныеПараметры = РезультатВыполнения.ВыходныеПараметры;
	Элементы.СтатусДрайвера.Видимость = Истина;
	
	Если РезультатВыполнения.Результат Тогда
		ДрайверУстановлен = ВыходныеПараметры[0];
		ВерсияДрайвера = ВыходныеПараметры[1];
		НаименованиеДрайвера = ВыходныеПараметры[2];
		ОписаниеДрайвера = ВыходныеПараметры[3];
		ТипОборудования = ВыходныеПараметры[4];
		РевизияИнтерфейса = ВыходныеПараметры[5];
		ИнтеграционныйКомпонент = ВыходныеПараметры[6];
		ОсновнойДрайверУстановлен = ВыходныеПараметры[7];
		АдресЗагрузкиДрайвера = ВыходныеПараметры[8];
		ПараметрыДрайвера = ВыходныеПараметры[9];
		ДополнительныеДействия = ВыходныеПараметры[10];
		
		Если (ИнтеграционныйКомпонент И ОсновнойДрайверУстановлен) Или (Не ИнтеграционныйКомпонент) Тогда
			Если Не ПустаяСтрока(ПараметрыДрайвера) Тогда
				ОбновитьНастраиваемыйИнтерфейс(ПараметрыДрайвера, ДополнительныеДействия, ПервыйЗапуск);
			КонецЕсли;
		КонецЕсли;
		
		Если ИнтеграционныйКомпонент И Не ОсновнойДрайверУстановлен Тогда
			ДрайверУстановлен = "Встановлено інтеграційний компонент";
			ВерсияДрайвера = "Не визначена";
			Элементы.ДрайверНаименования.Видимость = Не ПустаяСтрока(НаименованиеДрайвера); 
			Элементы.ДрайверНаименования.Заголовок = СтрЗаменить(Элементы.ДрайверНаименования.Заголовок, "%Наименование%", НаименованиеДрайвера);
			Элементы.СтатусДрайвера.ТекущаяСтраница = Элементы.ДрайверИнтеграционныйКомпонент;
			Элементы.ПерейтиНаСайтПроизводителя.Видимость = Не ПустаяСтрока(АдресЗагрузкиДрайвера);
		Иначе
			Элементы.СтатусДрайвера.ТекущаяСтраница = Элементы.ДрайверУстановлен;
			Элементы.ДрайверИВерсия.Доступность = Истина;
		КонецЕсли;
		
		Элементы.Драйвер.ЦветТекста = ?(ВерсияДрайвера = "Не визначена", ЦветОшибки, ЦветТекста);
		Элементы.Версия.ЦветТекста = Элементы.Драйвер.ЦветТекста;
		Элементы.НаименованиеДрайвера.ЦветТекста = ?(НаименованиеДрайвера = "Не визначено", ЦветОшибки, ЦветТекста);
		Элементы.ОписаниеДрайвера.ЦветТекста = ?(ОписаниеДрайвера = "Не визначено", ЦветОшибки, ЦветТекста);
		Элементы.ОписаниеДрайвера.Видимость = Не ПустаяСтрока(ОписаниеДрайвера);
		
		ОбновитьСтатусПереустановкиДрайвера();
	Иначе
		ДрайверСообщение = РезультатВыполнения.ОписаниеОшибки;
		ДрайверУстановлен = ВыходныеПараметры[2];
		ВерсияДрайвера = "Не визначена";
		Если Не ПустаяСтрока(ДрайверСообщение) И ДрайверУстановлен = "Встановлений" Тогда
			Элементы.УстройствоПодключено.Видимость = Истина;
			Элементы.УстройствоПодключено.Заголовок = ДрайверСообщение;
			Элементы.ТестУстройства.Видимость = Ложь;
			Элементы.ЗаписатьИЗакрыть.Видимость = Ложь;
			Элементы.ДрайверИВерсия.Видимость = Ложь;
			Элементы.ПрефиксыИСуффиксыДорожек.Видимость = Ложь;
			Элементы.Функции.Видимость = Ложь;
			Элементы.Закрыть.Видимость = Истина;
			Элементы.СтатусДрайвера.Видимость = Ложь;
			
			Элементы.Страницы.Видимость = Ложь;	
		Иначе
			Элементы.СтатусДрайвера.ТекущаяСтраница = Элементы.ДрайверНеУстановлен;
		КонецЕсли;
	КонецЕсли;
	
	Если Не Элементы.УстройствоПодключено.Видимость Тогда
		Элементы.УстановитьДрайвер.Видимость = Не (ДрайверУстановлен = "Встановлений");
		Элементы.ТестУстройства.Видимость = (Не ДрайверУстановлен = "Не встановлений") И (Не ИнтеграционныйКомпонент Или (ИнтеграционныйКомпонент И ОсновнойДрайверУстановлен));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюОДрайвере(ПервыйЗапуск)
	
	ВходныеПараметры = Неопределено;
	ПараметрыУстройства = Неопределено;
	ПараметрыКоманды = Новый Структура("ПервыйЗапуск", ПервыйЗапуск);
	Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеДополнительнойКомандыЗавершение", ЭтотОбъект, ПараметрыКоманды);
	НачатьВыполнениеДополнительнойКоманды(Оповещение, "ПолучитьОписаниеДрайвера", ВходныеПараметры, Идентификатор, ПараметрыУстройства);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусПереустановкиДрайвера()
	
	Если Не ТекущееРабочееМесто Тогда
		Возврат;
	КонецЕсли;
	
	#Если Не ВебКлиент Тогда
		Если ТребуетсяПереустановка Тогда
			Элементы.Переустановка.Видимость = Истина;
			Элементы.ДекорацияПереустановитьДрайвер.Заголовок = "Драйвер буде переустановлений після перезавантаження платформи.";
			Элементы.ПереустановитьДрайверКнопка.Видимость = Ложь;
			Элементы.ПерезапуститьПрограмму.Видимость = Истина;
		ИначеЕсли Не ПустаяСтрока(ВерсияДрайвераВМакете) И Не ПустаяСтрока(ВерсияДрайвера) И Не ВерсияДрайвераВМакете = ВерсияДрайвера И ДрайверУстановлен = "Встановлений" И Не Элементы.УстройствоПодключено.Видимость Тогда
			Элементы.Переустановка.Видимость = Истина;
			ТекстСообщения = "Версія драйвера в конфігурації (%ВКонфигурации%) відрізняється від встановленого.";
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВКонфигурации%", ВерсияДрайвераВМакете);
			Элементы.ДекорацияПереустановитьДрайвер.Заголовок = ТекстСообщения;
			Элементы.ПерезапуститьПрограмму.Видимость = Ложь;
		Иначе
			Элементы.Переустановка.Видимость = Ложь;
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыполнениеДополнительнойКоманды(ОповещениеПриЗавершении, Команда, ВходныеПараметры, Идентификатор, Параметры)
	
	ПодключенноеУстройство = ПолучитьПодключенноеУстройство(глПодключаемоеОборудование.ПараметрыПодключенияПО, Идентификатор);
	
	Если ПодключенноеУстройство = Неопределено Тогда
		ДанныеОборудования = ПолучитьДанныеУстройства(Идентификатор);
		ПараметрыКоманды = Новый Структура();
		ПараметрыКоманды.Вставить("Команда", Команда);
		ПараметрыКоманды.Вставить("ВходныеПараметры", ВходныеПараметры);
		ПараметрыКоманды.Вставить("Параметры", Параметры);
		ПараметрыКоманды.Вставить("ДанныеОборудования", ДанныеОборудования);
		ПараметрыКоманды.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
		Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеДополнительнойКоманды_Завершение", ЭтотОбъект, ПараметрыКоманды);
		НачатьПолучениеОбъектаДрайвера(Оповещение, ДанныеОборудования);
	Иначе
		ТекстОшибки = "Пристрій підключено. Перед виконанням операції пристрій повинно бути вимкнено.";
		ВыходныеПараметры = Новый Массив();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(ТекстОшибки);
		ВыходныеПараметры.Добавить("Встановлений");
		РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстОшибки, Идентификатор); 
		РезультатВыполнения.ВыходныеПараметры = ВыходныеПараметры;
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыполнениеДополнительнойКоманды_Завершение(ОбъектДрайвера, ПараметрыКоманды) Экспорт
	
	Если ОбъектДрайвера = Неопределено Тогда
		ТекстОшибки = "Не вдалося завантажити драйвер пристрою.
		|Перевірте, що драйвер коректно встановлений і зареєстрований в системі.";
		ВыходныеПараметры = Новый Массив();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(ТекстОшибки);
		ВыходныеПараметры.Добавить("Не встановлений");
		РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстОшибки); 
		РезультатВыполнения.ВыходныеПараметры = ВыходныеПараметры;
		ВыполнитьОбработкуОповещения(ПараметрыКоманды.ОповещениеПриЗавершении, РезультатВыполнения);
	Иначе
		
		ДанныеОборудования = ПараметрыКоманды.ДанныеОборудования; 
		ОбработчикДрайвераМодуль = ПодключаемоеОборудованиеВчасноКаса;
		
		Если ОбработчикДрайвераМодуль = Неопределено Тогда
			ТекстОшибки = "Не вдалося підключити обробник драйвера.";
			ВыходныеПараметры = Новый Массив();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(ТекстОшибки);
			ВыходныеПараметры.Добавить("Не встановлений");
			РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстОшибки); 
			РезультатВыполнения.ВыходныеПараметры = ВыходныеПараметры;
			ВыполнитьОбработкуОповещения(ПараметрыКоманды.ОповещениеПриЗавершении, РезультатВыполнения);
		Иначе
			ВремПараметрыПодключения = Новый Структура();
			ВремПараметрыПодключения.Вставить("ТипОборудования", ПараметрыКоманды.ДанныеОборудования.ТипОборудованияИмя);
			
			Если ОбработчикДрайвераМодуль.ПоддержкаАсинхронногоРежима() Тогда
				ОбработчикДрайвераМодуль.НачатьВыполнениеКоманды(ПараметрыКоманды.ОповещениеПриЗавершении, ПараметрыКоманды.Команда, ПараметрыКоманды.ВходныеПараметры, ОбъектДрайвера, ПараметрыКоманды.Параметры, ВремПараметрыПодключения);
			Иначе
				ТекстОшибки = "";
				ВыходныеПараметры = Неопределено;
				Результат = ОбработчикДрайвераМодуль.ВыполнитьКоманду(ПараметрыКоманды.Команда, ПараметрыКоманды.ВходныеПараметры, ВыходныеПараметры, ОбъектДрайвера, ПараметрыКоманды.Параметры, ВремПараметрыПодключения);
				Если Не Результат Тогда
					Если ВыходныеПараметры.Количество() >= 2 Тогда
						ТекстОшибки = ВыходныеПараметры[1];
					КонецЕсли;
					ВыходныеПараметры.Добавить("Встановлений");
				КонецЕсли;
				РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Результат); 
				РезультатВыполнения.ВыходныеПараметры = ВыходныеПараметры;
				ВыполнитьОбработкуОповещения(ПараметрыКоманды.ОповещениеПриЗавершении, РезультатВыполнения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПодключенноеУстройство(СписокПодключений, Идентификатор)
	
	ПодключенноеУстройство = Неопределено;
	
	Для Каждого Подключение Из СписокПодключений Цикл
		Если Подключение.Ссылка = Идентификатор Тогда
			ПодключенноеУстройство = Подключение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПодключенноеУстройство;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеУстройства(Идентификатор)
	
	Возврат Справочники.ПодключаемоеОборудование.ПолучитьДанныеУстройства(Идентификатор);
	
КонецФункции

&НаКлиенте
Процедура НачатьПолучениеОбъектаДрайвера(ОповещениеПриЗавершении, ДанныеДрайвера)
	
	ОбъектДрайвера = Неопределено;
	
	Для Каждого ДрайверПО Из глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования Цикл
		Если ДрайверПО.Ключ = ДанныеДрайвера.ДрайверОборудования Тогда
			ОбъектДрайвера = ДрайверПО.Значение;
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, ОбъектДрайвера);
			Возврат;
		КонецЕсли;
	КонецЦикла; 
	
	Если ОбъектДрайвера = Неопределено Тогда
		ОбъектДрайвера = ПолучитьФорму("ОбщаяФорма.ДрайверВчасноКасаФискальныйРегистратор");
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, ОбъектДрайвера);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыВыполненияОперацииНаОборудовании(Результат = Ложь, ОписаниеОшибки = Неопределено, ИдентификаторУстройства = Неопределено) 
	
	РезультатВыполнения = Новый Структура();
	РезультатВыполнения.Вставить("Результат", Результат);
	РезультатВыполнения.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	РезультатВыполнения.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	РезультатВыполнения.Вставить("ВыходныеПараметры", Неопределено);
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ЛогоНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке("https://kasa.vchasno.ua");
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПриИзменении(Элемент)
	
	ЗаполнитьСпискиВыбора(Элемент.Родитель.Имя = "Группа0" Или Элемент.Родитель.Имя = "ГруппаUseAuthentication");		
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСпискиВыбора(ПараметрыПодключения)
	
	Элементы.P_XApiKey.Видимость = P_UseAuthentication;
	Элементы.P_Printer1.Видимость = P_Output = 1;
	Элементы.P_Printer2.Видимость = P_Output = 2 И Не P_BatchMode;
	Элементы.P_AdvancedOutput.Видимость = P_Output = 4;
	
	Элементы.P_SecureConnection.СписокВыбора.Очистить();
	Элементы.P_SecureConnection.СписокВыбора.Добавить(0, "HTTP");
	Элементы.P_SecureConnection.СписокВыбора.Добавить(1, "HTTPS");
	
	Элементы.P_RoundingAccuracy.СписокВыбора.Очистить();
	Элементы.P_RoundingAccuracy.СписокВыбора.Добавить(0, "Вибирати під час розрахунку");
	Элементы.P_RoundingAccuracy.СписокВыбора.Добавить(0.01, "Не заокруглювати");
	Элементы.P_RoundingAccuracy.СписокВыбора.Добавить(0.1, "До 10 копійок");
	Элементы.P_RoundingAccuracy.СписокВыбора.Добавить(0.5, "До 50 копійок");
	
	Элементы.P_Output.СписокВыбора.Очистить();
	Элементы.P_AdvancedOutputВыводЧека.СписокВыбора.Очистить();
	ВыводыЧека = Новый СписокЗначений;	
	ВыводыЧека.Добавить(0, "На екран");
	ВыводыЧека.Добавить(1, "На принтер");
	ВыводыЧека.Добавить(2, ?(P_BatchMode, "Не виводити", "На принтер чеків DEVICE MANAGER"));
	ВыводыЧека.Добавить(3, "Не виводити");	
	Для Каждого ВыводЧека Из ВыводыЧека Цикл
		ЗаполнитьЗначенияСвойств(Элементы.P_Output.СписокВыбора.Добавить(), ВыводЧека);
		ЗаполнитьЗначенияСвойств(Элементы.P_AdvancedOutputВыводЧека.СписокВыбора.Добавить(), ВыводЧека);
	КонецЦикла;		
	Элементы.P_Output.СписокВыбора.Добавить(4, "Розширене налаштування");
	УстановитьПредставлениеСпискаВыбораВТабличнойЧасти("P_AdvancedOutput", "ВыводЧека");
	
	Элементы.P_AdvancedOutputФискальноеЗадание.СписокВыбора.Очистить();
	Элементы.P_AdvancedOutputФискальноеЗадание.СписокВыбора.Добавить(1, "ПРОДАЖ");
	Элементы.P_AdvancedOutputФискальноеЗадание.СписокВыбора.Добавить(2, "ПОВЕРНЕННЯ");
	Элементы.P_AdvancedOutputФискальноеЗадание.СписокВыбора.Добавить(3, "СЛУЖБОВЕ ВНЕСЕННЯ");
	Элементы.P_AdvancedOutputФискальноеЗадание.СписокВыбора.Добавить(4, "СЛУЖБОВА ВИДАЧА");
	Элементы.P_AdvancedOutputФискальноеЗадание.СписокВыбора.Добавить(10, "X-ЗВІТ");
	Элементы.P_AdvancedOutputФискальноеЗадание.СписокВыбора.Добавить(11, "Z-ЗВІТ");
	Элементы.P_AdvancedOutputФискальноеЗадание.СписокВыбора.Добавить(12, "ПЕРІОДИЧНИЙ ЗВІТ (за номерами)");
	Элементы.P_AdvancedOutputФискальноеЗадание.СписокВыбора.Добавить(13, "ПЕРІОДИЧНИЙ ЗВІТ (за датами)");
	УстановитьПредставлениеСпискаВыбораВТабличнойЧасти("P_AdvancedOutput", "ФискальноеЗадание");
	  
	Если ПараметрыПодключения Тогда
		
		Элементы.P_Device.СписокВыбора.Очистить();	
		Элементы.P_CorrespondenceTableНалоговаяГруппаРРО.СписокВыбора.Очистить();
		
		Если ПустаяСтрока(P_Host) Тогда
			Возврат;
		КонецЕсли;
		
		ОбъектДрайвера = ПолучитьФорму("ОбщаяФорма.ДрайверВчасноКасаФискальныйРегистратор");
		ОтветУстройства = Неопределено;
		ОтветНалоговыеГруппы = Неопределено;
		Заголовки = Новый Соответствие;
		Если P_UseAuthentication Тогда
			Заголовки.Вставить("X-Api-Key", P_XApiKey);
		КонецЕсли;		
		Если ОбъектДрайвера.HTTP("GET", ?(P_SecureConnection, "https", "http"), P_Host, P_Port, "/dm/vchasno-kasa/api/v1/dashboard", Заголовки, , , ОтветУстройства, 1) Тогда
			Для Каждого Устройство Из ОтветУстройства["devices"] Цикл
				Элементы.P_Device.СписокВыбора.Добавить(Устройство["device"]);
				Если P_Device = Устройство["device"] Тогда
					Если ОбъектДрайвера.HTTP("GET", ?(P_SecureConnection, "https", "http"), P_Host, P_Port, "/dm/vchasno-kasa/api/v1/prro/groups?dev_id=" + Устройство["dev_id"], Заголовки, , , ОтветНалоговыеГруппы, 1) Тогда
						Для Каждого НалоговаяГруппа Из ОтветНалоговыеГруппы["fis_groups"] Цикл
							Элементы.P_CorrespondenceTableНалоговаяГруппаРРО.СписокВыбора.Добавить(НалоговаяГруппа["gr_id"], НалоговаяГруппа["caption"] + Символы.НПП + "(" + НалоговаяГруппа["tg_print"] + ")");						
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
		
		Элементы.P_Device.СписокВыбора.СортироватьПоЗначению();	
		Элементы.P_CorrespondenceTableНалоговаяГруппаРРО.СписокВыбора.СортироватьПоЗначению();
		УстановитьПредставлениеСпискаВыбораВТабличнойЧасти("P_CorrespondenceTable", "НалоговаяГруппаРРО");
		
	КонецЕсли;
	
	Если P_Output = 1 Или P_Output = 4 Тогда
		
		Элементы.P_Printer1.СписокВыбора.Очистить();
		Элементы.P_AdvancedOutputПринтер1.СписокВыбора.Очистить();
		
		Network = Новый COMОбъект("WScript.Network");
		EnumPrinterConnections = Network.EnumPrinterConnections();
		
		Сч = 1;
		Пока Сч < EnumPrinterConnections.Count() Цикл
			Элементы.P_Printer1.СписокВыбора.Добавить(EnumPrinterConnections.Item(Сч));
			Элементы.P_AdvancedOutputПринтер1.СписокВыбора.Добавить(EnumPrinterConnections.Item(Сч));
			Сч = Сч + 2;			
		КонецЦикла;
		
		Для Каждого Строка Из P_AdvancedOutput.НайтиСтроки(Новый Структура("ВыводЧека", 1)) Цикл
			Строка.Принтер = ?(ЗначениеЗаполнено(Строка.Принтер1) И Элементы.P_Printer1.СписокВыбора.НайтиПоЗначению(Строка.Принтер1) = Неопределено, "<NONE>", Строка.Принтер1);
		КонецЦикла;
		
		Элементы.P_Printer1.СписокВыбора.СортироватьПоЗначению();
		Элементы.P_AdvancedOutputПринтер1.СписокВыбора.СортироватьПоЗначению();
		
	КонецЕсли;
	
	Если P_Output = 2 Или P_Output = 4 Тогда
		
		Элементы.P_Printer2.СписокВыбора.Очистить();
		Элементы.P_AdvancedOutputПринтер2.СписокВыбора.Очистить();
		
		Если Не P_BatchMode Тогда
			
			Если ПустаяСтрока(P_Host) Тогда
				Возврат;
			КонецЕсли;
			
			ОбъектДрайвера = ПолучитьФорму("ОбщаяФорма.ДрайверВчасноКасаФискальныйРегистратор");
			Ответ = Неопределено;
			Заголовки = Новый Соответствие;
			Если P_UseAuthentication Тогда
				Заголовки.Вставить("X-Api-Key", P_XApiKey);
			КонецЕсли;
			Если ОбъектДрайвера.HTTP("GET", ?(P_SecureConnection, "https", "http"), P_Host, P_Port, "/dm/api/v3/devices", Заголовки, , , Ответ, 1) Тогда
				Для Каждого Устройство Из Ответ["devices"] Цикл
					Если Устройство["is_doc"] Тогда
						Элементы.P_Printer2.СписокВыбора.Добавить(Устройство["dev_code"]);
						Элементы.P_AdvancedOutputПринтер2.СписокВыбора.Добавить(Устройство["dev_code"]);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
		Для Каждого Строка Из P_AdvancedOutput.НайтиСтроки(Новый Структура("ВыводЧека", 2)) Цикл
			Строка.Принтер = ?(ЗначениеЗаполнено(Строка.Принтер2) И (Элементы.P_Printer2.СписокВыбора.НайтиПоЗначению(Строка.Принтер2) = Неопределено Или P_BatchMode), "<NONE>", Строка.Принтер2);
		КонецЦикла;
				
		Элементы.P_Printer2.СписокВыбора.СортироватьПоЗначению();
		Элементы.P_AdvancedOutputПринтер2.СписокВыбора.СортироватьПоЗначению();
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьТипСтавкаНДС()
	
	ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС");
	
	Элементы.P_CorrespondenceTableСтавкаНДС.ОграничениеТипа = ОграничениеТипа;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеСпискаВыбораВТабличнойЧасти(Таблица, Колонка)
	
	ПолеФормы = Элементы[Таблица + Колонка];
	
	Список = Новый СписокЗначений;
	
	Для Каждого Элемент Из ЭтаФорма[ПолеФормы.Родитель.ПутьКДанным] Цикл
		Если ПолеФормы.СписокВыбора.НайтиПоЗначению(Элемент[Колонка]) = Неопределено Тогда
			Список.Добавить(Элемент[Колонка], ?(ЗначениеЗаполнено(Элемент[Колонка]), "<NONE>", ""));                                      
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Элемент Из ПолеФормы.СписокВыбора Цикл
		Список.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Для Каждого Элемент Из Список Цикл
		ЭлементУсловногоОформленияКомпоновкиДанных = УсловноеОформление.Элементы.Добавить();
		
		ОформляемоеПолеКомпоновкиДанных = ЭлементУсловногоОформленияКомпоновкиДанных.Поля.Элементы.Добавить();
		ОформляемоеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных(ПолеФормы.Имя);
		
		ЭлементОтбораКомпоновкиДанных = ЭлементУсловногоОформленияКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораКомпоновкиДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеФормы.ПутьКДанным);
		ЭлементОтбораКомпоновкиДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбораКомпоновкиДанных.ПравоеЗначение = Элемент.Значение;
		
		ЭлементУсловногоОформленияКомпоновкиДанных.Оформление.УстановитьЗначениеПараметра("Текст", Элемент.Представление);
		ЭлементУсловногоОформленияКомпоновкиДанных.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", "Прижать влево");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура P_AdvancedOutputВыводЧекаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.P_AdvancedOutput.ТекущиеДанные;
	ТекущиеДанные.Принтер = ?(ТекущиеДанные.ВыводЧека = 1 Или ТекущиеДанные.ВыводЧека = 2, ТекущиеДанные["Принтер" + ТекущиеДанные.ВыводЧека], "");	
	
КонецПроцедуры

&НаКлиенте
Процедура P_AdvancedOutputПринтерПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.P_AdvancedOutput.ТекущиеДанные;
	
	Если ТекущиеДанные.ВыводЧека = 1 Или ТекущиеДанные.ВыводЧека = 2 Тогда
		ТекущиеДанные["Принтер" + ТекущиеДанные.ВыводЧека] = ТекущиеДанные.Принтер;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура P_AdvancedOutputПринтерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.P_AdvancedOutput.ТекущиеДанные;
	Принтеры = ?(ТекущиеДанные.ВыводЧека = 1 Или ТекущиеДанные.ВыводЧека = 2, Элементы["P_AdvancedOutputПринтер" + ТекущиеДанные.ВыводЧека].СписокВыбора, Новый СписокЗначений);
	
	Элемент.СписокВыбора.Очистить();
	Для Каждого Принтер Из Принтеры Цикл
		ЗаполнитьЗначенияСвойств(Элемент.СписокВыбора.Добавить(), Принтер);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначениеПараметров(ЗначениеПараметров)
	
	Если Не ЗначениеПараметров.Свойство("P_Host") И ЗначениеПараметров.Свойство("Сервер") Тогда
		ЗначениеПараметров.Вставить("P_Host", ЗначениеПараметров.Сервер);
	КонецЕсли;
	
	Если Не ЗначениеПараметров.Свойство("P_Port") И ЗначениеПараметров.Свойство("Порт") Тогда
		ЗначениеПараметров.Вставить("P_Port", ЗначениеПараметров.Порт);
	КонецЕсли;
	
	Если Не ЗначениеПараметров.Свойство("P_Device") И ЗначениеПараметров.Свойство("ИмяУстройства") Тогда
		ЗначениеПараметров.Вставить("P_Device", ЗначениеПараметров.ИмяУстройства);
	КонецЕсли;
	
	Если Не ЗначениеПараметров.Свойство("P_Output") И ЗначениеПараметров.Свойство("ВыводНаПринтер") Тогда
		ЗначениеПараметров.Вставить("P_Output", ЗначениеПараметров.ВыводНаПринтер);
	КонецЕсли;
	
	Если Не ЗначениеПараметров.Свойство("P_BatchMode") И ЗначениеПараметров.Свойство("ИспользоватьЭквайринг") Тогда
		ЗначениеПараметров.Вставить("P_BatchMode", ЗначениеПараметров.ИспользоватьЭквайринг);
	КонецЕсли;
	
КонецПроцедуры
    