Функция СоздатьАктРабот(ДатаАкта, Ответственный) Экспорт 
	
	АктРабот = Документы.АктРабот.СоздатьДокумент();
	АктРабот.Дата = ДатаАкта;
	АктРабот.Ответственный = Справочники.Заведения.ПолучитьЗаведение(Ответственный);
	АктРабот.Записать();
	Сообщить("Успешно создан новый акт работа за " + Строка(ДатаАкта) + " - " + Ответственный.Наименование + "!");
	
	Возврат АктРабот.Ссылка;
	
КонецФункции

Функция ДобавитЗаписьВАктРабот(СсылкаНаАктРабот, СсылкаНаЗадачу) Экспорт 
	
	АктРабот = СсылкаНаАктРабот.ПолучитьОбъект();
	НоваяЗадача = АктРабот.ТЧ.НоваяСтрока();
	АктРабот.Записать();
	
КонецФункции

Функция СсылкаНаАктРабот(ДатаАкта, Ответственный) Экспорт 
	
	//найти документ акта
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктРабот.Дата КАК Дата,
		|	АктРабот.Ответственный КАК Ответственный,
		|	АктРабот.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.АктРабот КАК АктРабот
		|ГДЕ
		|	АктРабот.Дата = &Дата
		|	И АктРабот.Ответственный = &Ответственный";
	
	Запрос.УстановитьПараметр("Дата", ДатаАкта);
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;	
	КонецЦикла;

	
КонецФункции



