
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!

	// регістр РегистрацияРабот
	Движения.РегистрацияРабот.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ Из ТЧ Цикл
		Движение = Движения.РегистрацияРабот.Добавить();
		Движение.Период = Дата;
		Движение.Объект = ТекСтрокаТЧ.Объект;
		Движение.ВидРабот = ТекСтрокаТЧ.ВидРабот;
		Движение.Статус = ТекСтрокаТЧ.Статус;
		Движение.Коментарий = ТекСтрокаТЧ.Коментарий;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
